//ੴ ਸਤਿਗੁਰ ਪ੍ਰਸਾਦਿ ਪਾਤਸਾਹੀ ॥੧੦॥
// ੴ ਸ੍ਰੀ ਵਾਹਿਗੁਰੂ ਜੀ ਕੀ ਫਤਹਿ
// ਤੁਮ੍‍ਰੋ 

class PunjabiPath {
  const PunjabiPath();

  static const String ardas = '''ਅਰਦਾਸ

ੴ ਸ੍ਰੀ ਵਾਹਿਗੁਰੂ ਜੀ ਕੀ ਫ਼ਤਹਿ॥
ਸ੍ਰੀ ਭਗੌਤੀ ਜੀ ਸਹਾਇ॥
ਵਾਰ ਸ੍ਰੀ ਭਗੌਤੀ ਜੀ ਕੀ ਪਾਤਸ਼ਾਹੀ੧੦॥

ਪ੍ਰਿਥਮ ਭਗੌਤੀ ਸਿਮਰਿ ਕੈ ਗੁਰ ਨਾਨਕ ਲਈਂ ਧਿਆਇ॥
ਫਿਰ ਅੰਗਦ ਗੁਰ ਤੇ ਅਮਰਦਾਸੁ ਰਾਮਦਾਸੈ ਹੋਈਂ ਸਹਾਇ॥

ਅਰਜਨ ਹਰਗੋਬਿੰਦ ਨੋ ਸਿਮਰੌ ਸ੍ਰੀ ਹਰਿਰਾਇ॥
ਸ੍ਰੀ ਹਰਿਕ੍ਰਿਸ਼ਨ ਧਿਆਇਐ ਜਿਸ ਡਿਠੈ ਸਭਿ ਦੁਖ ਜਾਇ॥
ਤੇਗ ਬਹਾਦਰ ਸਿਮਰਿਐ ਘਰ ਨਉ ਨਿਧਿ ਆਵੈ ਧਾਇ॥
ਸਭ ਥਾਂਈ ਹੋਇ ਸਹਾਇ॥

ਦਸਵਾਂ ਪਾਤਸ਼ਾਹ ਸ੍ਰੀ ਗੁਰੂ ਗੋਬਿੰਦ ਸਿੰਘ ਸਾਹਿਬ ਜੀ ਸਭ ਥਾਂਈ ਹੋਇ ਸਹਾਇ॥
ਦਸਾਂ ਪਾਤਸ਼ਾਹੀਆਂ ਦੀ ਜੋਤ ਸ੍ਰੀ ਗੁਰੂ ਗ੍ਰੰਥ ਸਾਹਿਬ ਜੀ ਦੇ ਪਾਠ ਦੀਦਾਰ ਦਾ ਧਿਆਨ ਧਰ ਕੇ ਬੋਲੋ ਜੀ ਵਾਹਿਗੁਰੂ॥

ਪੰਜਾਂ ਪਿਆਰਿਆਂ,ਚੌਹਾਂ ਸਾਹਿਬਜ਼ਾਦਿਆਂ, ਚਾਲ੍ਹੀਆਂ ਮੁਕਤਿਆਂ, ਹਠੀਆਂ ਜਪੀਆਂ, ਤਪੀਆਂ,
ਜਿਹਨਾਂ ਨਾਮ ਜਪਿਆ, ਵੰਡ ਛਕਿਆ, ਦੇਗ ਚਲਾਈ, ਤੇਗ ਵਾਹੀ, ਦੇਖ ਕੇ ਅਣਡਿੱਠ ਕੀਤਾ,
ਤਿਨ੍ਹਾਂ ਪਿਆਰਿਆਂ, ਸਚਿਆਰਿਆਂ ਦੀ ਕਮਾਈ ਦਾ ਧਿਆਨ ਧਰ ਕੇ, ਖਾਲਸਾ ਜੀ, ਬੋਲੋ ਜੀ ਵਾਹਿਗੁਰੂ॥

ਜਿਨ੍ਹਾਂ ਸਿੰਘਾਂ ਸਿੰਘਣੀਆਂ ਨੇ ਧਰਮ ਹੇਤ ਸੀਸ ਦਿੱਤੇ, ਬੰਦ ਬੰਦ ਕਟਾਏ, ਖੋਪਰੀਆਂ ਲੁਹਾਈਆਂ,
ਚਰਖੀਆਂ ਤੇ ਚੜੇ, ਆਰਿਆਂ ਨਾਲ ਚਿਰਾਏ ਗਏ, ਗੁਰਦਵਾਰਿਆਂ ਦੀ ਸੇਵਾ ਲਈ ਕੁਰਬਾਨੀਆਂ ਕੀਤੀਆਂ,
ਧਰਮ ਨਹੀਂ ਹਾਰਿਆ, ਸਿੱਖੀ ਕੇਸਾਂ ਸੁਆਸਾਂ ਨਾਲ ਨਿਬਾਹੀ, ਤਿਨ੍ਹਾਂ ਦੀ ਕਮਾਈ ਦਾ ਧਿਆਨ ਧਰ ਕੇ ਖਾਲਸਾ ਜੀ॥
ਬੋਲੋ ਜੀ ਵਾਹਿਗੁਰੂ 

ਪੰਜਾਂ ਤਖਤਾਂ, ਸਰਬੱਤ ਗੁਰਦੁਆਰਿਆਂ ਦਾ ਧਿਆਨ ਧਰ ਕੇ ਬੋਲੋ ਜੀ ਵਾਹਿਗੁਰੂ॥
ਪ੍ਰਿਥਮੇ ਸਰਬੱਤ ਖਾਲਸਾ ਜੀ ਕੀ ਅਰਦਾਸ ਹੈ ਜੀ, ਸਰਬੱਤ ਖਾਲਸਾ ਜੀ ਕੋ ਵਾਹਿਗੁਰੂ, ਵਾਹਿਗੁਰੂ, ਵਾਹਿਗੁਰੂ ਚਿਤ ਆਵੇ,
ਚਿੱਤ ਆਵਨ ਕਾ ਸਦਕਾ ਸਰਬ ਸੁਖ ਹੋਵੇ। ਜਹਾਂ ਜਹਾਂ ਖਾਲਸਾ ਜੀ ਸਾਹਿਬ, ਤਹਾਂ ਤਹਾਂ ਰਛਿਆ ਰਿਆਇਤ, ਦੇਗ ਤੇਗ ਫ਼ਤਹ,
ਬਿਰਦ ਕੀ ਪੈਜ, ਪੰਥ ਕੀ ਜੀਤ, ਸ੍ਰੀ ਸਾਹਿਬ ਜੀ ਸਹਾਇ, ਖਾਲਸੇ ਜੀ ਕੇ ਬੋਲ ਬਾਲੇ, ਬੋਲੋ ਜੀ ਵਾਹਿਗੁਰੂ॥

ਸਿੱਖਾਂ ਨੂੰ ਸਿੱਖੀ ਦਾਨ, ਕੇਸ ਦਾਨ, ਰਹਿਤ ਦਾਨ, ਬਿਬੇਕ ਦਾਨ, ਵਿਸਾਹ ਦਾਨ, ਭਰੋਸਾ ਦਾਨ, ਦਾਨਾਂ ਸਿਰ ਦਾਨ,
ਨਾਮ ਦਾਨ ਸ੍ਰੀ ਅੰਮ੍ਰਿਤਸਰ ਸਾਹਿਬ ਜੀ ਦੇ ਇਸ਼ਨਾਨ, ਚੌਕੀਆਂ, ਝੰਡੇ, ਬੁੰਗੇ, ਜੁਗੋ ਜੁਗ ਅਟੱਲ, ਧਰਮ ਕਾ ਜੈਕਾਰ, ਬੋਲੋ ਜੀ ਵਾਹਿਗੁਰੂ॥

ਸਿੱਖਾਂ ਦਾ ਮਨ ਨੀਵਾਂ, ਮਤ ਉੱਚੀ ਮਤ ਦਾ ਰਾਖਾ ਆਪਿ ਵਾਹਿਗੁਰੂ॥

ਹੇ ਅਕਾਲ ਪੁਰਖ ਆਪਣੇ ਪੰਥ ਦੇ ਸਦਾ ਸਹਾਈ ਦਾਤਾਰ ਜੀਓ॥
ਸ੍ਰੀ ਨਨਕਾਣਾ ਸਾਹਿਬ ਤੇ ਹੋਰ ਗੁਰਦੁਆਰਿਆਂ ਗੁਰਧਾਮਾਂ ਦੇ,
ਜਿਨ੍ਹਾਂ ਤੋਂ ਪੰਥ ਨੂੰ ਵਿਛੋੜਿਆ ਗਿਆ ਹੈ, ਖੁਲ੍ਹੇ ਦਰਸ਼ਨ ਦੀਦਾਰ ਤੇ ਸੇਵਾ ਸੰਭਾਲ ਦਾ ਦਾਨ ਖ਼ਾਲਸਾ ਜੀ ਨੂੰ ਬਖਸ਼ੋ।

ਹੇ ਨਿਮਾਣਿਆਂ ਦੇ ਮਾਣ, ਨਿਤਾਣਿਆਂ ਦੇ ਤਾਣ, ਨਿਓਟਿਆਂ ਦੀ ਓਟ, ਸੱਚੇ ਪਿਤਾ, ਵਾਹਿਗੁਰੂ (ਆਪ ਜੀ ਦੇ ਹਜ਼ੂਰ ...)ਦੀ ਅਰਦਾਸ ਹੈ ਜੀ।

ਅੱਖਰ ਵਾਧਾ ਘਾਟਾ ਭੁੱਲ ਚੁੱਕ ਮਾਫ ਕਰਨੀ।
ਸਰਬੱਤ ਦੇ ਕਾਰਜ ਰਾਸ ਕਰਨੇ।

ਸੇਈ ਪਿਆਰੇ ਮੇਲ, ਜਿਨ੍ਹਾਂ ਮਿਲਿਆਂ ਤੇਰਾ ਨਾਮ ਚਿਤ ਆਵੇ।
ਨਾਨਕ ਨਾਮ ਚੜ੍ਹਦੀ ਕਲਾ, ਤੇਰੇ ਭਾਣੇ ਸਰਬੱਤ ਦਾ ਭਲਾ।
ਵਾਹਿਗੁਰੂ ਜੀ ਕਾ ਖ਼ਾਲਸਾ, ਵਾਹਿਗੁਰੂ ਜੀ ਕੀ ਫਤਹਿ॥''';

static const String sukhmaniSahib = '''ਸੁਖਮਨੀ ਸਾਹਿਬ
ਗਉੜੀ ਸੁਖਮਨੀ ਮਃ ੫ ॥

ਸਲੋਕੁ ॥
ੴ ਸਤਿਗੁਰ ਪ੍ਰਸਾਦਿ ॥
ਆਦਿ ਗੁਰਏ ਨਮਹ ॥
ਜੁਗਾਦਿ ਗੁਰਏ ਨਮਹ ॥
ਸਤਿਗੁਰਏ ਨਮਹ ॥
ਸ੍ਰੀ ਗੁਰਦੇਵਏ ਨਮਹ ॥੧॥

ਅਸਟਪਦੀ ॥
ਸਿਮਰਉ ਸਿਮਰਿ ਸਿਮਰਿ ਸੁਖੁ ਪਾਵਉ ॥
ਕਲਿ ਕਲੇਸ ਤਨ ਮਾਹਿ ਮਿਟਾਵਉ ॥
ਸਿਮਰਉ ਜਾਸੁ ਬਿਸੁੰਭਰ ਏਕੈ ॥
ਨਾਮੁ ਜਪਤ ਅਗਨਤ ਅਨੇਕੈ ॥
ਬੇਦ ਪੁਰਾਨ ਸਿੰਮ੍ਰਿਤਿ ਸੁਧਾਖ੍ਹਰ ॥
ਕੀਨੇ ਰਾਮ ਨਾਮ ਇਕ ਆਖ੍ਹਰ ॥
ਕਿਨਕਾ ਏਕ ਜਿਸੁ ਜੀਅ ਬਸਾਵੈ ॥
ਤਾ ਕੀ ਮਹਿਮਾ ਗਨੀ ਨ ਆਵੈ ॥
ਕਾਂਖੀ ਏਕੈ ਦਰਸ ਤੁਹਾਰੋ ॥
ਨਾਨਕ ਉਨ ਸੰਗਿ ਮੋਹਿ ਉਧਾਰੋ ॥੧॥

ਸੁਖਮਨੀ ਸੁਖ ਅੰਮ੍ਰਿਤ ਪ੍ਰਭ ਨਾਮੁ ॥
ਭਗਤ ਜਨਾ ਕੈ ਮਨਿ ਬਿਸ੍ਰਾਮ ॥ ਰਹਾਉ ॥
ਪ੍ਰਭ ਕੈ ਸਿਮਰਨਿ ਗਰਭਿ ਨ ਬਸੈ ॥
ਪ੍ਰਭ ਕੈ ਸਿਮਰਨਿ ਦੂਖੁ ਜਮੁ ਨਸੈ ॥
ਪ੍ਰਭ ਕੈ ਸਿਮਰਨਿ ਕਾਲੁ ਪਰਹਰੈ ॥
ਪ੍ਰਭ ਕੈ ਸਿਮਰਨਿ ਦੁਸਮਨੁ ਟਰੈ ॥
ਪ੍ਰਭ ਸਿਮਰਤ ਕਛੁ ਬਿਘਨੁ ਨ ਲਾਗੈ ॥
ਪ੍ਰਭ ਕੈ ਸਿਮਰਨਿ ਅਨਦਿਨੁ ਜਾਗੈ ॥
ਪ੍ਰਭ ਕੈ ਸਿਮਰਨਿ ਭਉ ਨ ਬਿਆਪੈ ॥
ਪ੍ਰਭ ਕੈ ਸਿਮਰਨਿ ਦੁਖੁ ਨ ਸੰਤਾਪੈ ॥
ਪ੍ਰਭ ਕਾ ਸਿਮਰਨੁ ਸਾਧ ਕੈ ਸੰਗਿ ॥
ਸਰਬ ਨਿਧਾਨ ਨਾਨਕ ਹਰਿ ਰੰਗਿ ॥੨॥

ਪ੍ਰਭ ਕੈ ਸਿਮਰਨਿ ਰਿਧਿ ਸਿਧਿ ਨਉ ਨਿਧਿ ॥
ਪ੍ਰਭ ਕੈ ਸਿਮਰਨਿ ਗਿਆਨੁ ਧਿਆਨੁ ਤਤੁ ਬੁਧਿ ॥
ਪ੍ਰਭ ਕੈ ਸਿਮਰਨਿ ਜਪ ਤਪ ਪੂਜਾ ॥
ਪ੍ਰਭ ਕੈ ਸਿਮਰਨਿ ਬਿਨਸੈ ਦੂਜਾ ॥
ਪ੍ਰਭ ਕੈ ਸਿਮਰਨਿ ਤੀਰਥ ਇਸਨਾਨੀ ॥
ਪ੍ਰਭ ਕੈ ਸਿਮਰਨਿ ਦਰਗਹ ਮਾਨੀ ॥
ਪ੍ਰਭ ਕੈ ਸਿਮਰਨਿ ਹੋਇ ਸੁ ਭਲਾ ॥
ਪ੍ਰਭ ਕੈ ਸਿਮਰਨਿ ਸੁਫਲ ਫਲਾ ॥
ਸੇ ਸਿਮਰਹਿ ਜਿਨ ਆਪਿ ਸਿਮਰਾਏ ॥
ਨਾਨਕ ਤਾ ਕੈ ਲਾਗਉ ਪਾਏ ॥੩॥

ਪ੍ਰਭ ਕਾ ਸਿਮਰਨੁ ਸਭ ਤੇ ਊਚਾ ॥
ਪ੍ਰਭ ਕੈ ਸਿਮਰਨਿ ਉਧਰੇ ਮੂਚਾ ॥
ਪ੍ਰਭ ਕੈ ਸਿਮਰਨਿ ਤ੍ਰਿਸਨਾ ਬੁਝੈ ॥
ਪ੍ਰਭ ਕੈ ਸਿਮਰਨਿ ਸਭੁ ਕਿਛੁ ਸੁਝੈ ॥
ਪ੍ਰਭ ਕੈ ਸਿਮਰਨਿ ਨਾਹੀ ਜਮ ਤ੍ਰਾਸਾ ॥
ਪ੍ਰਭ ਕੈ ਸਿਮਰਨਿ ਪੂਰਨ ਆਸਾ ॥
ਪ੍ਰਭ ਕੈ ਸਿਮਰਨਿ ਮਨ ਕੀ ਮਲੁ ਜਾਇ ॥
ਅੰਮ੍ਰਿਤ ਨਾਮੁ ਰਿਦ ਮਾਹਿ ਸਮਾਇ ॥
ਪ੍ਰਭ ਜੀ ਬਸਹਿ ਸਾਧ ਕੀ ਰਸਨਾ ॥
ਨਾਨਕ ਜਨ ਕਾ ਦਾਸਨਿ ਦਸਨਾ ॥੪॥

ਪ੍ਰਭ ਕਉ ਸਿਮਰਹਿ ਸੇ ਧਨਵੰਤੇ ॥
ਪ੍ਰਭ ਕਉ ਸਿਮਰਹਿ ਸੇ ਪਤਿਵੰਤੇ ॥
ਪ੍ਰਭ ਕਉ ਸਿਮਰਹਿ ਸੇ ਜਨ ਪਰਵਾਨ ॥
ਪ੍ਰਭ ਕਉ ਸਿਮਰਹਿ ਸੇ ਪੁਰਖ ਪ੍ਰਧਾਨ ॥
ਪ੍ਰਭ ਕਉ ਸਿਮਰਹਿ ਸਿ ਬੇਮੁਹਤਾਜੇ ॥
ਪ੍ਰਭ ਕਉ ਸਿਮਰਹਿ ਸਿ ਸਰਬ ਕੇ ਰਾਜੇ ॥
ਪ੍ਰਭ ਕਉ ਸਿਮਰਹਿ ਸੇ ਸੁਖਵਾਸੀ ॥
ਪ੍ਰਭ ਕਉ ਸਿਮਰਹਿ ਸਦਾ ਅਬਿਨਾਸੀ ॥
ਸਿਮਰਨ ਤੇ ਲਾਗੇ ਜਿਨ ਆਪਿ ਦਇਆਲਾ ॥
ਨਾਨਕ ਜਨ ਕੀ ਮੰਗੈ ਰਵਾਲਾ ॥੫॥

ਪ੍ਰਭ ਕਉ ਸਿਮਰਹਿ ਸੇ ਪਰਉਪਕਾਰੀ ॥
ਪ੍ਰਭ ਕਉ ਸਿਮਰਹਿ ਤਿਨ ਸਦ ਬਲਿਹਾਰੀ ॥
ਪ੍ਰਭ ਕਉ ਸਿਮਰਹਿ ਸੇ ਮੁਖ ਸੁਹਾਵੇ ॥
ਪ੍ਰਭ ਕਉ ਸਿਮਰਹਿ ਤਿਨ ਸੂਖਿ ਬਿਹਾਵੈ ॥
ਪ੍ਰਭ ਕਉ ਸਿਮਰਹਿ ਤਿਨ ਆਤਮੁ ਜੀਤਾ ॥
ਪ੍ਰਭ ਕਉ ਸਿਮਰਹਿ ਤਿਨ ਨਿਰਮਲ ਰੀਤਾ ॥
ਪ੍ਰਭ ਕਉ ਸਿਮਰਹਿ ਤਿਨ ਅਨਦ ਘਨੇਰੇ ॥
ਪ੍ਰਭ ਕਉ ਸਿਮਰਹਿ ਬਸਹਿ ਹਰਿ ਨੇਰੇ ॥
ਸੰਤ ਕ੍ਰਿਪਾ ਤੇ ਅਨਦਿਨੁ ਜਾਗਿ ॥
ਨਾਨਕ ਸਿਮਰਨੁ ਪੂਰੈ ਭਾਗਿ ॥੬॥

ਪ੍ਰਭ ਕੈ ਸਿਮਰਨਿ ਕਾਰਜ ਪੂਰੇ ॥
ਪ੍ਰਭ ਕੈ ਸਿਮਰਨਿ ਕਬਹੁ ਨ ਝੂਰੇ ॥
ਪ੍ਰਭ ਕੈ ਸਿਮਰਨਿ ਹਰਿ ਗੁਨ ਬਾਨੀ ॥
ਪ੍ਰਭ ਕੈ ਸਿਮਰਨਿ ਸਹਜਿ ਸਮਾਨੀ ॥
ਪ੍ਰਭ ਕੈ ਸਿਮਰਨਿ ਨਿਹਚਲ ਆਸਨੁ ॥
ਪ੍ਰਭ ਕੈ ਸਿਮਰਨਿ ਕਮਲ ਬਿਗਾਸਨੁ ॥
ਪ੍ਰਭ ਕੈ ਸਿਮਰਨਿ ਅਨਹਦ ਝੁਨਕਾਰ ॥
ਸੁਖੁ ਪ੍ਰਭ ਸਿਮਰਨ ਕਾ ਅੰਤੁ ਨ ਪਾਰ ॥
ਸਿਮਰਹਿ ਸੇ ਜਨ ਜਿਨ ਕਉ ਪ੍ਰਭ ਮਇਆ ॥
ਨਾਨਕ ਤਿਨ ਜਨ ਸਰਨੀ ਪਇਆ ॥੭॥

ਹਰਿ ਸਿਮਰਨੁ ਕਰਿ ਭਗਤ ਪ੍ਰਗਟਾਏ ॥
ਹਰਿ ਸਿਮਰਨਿ ਲਗਿ ਬੇਦ ਉਪਾਏ ॥
ਹਰਿ ਸਿਮਰਨਿ ਭਏ ਸਿਧ ਜਤੀ ਦਾਤੇ ॥
ਹਰਿ ਸਿਮਰਨਿ ਨੀਚ ਚਹੁ ਕੁੰਟ ਜਾਤੇ ॥
ਹਰਿ ਸਿਮਰਨਿ ਧਾਰੀ ਸਭ ਧਰਨਾ ॥
ਸਿਮਰਿ ਸਿਮਰਿ ਹਰਿ ਕਾਰਨ ਕਰਨਾ ॥
ਹਰਿ ਸਿਮਰਨਿ ਕੀਓ ਸਗਲ ਅਕਾਰਾ ॥
ਹਰਿ ਸਿਮਰਨ ਮਹਿ ਆਪਿ ਨਿਰੰਕਾਰਾ ॥
ਕਰਿ ਕਿਰਪਾ ਜਿਸੁ ਆਪਿ ਬੁਝਾਇਆ ॥
ਨਾਨਕ ਗੁਰਮੁਖਿ ਹਰਿ ਸਿਮਰਨੁ ਤਿਨਿ ਪਾਇਆ ॥੮॥੧॥

ਸਲੋਕੁ ॥
ਦੀਨ ਦਰਦ ਦੁਖ ਭੰਜਨਾ ਘਟਿ ਘਟਿ ਨਾਥ ਅਨਾਥ ॥
ਸਰਣਿ ਤੁਮਾ੍ਰੀ ਆਇਓ ਨਾਨਕ ਕੇ ਪ੍ਰਭ ਸਾਥ ॥੧॥

ਅਸਟਪਦੀ ॥
ਜਹ ਮਾਤ ਪਿਤਾ ਸੁਤ ਮੀਤ ਨ ਭਾਈ ॥
ਮਨ ਊਹਾ ਨਾਮੁ ਤੇਰੈ ਸੰਗਿ ਸਹਾਈ ॥
ਜਹ ਮਹਾ ਭਇਆਨ ਦੂਤ ਜਮ ਦਲੈ ॥
ਤਹ ਕੇਵਲ ਨਾਮੁ ਸੰਗਿ ਤੇਰੈ ਚਲੈ ॥
ਜਹ ਮੁਸਕਲ ਹੋਵੈ ਅਤਿ ਭਾਰੀ ॥
ਹਰਿ ਕੋ ਨਾਮੁ ਖਿਨ ਮਾਹਿ ਉਧਾਰੀ ॥
ਅਨਿਕ ਪੁਨਹਚਰਨ ਕਰਤ ਨਹੀ ਤਰੈ ॥
ਹਰਿ ਕੋ ਨਾਮੁ ਕੋਟਿ ਪਾਪ ਪਰਹਰੈ ॥
ਗੁਰਮੁਖਿ ਨਾਮੁ ਜਪਹੁ ਮਨ ਮੇਰੇ ॥
ਨਾਨਕ ਪਾਵਹੁ ਸੂਖ ਘਨੇਰੇ ॥੧॥

ਸਗਲ ਸ੍ਰਿਸਟਿ ਕੋ ਰਾਜਾ ਦੁਖੀਆ ॥
ਹਰਿ ਕਾ ਨਾਮੁ ਜਪਤ ਹੋਇ ਸੁਖੀਆ ॥
ਲਾਖ ਕਰੋਰੀ ਬੰਧੁ ਨ ਪਰੈ ॥
ਹਰਿ ਕਾ ਨਾਮੁ ਜਪਤ ਨਿਸਤਰੈ ॥
ਅਨਿਕ ਮਾਇਆ ਰੰਗ ਤਿਖ ਨ ਬੁਝਾਵੈ ॥
ਹਰਿ ਕਾ ਨਾਮੁ ਜਪਤ ਆਘਾਵੈ ॥
ਜਿਹ ਮਾਰਗਿ ਇਹੁ ਜਾਤ ਇਕੇਲਾ ॥
ਤਹ ਹਰਿ ਨਾਮੁ ਸੰਗਿ ਹੋਤ ਸੁਹੇਲਾ ॥
ਐਸਾ ਨਾਮੁ ਮਨ ਸਦਾ ਧਿਆਈਐ ॥
ਨਾਨਕ ਗੁਰਮੁਖਿ ਪਰਮ ਗਤਿ ਪਾਈਐ ॥੨॥

ਛੂਟਤ ਨਹੀ ਕੋਟਿ ਲਖ ਬਾਹੀ ॥
ਨਾਮੁ ਜਪਤ ਤਹ ਪਾਰਿ ਪਰਾਹੀ ॥
ਅਨਿਕ ਬਿਘਨ ਜਹ ਆਇ ਸੰਘਾਰੈ ॥
ਹਰਿ ਕਾ ਨਾਮੁ ਤਤਕਾਲ ਉਧਾਰੈ ॥
ਅਨਿਕ ਜੋਨਿ ਜਨਮੈ ਮਰਿ ਜਾਮ ॥
ਨਾਮੁ ਜਪਤ ਪਾਵੈ ਬਿਸ੍ਰਾਮ ॥
ਹਉ ਮੈਲਾ ਮਲੁ ਕਬਹੁ ਨ ਧੋਵੈ ॥
ਹਰਿ ਕਾ ਨਾਮੁ ਕੋਟਿ ਪਾਪ ਖੋਵੈ ॥
ਐਸਾ ਨਾਮੁ ਜਪਹੁ ਮਨ ਰੰਗਿ ॥
ਨਾਨਕ ਪਾਈਐ ਸਾਧ ਕੈ ਸੰਗਿ ॥੩॥

ਜਿਹ ਮਾਰਗ ਕੇ ਗਨੇ ਜਾਹਿ ਨ ਕੋਸਾ ॥
ਹਰਿ ਕਾ ਨਾਮੁ ਊਹਾ ਸੰਗਿ ਤੋਸਾ ॥
ਜਿਹ ਪੈਡੈ ਮਹਾ ਅੰਧ ਗੁਬਾਰਾ ॥
ਹਰਿ ਕਾ ਨਾਮੁ ਸੰਗਿ ਉਜੀਆਰਾ ॥
ਜਹਾ ਪੰਥਿ ਤੇਰਾ ਕੋ ਨ ਸਿਞਾਨੂ ॥
ਹਰਿ ਕਾ ਨਾਮੁ ਤਹ ਨਾਲਿ ਪਛਾਨੂ ॥
ਜਹ ਮਹਾ ਭਇਆਨ ਤਪਤਿ ਬਹੁ ਘਾਮ ॥
ਤਹ ਹਰਿ ਕੇ ਨਾਮ ਕੀ ਤੁਮ ਊਪਰਿ ਛਾਮ ॥
ਜਹਾ ਤ੍ਰਿਖਾ ਮਨ ਤੁਝੁ ਆਕਰਖੈ ॥
ਤਹ ਨਾਨਕ ਹਰਿ ਹਰਿ ਅੰਮ੍ਰਿਤੁ ਬਰਖੈ ॥੪॥

ਭਗਤ ਜਨਾ ਕੀ ਬਰਤਨਿ ਨਾਮੁ ॥
ਸੰਤ ਜਨਾ ਕੈ ਮਨਿ ਬਿਸ੍ਰਾਮੁ ॥
ਹਰਿ ਕਾ ਨਾਮੁ ਦਾਸ ਕੀ ਓਟ ॥
ਹਰਿ ਕੈ ਨਾਮਿ ਉਧਰੇ ਜਨ ਕੋਟਿ ॥
ਹਰਿ ਜਸੁ ਕਰਤ ਸੰਤ ਦਿਨੁ ਰਾਤਿ ॥
ਹਰਿ ਹਰਿ ਅਉਖਧੁ ਸਾਧ ਕਮਾਤਿ ॥
ਹਰਿ ਜਨ ਕੈ ਹਰਿ ਨਾਮੁ ਨਿਧਾਨੁ ॥
ਪਾਰਬ੍ਰਹਮਿ ਜਨ ਕੀਨੋ ਦਾਨ ॥
ਮਨ ਤਨ ਰੰਗਿ ਰਤੇ ਰੰਗ ਏਕੈ ॥
ਨਾਨਕ ਜਨ ਕੈ ਬਿਰਤਿ ਬਿਬੇਕੈ ॥੫॥

ਹਰਿ ਕਾ ਨਾਮੁ ਜਨ ਕਉ ਮੁਕਤਿ ਜੁਗਤਿ ॥
ਹਰਿ ਕੈ ਨਾਮਿ ਜਨ ਕਉ ਤ੍ਰਿਪਤਿ ਭੁਗਤਿ ॥
ਹਰਿ ਕਾ ਨਾਮੁ ਜਨ ਕਾ ਰੂਪ ਰੰਗੁ ॥
ਹਰਿ ਨਾਮੁ ਜਪਤ ਕਬ ਪਰੈ ਨ ਭੰਗੁ ॥
ਹਰਿ ਕਾ ਨਾਮੁ ਜਨ ਕੀ ਵਡਿਆਈ ॥
ਹਰਿ ਕੈ ਨਾਮਿ ਜਨ ਸੋਭਾ ਪਾਈ ॥
ਹਰਿ ਕਾ ਨਾਮੁ ਜਨ ਕਉ ਭੋਗ ਜੋਗ ॥
ਹਰਿ ਨਾਮੁ ਜਪਤ ਕਛੁ ਨਾਹਿ ਬਿਓਗੁ ॥
ਜਨੁ ਰਾਤਾ ਹਰਿ ਨਾਮ ਕੀ ਸੇਵਾ ॥
ਨਾਨਕ ਪੂਜੈ ਹਰਿ ਹਰਿ ਦੇਵਾ ॥੬॥

ਹਰਿ ਹਰਿ ਜਨ ਕੈ ਮਾਲੁ ਖਜੀਨਾ ॥
ਹਰਿ ਧਨੁ ਜਨ ਕਉ ਆਪਿ ਪ੍ਰਭਿ ਦੀਨਾ ॥
ਹਰਿ ਹਰਿ ਜਨ ਕੈ ਓਟ ਸਤਾਣੀ ॥
ਹਰਿ ਪ੍ਰਤਾਪਿ ਜਨ ਅਵਰ ਨ ਜਾਣੀ ॥
ਓਤਿ ਪੋਤਿ ਜਨ ਹਰਿ ਰਸਿ ਰਾਤੇ ॥
ਸੁੰਨ ਸਮਾਧਿ ਨਾਮ ਰਸ ਮਾਤੇ ॥
ਆਠ ਪਹਰ ਜਨੁ ਹਰਿ ਹਰਿ ਜਪੈ ॥
ਹਰਿ ਕਾ ਭਗਤੁ ਪ੍ਰਗਟ ਨਹੀ ਛਪੈ ॥
ਹਰਿ ਕੀ ਭਗਤਿ ਮੁਕਤਿ ਬਹੁ ਕਰੇ ॥
ਨਾਨਕ ਜਨ ਸੰਗਿ ਕੇਤੇ ਤਰੇ ॥੭॥

ਪਾਰਜਾਤੁ ਇਹੁ ਹਰਿ ਕੋ ਨਾਮ ॥
ਕਾਮਧੇਨ ਹਰਿ ਹਰਿ ਗੁਣ ਗਾਮ ॥
ਸਭ ਤੇ ਊਤਮ ਹਰਿ ਕੀ ਕਥਾ ॥
ਨਾਮੁ ਸੁਨਤ ਦਰਦ ਦੁਖ ਲਥਾ ॥
ਨਾਮ ਕੀ ਮਹਿਮਾ ਸੰਤ ਰਿਦ ਵਸੈ ॥
ਸੰਤ ਪ੍ਰਤਾਪਿ ਦੁਰਤੁ ਸਭੁ ਨਸੈ ॥
ਸੰਤ ਕਾ ਸੰਗੁ ਵਡਭਾਗੀ ਪਾਈਐ ॥
ਸੰਤ ਕੀ ਸੇਵਾ ਨਾਮੁ ਧਿਆਈਐ ॥
ਨਾਮ ਤੁਲਿ ਕਛੁ ਅਵਰੁ ਨ ਹੋਇ ॥
ਨਾਨਕ ਗੁਰਮੁਖਿ ਨਾਮੁ ਪਾਵੈ ਜਨੁ ਕੋਇ ॥੮॥੨॥

ਸਲੋਕੁ ॥
ਬਹੁ ਸਾਸਤ੍ਰ ਬਹੁ ਸਿਮ੍ਰਿਤੀ ਪੇਖੇ ਸਰਬ ਢਢੋਲਿ ॥
ਪੂਜਸਿ ਨਾਹੀ ਹਰਿ ਹਰੇ ਨਾਨਕ ਨਾਮ ਅਮੋਲ ॥੧॥

ਅਸਟਪਦੀ ॥
ਜਾਪ ਤਾਪ ਗਿਆਨ ਸਭਿ ਧਿਆਨ ॥
ਖਟ ਸਾਸਤ੍ਰ ਸਿਮ੍ਰਿਤਿ ਵਖਿਆਨ ॥
ਜੋਗ ਅਭਿਆਸ ਕਰਮ ਧ੍ਰਮ ਕਿਰਿਆ ॥
ਸਗਲ ਤਿਆਗਿ ਬਨ ਮਧੇ ਫਿਰਿਆ ॥
ਅਨਿਕ ਪ੍ਰਕਾਰ ਕੀਏ ਬਹੁ ਜਤਨਾ ॥
ਪੁੰਨ ਦਾਨ ਹੋਮੇ ਬਹੁ ਰਤਨਾ ॥
ਸਰੀਰੁ ਕਟਾਇ ਹੋਮੈ ਕਰਿ ਰਾਤੀ ॥
ਵਰਤ ਨੇਮ ਕਰੈ ਬਹੁ ਭਾਤੀ ॥
ਨਹੀ ਤੁਲਿ ਰਾਮ ਨਾਮ ਬੀਚਾਰ ॥
ਨਾਨਕ ਗੁਰਮੁਖਿ ਨਾਮੁ ਜਪੀਐ ਇਕ ਬਾਰ ॥੧॥

ਨਉ ਖੰਡ ਪ੍ਰਿਥਮੀ ਫਿਰੈ ਚਿਰੁ ਜੀਵੈ ॥
ਮਹਾ ਉਦਾਸੁ ਤਪੀਸਰੁ ਥੀਵੈ ॥
ਅਗਨਿ ਮਾਹਿ ਹੋਮਤ ਪਰਾਨ ॥
ਕਨਿਕ ਅਸ੍ਵ ਹੈਵਰ ਭੂਮਿ ਦਾਨ ॥
ਨਿਉਲੀ ਕਰਮ ਕਰੈ ਬਹੁ ਆਸਨ ॥
ਜੈਨ ਮਾਰਗ ਸੰਜਮ ਅਤਿ ਸਾਧਨ ॥
ਨਿਮਖ ਨਿਮਖ ਕਰਿ ਸਰੀਰੁ ਕਟਾਵੈ ॥
ਤਉ ਭੀ ਹਉਮੈ ਮੈਲੁ ਨ ਜਾਵੈ ॥
ਹਰਿ ਕੇ ਨਾਮ ਸਮਸਰਿ ਕਛੁ ਨਾਹਿ ॥
ਨਾਨਕ ਗੁਰਮੁਖਿ ਨਾਮੁ ਜਪਤ ਗਤਿ ਪਾਹਿ ॥੨॥

ਮਨ ਕਾਮਨਾ ਤੀਰਥ ਦੇਹ ਛੁਟੈ ॥
ਗਰਬੁ ਗੁਮਾਨੁ ਨ ਮਨ ਤੇ ਹੁਟੈ ॥
ਸੋਚ ਕਰੈ ਦਿਨਸੁ ਅਰੁ ਰਾਤਿ ॥
ਮਨ ਕੀ ਮੈਲੁ ਨ ਤਨ ਤੇ ਜਾਤਿ ॥
ਇਸੁ ਦੇਹੀ ਕਉ ਬਹੁ ਸਾਧਨਾ ਕਰੈ ॥
ਮਨ ਤੇ ਕਬਹੂ ਨ ਬਿਖਿਆ ਟਰੈ ॥
ਜਲਿ ਧੋਵੈ ਬਹੁ ਦੇਹ ਅਨੀਤਿ ॥
ਸੁਧ ਕਹਾ ਹੋਇ ਕਾਚੀ ਭੀਤਿ ॥
ਮਨ ਹਰਿ ਕੇ ਨਾਮ ਕੀ ਮਹਿਮਾ ਊਚ ॥
ਨਾਨਕ ਨਾਮਿ ਉਧਰੇ ਪਤਿਤ ਬਹੁ ਮੂਚ ॥੩॥

ਬਹੁਤੁ ਸਿਆਣਪ ਜਮ ਕਾ ਭਉ ਬਿਆਪੈ ॥
ਅਨਿਕ ਜਤਨ ਕਰਿ ਤ੍ਰਿਸਨ ਨਾ ਧ੍ਰਾਪੈ ॥
ਭੇਖ ਅਨੇਕ ਅਗਨਿ ਨਹੀ ਬੁਝੈ ॥
ਕੋਟਿ ਉਪਾਵ ਦਰਗਹ ਨਹੀ ਸਿਝੈ ॥
ਛੂਟਸਿ ਨਾਹੀ ਊਭ ਪਇਆਲਿ ॥
ਮੋਹਿ ਬਿਆਪਹਿ ਮਾਇਆ ਜਾਲਿ ॥
ਅਵਰ ਕਰਤੂਤਿ ਸਗਲੀ ਜਮੁ ਡਾਨੈ ॥
ਗੋਵਿੰਦ ਭਜਨ ਬਿਨੁ ਤਿਲੁ ਨਹੀ ਮਾਨੈ ॥
ਹਰਿ ਕਾ ਨਾਮੁ ਜਪਤ ਦੁਖੁ ਜਾਇ ॥
ਨਾਨਕ ਬੋਲੈ ਸਹਜਿ ਸੁਭਾਇ ॥੪॥

ਚਾਰਿ ਪਦਾਰਥ ਜੇ ਕੋ ਮਾਗੈ ॥
ਸਾਧ ਜਨਾ ਕੀ ਸੇਵਾ ਲਾਗੈ ॥
ਜੇ ਕੋ ਆਪੁਨਾ ਦੂਖੁ ਮਿਟਾਵੈ ॥
ਹਰਿ ਹਰਿ ਨਾਮੁ ਰਿਦੈ ਸਦ ਗਾਵੈ ॥
ਜੇ ਕੋ ਅਪੁਨੀ ਸੋਭਾ ਲੋਰੈ ॥
ਸਾਧਸੰਗਿ ਇਹ ਹਉਮੈ ਛੋਰੈ ॥
ਜੇ ਕੋ ਜਨਮ ਮਰਣ ਤੇ ਡਰੈ ॥
ਸਾਧ ਜਨਾ ਕੀ ਸਰਨੀ ਪਰੈ ॥
ਜਿਸੁ ਜਨ ਕਉ ਪ੍ਰਭ ਦਰਸ ਪਿਆਸਾ ॥
ਨਾਨਕ ਤਾ ਕੈ ਬਲਿ ਬਲਿ ਜਾਸਾ ॥੫॥

ਸਗਲ ਪੁਰਖ ਮਹਿ ਪੁਰਖੁ ਪ੍ਰਧਾਨੁ ॥
ਸਾਧਸੰਗਿ ਜਾ ਕਾ ਮਿਟੈ ਅਭਿਮਾਨੁ ॥
ਆਪਸ ਕਉ ਜੋ ਜਾਣੈ ਨੀਚਾ ॥
ਸੋਊ ਗਨੀਐ ਸਭ ਤੇ ਊਚਾ ॥
ਜਾ ਕਾ ਮਨੁ ਹੋਇ ਸਗਲ ਕੀ ਰੀਨਾ ॥
ਹਰਿ ਹਰਿ ਨਾਮੁ ਤਿਨਿ ਘਟਿ ਘਟਿ ਚੀਨਾ ॥
ਮਨ ਅਪੁਨੇ ਤੇ ਬੁਰਾ ਮਿਟਾਨਾ ॥
ਪੇਖੈ ਸਗਲ ਸ੍ਰਿਸਟਿ ਸਾਜਨਾ ॥
ਸੂਖ ਦੂਖ ਜਨ ਸਮ ਦ੍ਰਿਸਟੇਤਾ ॥
ਨਾਨਕ ਪਾਪ ਪੁੰਨ ਨਹੀ ਲੇਪਾ ॥੬॥

ਨਿਰਧਨ ਕਉ ਧਨੁ ਤੇਰੋ ਨਾਉ ॥
ਨਿਥਾਵੇ ਕਉ ਨਾਉ ਤੇਰਾ ਥਾਉ ॥
ਨਿਮਾਨੇ ਕਉ ਪ੍ਰਭ ਤੇਰੋ ਮਾਨੁ ॥
ਸਗਲ ਘਟਾ ਕਉ ਦੇਵਹੁ ਦਾਨੁ ॥
ਕਰਨ ਕਰਾਵਨਹਾਰ ਸੁਆਮੀ ॥
ਸਗਲ ਘਟਾ ਕੇ ਅੰਤਰਜਾਮੀ ॥
ਅਪਨੀ ਗਤਿ ਮਿਤਿ ਜਾਨਹੁ ਆਪੇ ॥
ਆਪਨ ਸੰਗਿ ਆਪਿ ਪ੍ਰਭ ਰਾਤੇ ॥
ਤੁਮ੍‍ਰੀ ਉਸਤਤਿ ਤੁਮ ਤੇ ਹੋਇ ॥
ਨਾਨਕ ਅਵਰੁ ਨ ਜਾਨਸਿ ਕੋਇ ॥੭॥

ਸਰਬ ਧਰਮ ਮਹਿ ਸ੍ਰੇਸਟ ਧਰਮੁ ॥
ਹਰਿ ਕੋ ਨਾਮੁ ਜਪਿ ਨਿਰਮਲ ਕਰਮੁ ॥
ਸਗਲ ਕ੍ਰਿਆ ਮਹਿ ਊਤਮ ਕਿਰਿਆ ॥
ਸਾਧਸੰਗਿ ਦੁਰਮਤਿ ਮਲੁ ਹਿਰਿਆ ॥
ਸਗਲ ਉਦਮ ਮਹਿ ਉਦਮੁ ਭਲਾ ॥
ਹਰਿ ਕਾ ਨਾਮੁ ਜਪਹੁ ਜੀਅ ਸਦਾ ॥
ਸਗਲ ਬਾਨੀ ਮਹਿ ਅੰਮ੍ਰਿਤ ਬਾਨੀ ॥
ਹਰਿ ਕੋ ਜਸੁ ਸੁਨਿ ਰਸਨ ਬਖਾਨੀ ॥
ਸਗਲ ਥਾਨ ਤੇ ਓਹੁ ਊਤਮ ਥਾਨੁ ॥
ਨਾਨਕ ਜਿਹ ਘਟਿ ਵਸੈ ਹਰਿ ਨਾਮੁ ॥੮॥੩॥

ਸਲੋਕੁ ॥
ਨਿਰਗੁਨੀਆਰ ਇਆਨਿਆ ਸੋ ਪ੍ਰਭੁ ਸਦਾ ਸਮਾਲਿ ॥
ਜਿਨਿ ਕੀਆ ਤਿਸੁ ਚੀਤਿ ਰਖੁ ਨਾਨਕ ਨਿਬਹੀ ਨਾਲਿ ॥੧॥

ਅਸਟਪਦੀ ॥
ਰਮਈਆ ਕੇ ਗੁਨ ਚੇਤਿ ਪਰਾਨੀ ॥
ਕਵਨ ਮੂਲ ਤੇ ਕਵਨ ਦ੍ਰਿਸਟਾਨੀ ॥
ਜਿਨਿ ਤੂੰ ਸਾਜਿ ਸਵਾਰਿ ਸੀਗਾਰਿਆ ॥
ਗਰਭ ਅਗਨਿ ਮਹਿ ਜਿਨਹਿ ਉਬਾਰਿਆ ॥
ਬਾਰ ਬਿਵਸਥਾ ਤੁਝਹਿ ਪਿਆਰੈ ਦੂਧ ॥
ਭਰਿ ਜੋਬਨ ਭੋਜਨ ਸੁਖ ਸੂਧ ॥
ਬਿਰਧਿ ਭਇਆ ਊਪਰਿ ਸਾਕ ਸੈਨ ॥
ਮੁਖਿ ਅਪਿਆਉ ਬੈਠ ਕਉ ਦੈਨ ॥
ਇਹੁ ਨਿਰਗੁਨੁ ਗੁਨੁ ਕਛੂ ਨ ਬੂਝੈ ॥
ਬਖਸਿ ਲੇਹੁ ਤਉ ਨਾਨਕ ਸੀਝੈ ॥੧॥

ਜਿਹ ਪ੍ਰਸਾਦਿ ਧਰ ਊਪਰਿ ਸੁਖਿ ਬਸਹਿ ॥
ਸੁਤ ਭ੍ਰਾਤ ਮੀਤ ਬਨਿਤਾ ਸੰਗਿ ਹਸਹਿ ॥
ਜਿਹ ਪ੍ਰਸਾਦਿ ਪੀਵਹਿ ਸੀਤਲ ਜਲਾ ॥
ਸੁਖਦਾਈ ਪਵਨੁ ਪਾਵਕੁ ਅਮੁਲਾ ॥
ਜਿਹ ਪ੍ਰਸਾਦਿ ਭੋਗਹਿ ਸਭਿ ਰਸਾ ॥
ਸਗਲ ਸਮਗ੍ਰੀ ਸੰਗਿ ਸਾਥਿ ਬਸਾ ॥
ਦੀਨੇ ਹਸਤ ਪਾਵ ਕਰਨ ਨੇਤ੍ਰ ਰਸਨਾ ॥
ਤਿਸਹਿ ਤਿਆਗਿ ਅਵਰ ਸੰਗਿ ਰਚਨਾ ॥
ਐਸੇ ਦੋਖ ਮੂੜ ਅੰਧ ਬਿਆਪੇ ॥
ਨਾਨਕ ਕਾਢਿ ਲੇਹੁ ਪ੍ਰਭ ਆਪੇ ॥੨॥

ਆਦਿ ਅੰਤਿ ਜੋ ਰਾਖਨਹਾਰੁ ॥
ਤਿਸ ਸਿਉ ਪ੍ਰੀਤਿ ਨ ਕਰੈ ਗਵਾਰੁ ॥
ਜਾ ਕੀ ਸੇਵਾ ਨਵ ਨਿਧਿ ਪਾਵੈ ॥
ਤਾ ਸਿਉ ਮੂੜਾ ਮਨੁ ਨਹੀ ਲਾਵੈ ॥
ਜੋ ਠਾਕੁਰੁ ਸਦ ਸਦਾ ਹਜੂਰੇ ॥
ਤਾ ਕਉ ਅੰਧਾ ਜਾਨਤ ਦੂਰੇ ॥
ਜਾ ਕੀ ਟਹਲ ਪਾਵੈ ਦਰਗਹ ਮਾਨੁ ॥
ਤਿਸਹਿ ਬਿਸਾਰੈ ਮੁਗਧੁ ਅਜਾਨੁ ॥
ਸਦਾ ਸਦਾ ਇਹੁ ਭੂਲਨਹਾਰੁ ॥
ਨਾਨਕ ਰਾਖਨਹਾਰੁ ਅਪਾਰੁ ॥੩॥

ਰਤਨੁ ਤਿਆਗਿ ਕਉਡੀ ਸੰਗਿ ਰਚੈ ॥
ਸਾਚੁ ਛੋਡਿ ਝੂਠ ਸੰਗਿ ਮਚੈ ॥
ਜੋ ਛਡਨਾ ਸੁ ਅਸਥਿਰੁ ਕਰਿ ਮਾਨੈ ॥
ਜੋ ਹੋਵਨੁ ਸੋ ਦੂਰਿ ਪਰਾਨੈ ॥
ਛੋਡਿ ਜਾਇ ਤਿਸ ਕਾ ਸ੍ਰਮੁ ਕਰੈ ॥
ਸੰਗਿ ਸਹਾਈ ਤਿਸੁ ਪਰਹਰੈ ॥
ਚੰਦਨ ਲੇਪੁ ਉਤਾਰੈ ਧੋਇ ॥
ਗਰਧਬ ਪ੍ਰੀਤਿ ਭਸਮ ਸੰਗਿ ਹੋਇ ॥
ਅੰਧ ਕੂਪ ਮਹਿ ਪਤਿਤ ਬਿਕਰਾਲ ॥
ਨਾਨਕ ਕਾਢਿ ਲੇਹੁ ਪ੍ਰਭ ਦਇਆਲ ॥੪॥

ਕਰਤੂਤਿ ਪਸੂ ਕੀ ਮਾਨਸ ਜਾਤਿ ॥
ਲੋਕ ਪਚਾਰਾ ਕਰੈ ਦਿਨੁ ਰਾਤਿ ॥
ਬਾਹਰਿ ਭੇਖ ਅੰਤਰਿ ਮਲੁ ਮਾਇਆ ॥
ਛਪਸਿ ਨਾਹਿ ਕਛੁ ਕਰੈ ਛਪਾਇਆ ॥
ਬਾਹਰਿ ਗਿਆਨ ਧਿਆਨ ਇਸਨਾਨ ॥
ਅੰਤਰਿ ਬਿਆਪੈ ਲੋਭੁ ਸੁਆਨੁ ॥
ਅੰਤਰਿ ਅਗਨਿ ਬਾਹਰਿ ਤਨੁ ਸੁਆਹ ॥
ਗਲਿ ਪਾਥਰ ਕੈਸੇ ਤਰੈ ਅਥਾਹ ॥
ਜਾ ਕੈ ਅੰਤਰਿ ਬਸੈ ਪ੍ਰਭੁ ਆਪਿ ॥
ਨਾਨਕ ਤੇ ਜਨ ਸਹਜਿ ਸਮਾਤਿ ॥੫॥

ਸੁਨਿ ਅੰਧਾ ਕੈਸੇ ਮਾਰਗੁ ਪਾਵੈ ॥
ਕਰੁ ਗਹਿ ਲੇਹੁ ਓੜਿ ਨਿਬਹਾਵੈ ॥
ਕਹਾ ਬੁਝਾਰਤਿ ਬੂਝੈ ਡੋਰਾ ॥
ਨਿਸਿ ਕਹੀਐ ਤਉ ਸਮਝੈ ਭੋਰਾ ॥
ਕਹਾ ਬਿਸਨਪਦ ਗਾਵੈ ਗੁੰਗ ॥
ਜਤਨ ਕਰੈ ਤਉ ਭੀ ਸੁਰ ਭੰਗ ॥
ਕਹ ਪਿੰਗੁਲ ਪਰਬਤ ਪਰ ਭਵਨ ॥
ਨਹੀ ਹੋਤ ਊਹਾ ਉਸੁ ਗਵਨ ॥
ਕਰਤਾਰ ਕਰੁਣਾ ਮੈ ਦੀਨੁ ਬੇਨਤੀ ਕਰੈ ॥
ਨਾਨਕ ਤੁਮਰੀ ਕਿਰਪਾ ਤਰੈ ॥੬॥

ਸੰਗਿ ਸਹਾਈ ਸੁ ਆਵੈ ਨ ਚੀਤਿ ॥
ਜੋ ਬੈਰਾਈ ਤਾ ਸਿਉ ਪ੍ਰੀਤਿ ॥
ਬਲੂਆ ਕੇ ਗ੍ਰਿਹ ਭੀਤਰਿ ਬਸੈ ॥
ਅਨਦ ਕੇਲ ਮਾਇਆ ਰੰਗਿ ਰਸੈ ॥
ਦ੍ਰਿੜੁ ਕਰਿ ਮਾਨੈ ਮਨਹਿ ਪ੍ਰਤੀਤਿ ॥
ਕਾਲੁ ਨ ਆਵੈ ਮੂੜੇ ਚੀਤਿ ॥
ਬੈਰ ਬਿਰੋਧ ਕਾਮ ਕ੍ਰੋਧ ਮੋਹ ॥
ਝੂਠ ਬਿਕਾਰ ਮਹਾ ਲੋਭ ਧ੍ਰੋਹ ॥
ਇਆਹੂ ਜੁਗਤਿ ਬਿਹਾਨੇ ਕਈ ਜਨਮ ॥
ਨਾਨਕ ਰਾਖਿ ਲੇਹੁ ਆਪਨ ਕਰਿ ਕਰਮ ॥੭॥

ਤੂ ਠਾਕੁਰੁ ਤੁਮ ਪਹਿ ਅਰਦਾਸਿ ॥
ਜੀਉ ਪਿੰਡੁ ਸਭੁ ਤੇਰੀ ਰਾਸਿ ॥
ਤੁਮ ਮਾਤ ਪਿਤਾ ਹਮ ਬਾਰਿਕ ਤੇਰੇ ॥
ਤੁਮਰੀ ਕ੍ਰਿਪਾ ਮਹਿ ਸੂਖ ਘਨੇਰੇ ॥
ਕੋਇ ਨ ਜਾਨੈ ਤੁਮਰਾ ਅੰਤੁ ॥
ਊਚੇ ਤੇ ਊਚਾ ਭਗਵੰਤ ॥
ਸਗਲ ਸਮਗ੍ਰੀ ਤੁਮਰੈ ਸੂਤ੍ਰਿ ਧਾਰੀ ॥
ਤੁਮ ਤੇ ਹੋਇ ਸੁ ਆਗਿਆਕਾਰੀ ॥
ਤੁਮਰੀ ਗਤਿ ਮਿਤਿ ਤੁਮ ਹੀ ਜਾਨੀ ॥
ਨਾਨਕ ਦਾਸ ਸਦਾ ਕੁਰਬਾਨੀ ॥੮॥੪॥

ਸਲੋਕੁ ॥
ਦੇਨਹਾਰੁ ਪ੍ਰਭ ਛੋਡਿ ਕੈ ਲਾਗਹਿ ਆਨ ਸੁਆਇ ॥
ਨਾਨਕ ਕਹੂ ਨ ਸੀਝਈ ਬਿਨੁ ਨਾਵੈ ਪਤਿ ਜਾਇ ॥੧॥

ਅਸਟਪਦੀ ॥
ਦਸ ਬਸਤੂ ਲੇ ਪਾਛੈ ਪਾਵੈ ॥
ਏਕ ਬਸਤੁ ਕਾਰਨਿ ਬਿਖੋਟਿ ਗਵਾਵੈ ॥
ਏਕ ਭੀ ਨ ਦੇਇ ਦਸ ਭੀ ਹਿਰਿ ਲੇਇ ॥
ਤਉ ਮੂੜਾ ਕਹੁ ਕਹਾ ਕਰੇਇ ॥
ਜਿਸੁ ਠਾਕੁਰ ਸਿਉ ਨਾਹੀ ਚਾਰਾ ॥
ਤਾ ਕਉ ਕੀਜੈ ਸਦ ਨਮਸਕਾਰਾ ॥
ਜਾ ਕੈ ਮਨਿ ਲਾਗਾ ਪ੍ਰਭੁ ਮੀਠਾ ॥
ਸਰਬ ਸੂਖ ਤਾਹੂ ਮਨਿ ਵੂਠਾ ॥
ਜਿਸੁ ਜਨ ਅਪਨਾ ਹੁਕਮੁ ਮਨਾਇਆ ॥
ਸਰਬ ਥੋਕ ਨਾਨਕ ਤਿਨਿ ਪਾਇਆ ॥੧॥

ਅਗਨਤ ਸਾਹੁ ਅਪਨੀ ਦੇ ਰਾਸਿ ॥
ਖਾਤ ਪੀਤ ਬਰਤੈ ਅਨਦ ਉਲਾਸਿ ॥
ਅਪੁਨੀ ਅਮਾਨ ਕਛੁ ਬਹੁਰਿ ਸਾਹੁ ਲੇਇ ॥
ਅਗਿਆਨੀ ਮਨਿ ਰੋਸੁ ਕਰੇਇ ॥
ਅਪਨੀ ਪਰਤੀਤਿ ਆਪ ਹੀ ਖੋਵੈ ॥
ਬਹੁਰਿ ਉਸ ਕਾ ਬਿਸ੍ਵਾਸੁ ਨ ਹੋਵੈ ॥
ਜਿਸ ਕੀ ਬਸਤੁ ਤਿਸੁ ਆਗੈ ਰਾਖੈ ॥
ਪ੍ਰਭ ਕੀ ਆਗਿਆ ਮਾਨੈ ਮਾਥੈ ॥
ਉਸ ਤੇ ਚਉਗੁਨ ਕਰੈ ਨਿਹਾਲੁ ॥
ਨਾਨਕ ਸਾਹਿਬੁ ਸਦਾ ਦਇਆਲੁ ॥੨॥

ਅਨਿਕ ਭਾਤਿ ਮਾਇਆ ਕੇ ਹੇਤ ॥
ਸਰਪਰ ਹੋਵਤ ਜਾਨੁ ਅਨੇਤ ॥
ਬਿਰਖ ਕੀ ਛਾਇਆ ਸਿਉ ਰੰਗੁ ਲਾਵੈ ॥
ਓਹ ਬਿਨਸੈ ਉਹੁ ਮਨਿ ਪਛੁਤਾਵੈ ॥
ਜੋ ਦੀਸੈ ਸੋ ਚਾਲਨਹਾਰੁ ॥
ਲਪਟਿ ਰਹਿਓ ਤਹ ਅੰਧ ਅੰਧਾਰੁ ॥
ਬਟਾਊ ਸਿਉ ਜੋ ਲਾਵੈ ਨੇਹ ॥
ਤਾ ਕਉ ਹਾਥਿ ਨ ਆਵੈ ਕੇਹ ॥
ਮਨ ਹਰਿ ਕੇ ਨਾਮ ਕੀ ਪ੍ਰੀਤਿ ਸੁਖਦਾਈ ॥
ਕਰਿ ਕਿਰਪਾ ਨਾਨਕ ਆਪਿ ਲਏ ਲਾਈ ॥੩॥

ਮਿਥਿਆ ਤਨੁ ਧਨੁ ਕੁਟੰਬੁ ਸਬਾਇਆ ॥
ਮਿਥਿਆ ਹਉਮੈ ਮਮਤਾ ਮਾਇਆ ॥
ਮਿਥਿਆ ਰਾਜ ਜੋਬਨ ਧਨ ਮਾਲ ॥
ਮਿਥਿਆ ਕਾਮ ਕ੍ਰੋਧ ਬਿਕਰਾਲ ॥
ਮਿਥਿਆ ਰਥ ਹਸਤੀ ਅਸ੍ਵ ਬਸਤ੍ਰਾ ॥
ਮਿਥਿਆ ਰੰਗ ਸੰਗਿ ਮਾਇਆ ਪੇਖਿ ਹਸਤਾ ॥
ਮਿਥਿਆ ਧ੍ਰੋਹ ਮੋਹ ਅਭਿਮਾਨੁ ॥
ਮਿਥਿਆ ਆਪਸ ਊਪਰਿ ਕਰਤ ਗੁਮਾਨੁ ॥
ਅਸਥਿਰੁ ਭਗਤਿ ਸਾਧ ਕੀ ਸਰਨ ॥
ਨਾਨਕ ਜਪਿ ਜਪਿ ਜੀਵੈ ਹਰਿ ਕੇ ਚਰਨ ॥੪॥

ਮਿਥਿਆ ਸ੍ਰਵਨ ਪਰ ਨਿੰਦਾ ਸੁਨਹਿ ॥
ਮਿਥਿਆ ਹਸਤ ਪਰ ਦਰਬ ਕਉ ਹਿਰਹਿ ॥
ਮਿਥਿਆ ਨੇਤ੍ਰ ਪੇਖਤ ਪਰ ਤ੍ਰਿਅ ਰੂਪਾਦ ॥
ਮਿਥਿਆ ਰਸਨਾ ਭੋਜਨ ਅਨ ਸ੍ਵਾਦ ॥
ਮਿਥਿਆ ਚਰਨ ਪਰ ਬਿਕਾਰ ਕਉ ਧਾਵਹਿ ॥
ਮਿਥਿਆ ਮਨ ਪਰ ਲੋਭ ਲੁਭਾਵਹਿ ॥
ਮਿਥਿਆ ਤਨ ਨਹੀ ਪਰਉਪਕਾਰਾ ॥
ਮਿਥਿਆ ਬਾਸੁ ਲੇਤ ਬਿਕਾਰਾ ॥
ਬਿਨੁ ਬੂਝੇ ਮਿਥਿਆ ਸਭ ਭਏ ॥
ਸਫਲ ਦੇਹ ਨਾਨਕ ਹਰਿ ਹਰਿ ਨਾਮ ਲਏ ॥੫॥

ਬਿਰਥੀ ਸਾਕਤ ਕੀ ਆਰਜਾ ॥
ਸਾਚ ਬਿਨਾ ਕਹ ਹੋਵਤ ਸੂਚਾ ॥
ਬਿਰਥਾ ਨਾਮ ਬਿਨਾ ਤਨੁ ਅੰਧ ॥
ਮੁਖਿ ਆਵਤ ਤਾ ਕੈ ਦੁਰਗੰਧ ॥
ਬਿਨੁ ਸਿਮਰਨ ਦਿਨੁ ਰੈਨਿ ਬ੍ਰਿਥਾ ਬਿਹਾਇ ॥
ਮੇਘ ਬਿਨਾ ਜਿਉ ਖੇਤੀ ਜਾਇ ॥
ਗੋਬਿਦ ਭਜਨ ਬਿਨੁ ਬ੍ਰਿਥੇ ਸਭ ਕਾਮ ॥
ਜਿਉ ਕਿਰਪਨ ਕੇ ਨਿਰਾਰਥ ਦਾਮ ॥
ਧੰਨਿ ਧੰਨਿ ਤੇ ਜਨ ਜਿਹ ਘਟਿ ਬਸਿਓ ਹਰਿ ਨਾਉ ॥
ਨਾਨਕ ਤਾ ਕੈ ਬਲਿ ਬਲਿ ਜਾਉ ॥੬॥

ਰਹਤ ਅਵਰ ਕਛੁ ਅਵਰ ਕਮਾਵਤ ॥
ਮਨਿ ਨਹੀ ਪ੍ਰੀਤਿ ਮੁਖਹੁ ਗੰਢ ਲਾਵਤ ॥
ਜਾਨਨਹਾਰ ਪ੍ਰਭੂ ਪਰਬੀਨ ॥
ਬਾਹਰਿ ਭੇਖ ਨ ਕਾਹੂ ਭੀਨ ॥
ਅਵਰ ਉਪਦੇਸੈ ਆਪਿ ਨ ਕਰੈ ॥
ਆਵਤ ਜਾਵਤ ਜਨਮੈ ਮਰੈ ॥
ਜਿਸ ਕੈ ਅੰਤਰਿ ਬਸੈ ਨਿਰੰਕਾਰੁ ॥
ਤਿਸ ਕੀ ਸੀਖ ਤਰੈ ਸੰਸਾਰੁ ॥
ਜੋ ਤੁਮ ਭਾਨੇ ਤਿਨ ਪ੍ਰਭੁ ਜਾਤਾ ॥
ਨਾਨਕ ਉਨ ਜਨ ਚਰਨ ਪਰਾਤਾ ॥੭॥

ਕਰਉ ਬੇਨਤੀ ਪਾਰਬ੍ਰਹਮੁ ਸਭੁ ਜਾਨੈ ॥
ਅਪਨਾ ਕੀਆ ਆਪਹਿ ਮਾਨੈ ॥
ਆਪਹਿ ਆਪ ਆਪਿ ਕਰਤ ਨਿਬੇਰਾ ॥
ਕਿਸੈ ਦੂਰਿ ਜਨਾਵਤ ਕਿਸੈ ਬੁਝਾਵਤ ਨੇਰਾ ॥
ਉਪਾਵ ਸਿਆਨਪ ਸਗਲ ਤੇ ਰਹਤ ॥
ਸਭੁ ਕਛੁ ਜਾਨੈ ਆਤਮ ਕੀ ਰਹਤ ॥
ਜਿਸੁ ਭਾਵੈ ਤਿਸੁ ਲਏ ਲੜਿ ਲਾਇ ॥
ਥਾਨ ਥਨੰਤਰਿ ਰਹਿਆ ਸਮਾਇ ॥
ਸੋ ਸੇਵਕੁ ਜਿਸੁ ਕਿਰਪਾ ਕਰੀ ॥
ਨਿਮਖ ਨਿਮਖ ਜਪਿ ਨਾਨਕ ਹਰੀ ॥੮॥੫॥

ਸਲੋਕੁ ॥
ਕਾਮ ਕ੍ਰੋਧ ਅਰੁ ਲੋਭ ਮੋਹ ਬਿਨਸਿ ਜਾਇ ਅਹੰਮੇਵ ॥
ਨਾਨਕ ਪ੍ਰਭ ਸਰਣਾਗਤੀ ਕਰਿ ਪ੍ਰਸਾਦੁ ਗੁਰਦੇਵ ॥੧॥

ਅਸਟਪਦੀ ॥
ਜਿਹ ਪ੍ਰਸਾਦਿ ਛਤੀਹ ਅੰਮ੍ਰਿਤ ਖਾਹਿ ॥
ਤਿਸੁ ਠਾਕੁਰ ਕਉ ਰਖੁ ਮਨ ਮਾਹਿ ॥
ਜਿਹ ਪ੍ਰਸਾਦਿ ਸੁਗੰਧਤ ਤਨਿ ਲਾਵਹਿ ॥
ਤਿਸ ਕਉ ਸਿਮਰਤ ਪਰਮ ਗਤਿ ਪਾਵਹਿ ॥
ਜਿਹ ਪ੍ਰਸਾਦਿ ਬਸਹਿ ਸੁਖ ਮੰਦਰਿ ॥
ਤਿਸਹਿ ਧਿਆਇ ਸਦਾ ਮਨ ਅੰਦਰਿ ॥
ਜਿਹ ਪ੍ਰਸਾਦਿ ਗ੍ਰਿਹ ਸੰਗਿ ਸੁਖ ਬਸਨਾ ॥
ਆਠ ਪਹਰ ਸਿਮਰਹੁ ਤਿਸੁ ਰਸਨਾ ॥
ਜਿਹ ਪ੍ਰਸਾਦਿ ਰੰਗ ਰਸ ਭੋਗ ॥
ਨਾਨਕ ਸਦਾ ਧਿਆਈਐ ਧਿਆਵਨ ਜੋਗ ॥੧॥

ਜਿਹ ਪ੍ਰਸਾਦਿ ਪਾਟ ਪਟੰਬਰ ਹਢਾਵਹਿ ॥
ਤਿਸਹਿ ਤਿਆਗਿ ਕਤ ਅਵਰ ਲੁਭਾਵਹਿ ॥
ਜਿਹ ਪ੍ਰਸਾਦਿ ਸੁਖਿ ਸੇਜ ਸੋਈਜੈ ॥
ਮਨ ਆਠ ਪਹਰ ਤਾ ਕਾ ਜਸੁ ਗਾਵੀਜੈ ॥
ਜਿਹ ਪ੍ਰਸਾਦਿ ਤੁਝੁ ਸਭੁ ਕੋਊ ਮਾਨੈ ॥
ਮੁਖਿ ਤਾ ਕੋ ਜਸੁ ਰਸਨ ਬਖਾਨੈ ॥
ਜਿਹ ਪ੍ਰਸਾਦਿ ਤੇਰੋ ਰਹਤਾ ਧਰਮੁ ॥
ਮਨ ਸਦਾ ਧਿਆਇ ਕੇਵਲ ਪਾਰਬ੍ਰਹਮੁ ॥
ਪ੍ਰਭ ਜੀ ਜਪਤ ਦਰਗਹ ਮਾਨੁ ਪਾਵਹਿ ॥
ਨਾਨਕ ਪਤਿ ਸੇਤੀ ਘਰਿ ਜਾਵਹਿ ॥੨॥

ਜਿਹ ਪ੍ਰਸਾਦਿ ਆਰੋਗ ਕੰਚਨ ਦੇਹੀ ॥
ਲਿਵ ਲਾਵਹੁ ਤਿਸੁ ਰਾਮ ਸਨੇਹੀ ॥
ਜਿਹ ਪ੍ਰਸਾਦਿ ਤੇਰਾ ਓਲਾ ਰਹਤ ॥
ਮਨ ਸੁਖੁ ਪਾਵਹਿ ਹਰਿ ਹਰਿ ਜਸੁ ਕਹਤ ॥
ਜਿਹ ਪ੍ਰਸਾਦਿ ਤੇਰੇ ਸਗਲ ਛਿਦ੍ਰ ਢਾਕੇ ॥
ਮਨ ਸਰਨੀ ਪਰੁ ਠਾਕੁਰ ਪ੍ਰਭ ਤਾ ਕੈ ॥
ਜਿਹ ਪ੍ਰਸਾਦਿ ਤੁਝੁ ਕੋ ਨ ਪਹੂਚੈ ॥
ਮਨ ਸਾਸਿ ਸਾਸਿ ਸਿਮਰਹੁ ਪ੍ਰਭ ਊਚੇ ॥
ਜਿਹ ਪ੍ਰਸਾਦਿ ਪਾਈ ਦ੍ਰੁਲਭ ਦੇਹ ॥
ਨਾਨਕ ਤਾ ਕੀ ਭਗਤਿ ਕਰੇਹ ॥੩॥

ਜਿਹ ਪ੍ਰਸਾਦਿ ਆਭੂਖਨ ਪਹਿਰੀਜੈ ॥
ਮਨ ਤਿਸੁ ਸਿਮਰਤ ਕਿਉ ਆਲਸੁ ਕੀਜੈ ॥
ਜਿਹ ਪ੍ਰਸਾਦਿ ਅਸ੍ਵ ਹਸਤਿ ਅਸਵਾਰੀ ॥
ਮਨ ਤਿਸੁ ਪ੍ਰਭ ਕਉ ਕਬਹੂ ਨ ਬਿਸਾਰੀ ॥
ਜਿਹ ਪ੍ਰਸਾਦਿ ਬਾਗ ਮਿਲਖ ਧਨਾ ॥
ਰਾਖੁ ਪਰੋਇ ਪ੍ਰਭੁ ਅਪੁਨੇ ਮਨਾ ॥
ਜਿਨਿ ਤੇਰੀ ਮਨ ਬਨਤ ਬਨਾਈ ॥
ਊਠਤ ਬੈਠਤ ਸਦ ਤਿਸਹਿ ਧਿਆਈ ॥
ਤਿਸਹਿ ਧਿਆਇ ਜੋ ਏਕ ਅਲਖੈ ॥
ਈਹਾ ਊਹਾ ਨਾਨਕ ਤੇਰੀ ਰਖੈ ॥੪॥

ਜਿਹ ਪ੍ਰਸਾਦਿ ਕਰਹਿ ਪੁੰਨ ਬਹੁ ਦਾਨ ॥
ਮਨ ਆਠ ਪਹਰ ਕਰਿ ਤਿਸ ਕਾ ਧਿਆਨ ॥
ਜਿਹ ਪ੍ਰਸਾਦਿ ਤੂ ਆਚਾਰ ਬਿਉਹਾਰੀ ॥
ਤਿਸੁ ਪ੍ਰਭ ਕਉ ਸਾਸਿ ਸਾਸਿ ਚਿਤਾਰੀ ॥
ਜਿਹ ਪ੍ਰਸਾਦਿ ਤੇਰਾ ਸੁੰਦਰ ਰੂਪੁ ॥
ਸੋ ਪ੍ਰਭੁ ਸਿਮਰਹੁ ਸਦਾ ਅਨੂਪੁ ॥
ਜਿਹ ਪ੍ਰਸਾਦਿ ਤੇਰੀ ਨੀਕੀ ਜਾਤਿ ॥
ਸੋ ਪ੍ਰਭੁ ਸਿਮਰਿ ਸਦਾ ਦਿਨ ਰਾਤਿ ॥
ਜਿਹ ਪ੍ਰਸਾਦਿ ਤੇਰੀ ਪਤਿ ਰਹੈ ॥
ਗੁਰ ਪ੍ਰਸਾਦਿ ਨਾਨਕ ਜਸੁ ਕਹੈ ॥੫॥

ਜਿਹ ਪ੍ਰਸਾਦਿ ਸੁਨਹਿ ਕਰਨ ਨਾਦ ॥
ਜਿਹ ਪ੍ਰਸਾਦਿ ਪੇਖਹਿ ਬਿਸਮਾਦ ॥
ਜਿਹ ਪ੍ਰਸਾਦਿ ਬੋਲਹਿ ਅੰਮ੍ਰਿਤ ਰਸਨਾ ॥
ਜਿਹ ਪ੍ਰਸਾਦਿ ਸੁਖਿ ਸਹਜੇ ਬਸਨਾ ॥
ਜਿਹ ਪ੍ਰਸਾਦਿ ਹਸਤ ਕਰ ਚਲਹਿ ॥
ਜਿਹ ਪ੍ਰਸਾਦਿ ਸੰਪੂਰਨ ਫਲਹਿ ॥
ਜਿਹ ਪ੍ਰਸਾਦਿ ਪਰਮ ਗਤਿ ਪਾਵਹਿ ॥
ਜਿਹ ਪ੍ਰਸਾਦਿ ਸੁਖਿ ਸਹਜਿ ਸਮਾਵਹਿ ॥
ਐਸਾ ਪ੍ਰਭੁ ਤਿਆਗਿ ਅਵਰ ਕਤ ਲਾਗਹੁ ॥
ਗੁਰ ਪ੍ਰਸਾਦਿ ਨਾਨਕ ਮਨਿ ਜਾਗਹੁ ॥੬॥

ਜਿਹ ਪ੍ਰਸਾਦਿ ਤੂੰ ਪ੍ਰਗਟੁ ਸੰਸਾਰਿ ॥
ਤਿਸੁ ਪ੍ਰਭ ਕਉ ਮੂਲਿ ਨ ਮਨਹੁ ਬਿਸਾਰਿ ॥
ਜਿਹ ਪ੍ਰਸਾਦਿ ਤੇਰਾ ਪਰਤਾਪੁ ॥
ਰੇ ਮਨ ਮੂੜ ਤੂ ਤਾ ਕਉ ਜਾਪੁ ॥
ਜਿਹ ਪ੍ਰਸਾਦਿ ਤੇਰੇ ਕਾਰਜ ਪੂਰੇ ॥
ਤਿਸਹਿ ਜਾਨੁ ਮਨ ਸਦਾ ਹਜੂਰੇ ॥
ਜਿਹ ਪ੍ਰਸਾਦਿ ਤੂੰ ਪਾਵਹਿ ਸਾਚੁ ॥
ਰੇ ਮਨ ਮੇਰੇ ਤੂੰ ਤਾ ਸਿਉ ਰਾਚੁ ॥
ਜਿਹ ਪ੍ਰਸਾਦਿ ਸਭ ਕੀ ਗਤਿ ਹੋਇ ॥
ਨਾਨਕ ਜਾਪੁ ਜਪੈ ਜਪੁ ਸੋਇ ॥੭॥

ਆਪਿ ਜਪਾਏ ਜਪੈ ਸੋ ਨਾਉ ॥
ਆਪਿ ਗਾਵਾਏ ਸੁ ਹਰਿ ਗੁਨ ਗਾਉ ॥
ਪ੍ਰਭ ਕਿਰਪਾ ਤੇ ਹੋਇ ਪ੍ਰਗਾਸੁ ॥
ਪ੍ਰਭੂ ਦਇਆ ਤੇ ਕਮਲ ਬਿਗਾਸੁ ॥
ਪ੍ਰਭ ਸੁਪ੍ਰਸੰਨ ਬਸੈ ਮਨਿ ਸੋਇ ॥
ਪ੍ਰਭ ਦਇਆ ਤੇ ਮਤਿ ਊਤਮ ਹੋਇ ॥
ਸਰਬ ਨਿਧਾਨ ਪ੍ਰਭ ਤੇਰੀ ਮਇਆ ॥
ਆਪਹੁ ਕਛੂ ਨ ਕਿਨਹੂ ਲਇਆ ॥
ਜਿਤੁ ਜਿਤੁ ਲਾਵਹੁ ਤਿਤੁ ਲਗਹਿ ਹਰਿ ਨਾਥ ॥
ਨਾਨਕ ਇਨ ਕੈ ਕਛੂ ਨ ਹਾਥ ॥੮॥੬॥

ਸਲੋਕੁ ॥
ਅਗਮ ਅਗਾਧਿ ਪਾਰਬ੍ਰਹਮੁ ਸੋਇ ॥
ਜੋ ਜੋ ਕਹੈ ਸੁ ਮੁਕਤਾ ਹੋਇ ॥
ਸੁਨਿ ਮੀਤਾ ਨਾਨਕੁ ਬਿਨਵੰਤਾ ॥
ਸਾਧ ਜਨਾ ਕੀ ਅਚਰਜ ਕਥਾ ॥੧॥

ਅਸਟਪਦੀ ॥
ਸਾਧ ਕੈ ਸੰਗਿ ਮੁਖ ਊਜਲ ਹੋਤ ॥
ਸਾਧਸੰਗਿ ਮਲੁ ਸਗਲੀ ਖੋਤ ॥
ਸਾਧ ਕੈ ਸੰਗਿ ਮਿਟੈ ਅਭਿਮਾਨੁ ॥
ਸਾਧ ਕੈ ਸੰਗਿ ਪ੍ਰਗਟੈ ਸੁਗਿਆਨੁ ॥
ਸਾਧ ਕੈ ਸੰਗਿ ਬੁਝੈ ਪ੍ਰਭੁ ਨੇਰਾ ॥
ਸਾਧਸੰਗਿ ਸਭੁ ਹੋਤ ਨਿਬੇਰਾ ॥
ਸਾਧ ਕੈ ਸੰਗਿ ਪਾਏ ਨਾਮ ਰਤਨੁ ॥
ਸਾਧ ਕੈ ਸੰਗਿ ਏਕ ਊਪਰਿ ਜਤਨੁ ॥
ਸਾਧ ਕੀ ਮਹਿਮਾ ਬਰਨੈ ਕਉਨੁ ਪ੍ਰਾਨੀ ॥
ਨਾਨਕ ਸਾਧ ਕੀ ਸੋਭਾ ਪ੍ਰਭ ਮਾਹਿ ਸਮਾਨੀ ॥੧॥

ਸਾਧ ਕੈ ਸੰਗਿ ਅਗੋਚਰੁ ਮਿਲੈ ॥
ਸਾਧ ਕੈ ਸੰਗਿ ਸਦਾ ਪਰਫੁਲੈ ॥
ਸਾਧ ਕੈ ਸੰਗਿ ਆਵਹਿ ਬਸਿ ਪੰਚਾ ॥
ਸਾਧਸੰਗਿ ਅੰਮ੍ਰਿਤ ਰਸੁ ਭੁੰਚਾ ॥
ਸਾਧਸੰਗਿ ਹੋਇ ਸਭ ਕੀ ਰੇਨ ॥
ਸਾਧ ਕੈ ਸੰਗਿ ਮਨੋਹਰ ਬੈਨ ॥
ਸਾਧ ਕੈ ਸੰਗਿ ਨ ਕਤਹੂੰ ਧਾਵੈ ॥
ਸਾਧਸੰਗਿ ਅਸਥਿਤਿ ਮਨੁ ਪਾਵੈ ॥
ਸਾਧ ਕੈ ਸੰਗਿ ਮਾਇਆ ਤੇ ਭਿੰਨ ॥
ਸਾਧਸੰਗਿ ਨਾਨਕ ਪ੍ਰਭ ਸੁਪ੍ਰਸੰਨ ॥੨॥

ਸਾਧਸੰਗਿ ਦੁਸਮਨ ਸਭਿ ਮੀਤ ॥
ਸਾਧੂ ਕੈ ਸੰਗਿ ਮਹਾ ਪੁਨੀਤ ॥
ਸਾਧਸੰਗਿ ਕਿਸ ਸਿਉ ਨਹੀ ਬੈਰੁ ॥
ਸਾਧ ਕੈ ਸੰਗਿ ਨ ਬੀਗਾ ਪੈਰੁ ॥
ਸਾਧ ਕੈ ਸੰਗਿ ਨਾਹੀ ਕੋ ਮੰਦਾ ॥
ਸਾਧਸੰਗਿ ਜਾਨੇ ਪਰਮਾਨੰਦਾ ॥
ਸਾਧ ਕੈ ਸੰਗਿ ਨਾਹੀ ਹਉ ਤਾਪੁ ॥
ਸਾਧ ਕੈ ਸੰਗਿ ਤਜੈ ਸਭੁ ਆਪੁ ॥
ਆਪੇ ਜਾਨੈ ਸਾਧ ਬਡਾਈ ॥
ਨਾਨਕ ਸਾਧ ਪ੍ਰਭੂ ਬਨਿ ਆਈ ॥੩॥

ਸਾਧ ਕੈ ਸੰਗਿ ਨ ਕਬਹੂ ਧਾਵੈ ॥
ਸਾਧ ਕੈ ਸੰਗਿ ਸਦਾ ਸੁਖੁ ਪਾਵੈ ॥
ਸਾਧਸੰਗਿ ਬਸਤੁ ਅਗੋਚਰ ਲਹੈ ॥
ਸਾਧੂ ਕੈ ਸੰਗਿ ਅਜਰੁ ਸਹੈ ॥
ਸਾਧ ਕੈ ਸੰਗਿ ਬਸੈ ਥਾਨਿ ਊਚੈ ॥
ਸਾਧੂ ਕੈ ਸੰਗਿ ਮਹਲਿ ਪਹੂਚੈ ॥
ਸਾਧ ਕੈ ਸੰਗਿ ਦ੍ਰਿੜੈ ਸਭਿ ਧਰਮ ॥
ਸਾਧ ਕੈ ਸੰਗਿ ਕੇਵਲ ਪਾਰਬ੍ਰਹਮ ॥
ਸਾਧ ਕੈ ਸੰਗਿ ਪਾਏ ਨਾਮ ਨਿਧਾਨ ॥
ਨਾਨਕ ਸਾਧੂ ਕੈ ਕੁਰਬਾਨ ॥੪॥

ਸਾਧ ਕੈ ਸੰਗਿ ਸਭ ਕੁਲ ਉਧਾਰੈ ॥
ਸਾਧਸੰਗਿ ਸਾਜਨ ਮੀਤ ਕੁਟੰਬ ਨਿਸਤਾਰੈ ॥
ਸਾਧੂ ਕੈ ਸੰਗਿ ਸੋ ਧਨੁ ਪਾਵੈ ॥
ਜਿਸੁ ਧਨ ਤੇ ਸਭੁ ਕੋ ਵਰਸਾਵੈ ॥
ਸਾਧਸੰਗਿ ਧਰਮ ਰਾਇ ਕਰੇ ਸੇਵਾ ॥
ਸਾਧ ਕੈ ਸੰਗਿ ਸੋਭਾ ਸੁਰਦੇਵਾ ॥
ਸਾਧੂ ਕੈ ਸੰਗਿ ਪਾਪ ਪਲਾਇਨ ॥
ਸਾਧਸੰਗਿ ਅੰਮ੍ਰਿਤ ਗੁਨ ਗਾਇਨ ॥
ਸਾਧ ਕੈ ਸੰਗਿ ਸ੍ਰਬ ਥਾਨ ਗੰਮਿ ॥
ਨਾਨਕ ਸਾਧ ਕੈ ਸੰਗਿ ਸਫਲ ਜਨੰਮ ॥੫॥

ਸਾਧ ਕੈ ਸੰਗਿ ਨਹੀ ਕਛੁ ਘਾਲ ॥
ਦਰਸਨੁ ਭੇਟਤ ਹੋਤ ਨਿਹਾਲ ॥
ਸਾਧ ਕੈ ਸੰਗਿ ਕਲੂਖਤ ਹਰੈ ॥
ਸਾਧ ਕੈ ਸੰਗਿ ਨਰਕ ਪਰਹਰੈ ॥
ਸਾਧ ਕੈ ਸੰਗਿ ਈਹਾ ਊਹਾ ਸੁਹੇਲਾ ॥
ਸਾਧਸੰਗਿ ਬਿਛੁਰਤ ਹਰਿ ਮੇਲਾ ॥
ਜੋ ਇਛੈ ਸੋਈ ਫਲੁ ਪਾਵੈ ॥
ਸਾਧ ਕੈ ਸੰਗਿ ਨ ਬਿਰਥਾ ਜਾਵੈ ॥
ਪਾਰਬ੍ਰਹਮੁ ਸਾਧ ਰਿਦ ਬਸੈ ॥
ਨਾਨਕ ਉਧਰੈ ਸਾਧ ਸੁਨਿ ਰਸੈ ॥੬॥

ਸਾਧ ਕੈ ਸੰਗਿ ਸੁਨਉ ਹਰਿ ਨਾਉ ॥
ਸਾਧਸੰਗਿ ਹਰਿ ਕੇ ਗੁਨ ਗਾਉ ॥
ਸਾਧ ਕੈ ਸੰਗਿ ਨ ਮਨ ਤੇ ਬਿਸਰੈ ॥
ਸਾਧਸੰਗਿ ਸਰਪਰ ਨਿਸਤਰੈ ॥
ਸਾਧ ਕੈ ਸੰਗਿ ਲਗੈ ਪ੍ਰਭੁ ਮੀਠਾ ॥
ਸਾਧੂ ਕੈ ਸੰਗਿ ਘਟਿ ਘਟਿ ਡੀਠਾ ॥
ਸਾਧਸੰਗਿ ਭਏ ਆਗਿਆਕਾਰੀ ॥
ਸਾਧਸੰਗਿ ਗਤਿ ਭਈ ਹਮਾਰੀ ॥
ਸਾਧ ਕੈ ਸੰਗਿ ਮਿਟੇ ਸਭਿ ਰੋਗ ॥
ਨਾਨਕ ਸਾਧ ਭੇਟੇ ਸੰਜੋਗ ॥੭॥

ਸਾਧ ਕੀ ਮਹਿਮਾ ਬੇਦ ਨ ਜਾਨਹਿ ॥
ਜੇਤਾ ਸੁਨਹਿ ਤੇਤਾ ਬਖਿਆਨਹਿ ॥
ਸਾਧ ਕੀ ਉਪਮਾ ਤਿਹੁ ਗੁਣ ਤੇ ਦੂਰਿ ॥
ਸਾਧ ਕੀ ਉਪਮਾ ਰਹੀ ਭਰਪੂਰਿ ॥
ਸਾਧ ਕੀ ਸੋਭਾ ਕਾ ਨਾਹੀ ਅੰਤ ॥
ਸਾਧ ਕੀ ਸੋਭਾ ਸਦਾ ਬੇਅੰਤ ॥
ਸਾਧ ਕੀ ਸੋਭਾ ਊਚ ਤੇ ਊਚੀ ॥
ਸਾਧ ਕੀ ਸੋਭਾ ਮੂਚ ਤੇ ਮੂਚੀ ॥
ਸਾਧ ਕੀ ਸੋਭਾ ਸਾਧ ਬਨਿ ਆਈ ॥
ਨਾਨਕ ਸਾਧ ਪ੍ਰਭ ਭੇਦੁ ਨ ਭਾਈ ॥੮॥੭॥

ਸਲੋਕੁ ॥
ਮਨਿ ਸਾਚਾ ਮੁਖਿ ਸਾਚਾ ਸੋਇ ॥
ਅਵਰੁ ਨ ਪੇਖੈ ਏਕਸੁ ਬਿਨੁ ਕੋਇ ॥
ਨਾਨਕ ਇਹ ਲਛਣ ਬ੍ਰਹਮ ਗਿਆਨੀ ਹੋਇ ॥੧॥

ਅਸਟਪਦੀ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਸਦਾ ਨਿਰਲੇਪ ॥
ਜੈਸੇ ਜਲ ਮਹਿ ਕਮਲ ਅਲੇਪ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਸਦਾ ਨਿਰਦੋਖ ॥
ਜੈਸੇ ਸੂਰੁ ਸਰਬ ਕਉ ਸੋਖ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕੈ ਦ੍ਰਿਸਟਿ ਸਮਾਨਿ ॥
ਜੈਸੇ ਰਾਜ ਰੰਕ ਕਉ ਲਾਗੈ ਤੁਲਿ ਪਵਾਨ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕੈ ਧੀਰਜੁ ਏਕ ॥
ਜਿਉ ਬਸੁਧਾ ਕੋਊ ਖੋਦੈ ਕੋਊ ਚੰਦਨ ਲੇਪ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕਾ ਇਹੈ ਗੁਨਾਉ ॥
ਨਾਨਕ ਜਿਉ ਪਾਵਕ ਕਾ ਸਹਜ ਸੁਭਾਉ ॥੧॥

ਬ੍ਰਹਮ ਗਿਆਨੀ ਨਿਰਮਲ ਤੇ ਨਿਰਮਲਾ ॥
ਜੈਸੇ ਮੈਲੁ ਨ ਲਾਗੈ ਜਲਾ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕੈ ਮਨਿ ਹੋਇ ਪ੍ਰਗਾਸੁ ॥
ਜੈਸੇ ਧਰ ਊਪਰਿ ਆਕਾਸੁ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕੈ ਮਿਤ੍ਰ ਸਤ੍ਰੁ ਸਮਾਨਿ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕੈ ਨਾਹੀ ਅਭਿਮਾਨ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਊਚ ਤੇ ਊਚਾ ॥
ਮਨਿ ਅਪਨੈ ਹੈ ਸਭ ਤੇ ਨੀਚਾ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਸੇ ਜਨ ਭਏ ॥
ਨਾਨਕ ਜਿਨ ਪ੍ਰਭੁ ਆਪਿ ਕਰੇਇ ॥੨॥

ਬ੍ਰਹਮ ਗਿਆਨੀ ਸਗਲ ਕੀ ਰੀਨਾ ॥
ਆਤਮ ਰਸੁ ਬ੍ਰਹਮ ਗਿਆਨੀ ਚੀਨਾ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕੀ ਸਭ ਊਪਰਿ ਮਇਆ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਤੇ ਕਛੁ ਬੁਰਾ ਨ ਭਇਆ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਸਦਾ ਸਮਦਰਸੀ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕੀ ਦ੍ਰਿਸਟਿ ਅੰਮ੍ਰਿਤੁ ਬਰਸੀ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਬੰਧਨ ਤੇ ਮੁਕਤਾ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕੀ ਨਿਰਮਲ ਜੁਗਤਾ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕਾ ਭੋਜਨੁ ਗਿਆਨ ॥
ਨਾਨਕ ਬ੍ਰਹਮ ਗਿਆਨੀ ਕਾ ਬ੍ਰਹਮ ਧਿਆਨੁ ॥੩॥

ਬ੍ਰਹਮ ਗਿਆਨੀ ਏਕ ਊਪਰਿ ਆਸ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕਾ ਨਹੀ ਬਿਨਾਸ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕੈ ਗਰੀਬੀ ਸਮਾਹਾ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਪਰਉਪਕਾਰ ਉਮਾਹਾ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕੈ ਨਾਹੀ ਧੰਧਾ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਲੇ ਧਾਵਤੁ ਬੰਧਾ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕੈ ਹੋਇ ਸੁ ਭਲਾ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਸੁਫਲ ਫਲਾ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਸੰਗਿ ਸਗਲ ਉਧਾਰੁ ॥
ਨਾਨਕ ਬ੍ਰਹਮ ਗਿਆਨੀ ਜਪੈ ਸਗਲ ਸੰਸਾਰੁ ॥੪॥

ਬ੍ਰਹਮ ਗਿਆਨੀ ਕੈ ਏਕੈ ਰੰਗ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕੈ ਬਸੈ ਪ੍ਰਭੁ ਸੰਗ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕੈ ਨਾਮੁ ਆਧਾਰੁ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕੈ ਨਾਮੁ ਪਰਵਾਰੁ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਸਦਾ ਸਦ ਜਾਗਤ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਅਹੰਬੁਧਿ ਤਿਆਗਤ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕੈ ਮਨਿ ਪਰਮਾਨੰਦ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕੈ ਘਰਿ ਸਦਾ ਅਨੰਦ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਸੁਖ ਸਹਜ ਨਿਵਾਸ ॥
ਨਾਨਕ ਬ੍ਰਹਮ ਗਿਆਨੀ ਕਾ ਨਹੀ ਬਿਨਾਸ ॥੫॥

ਬ੍ਰਹਮ ਗਿਆਨੀ ਬ੍ਰਹਮ ਕਾ ਬੇਤਾ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਏਕ ਸੰਗਿ ਹੇਤਾ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕੈ ਹੋਇ ਅਚਿੰਤ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕਾ ਨਿਰਮਲ ਮੰਤ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਜਿਸੁ ਕਰੈ ਪ੍ਰਭੁ ਆਪਿ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕਾ ਬਡ ਪਰਤਾਪ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕਾ ਦਰਸੁ ਬਡਭਾਗੀ ਪਾਈਐ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕਉ ਬਲਿ ਬਲਿ ਜਾਈਐ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕਉ ਖੋਜਹਿ ਮਹੇਸੁਰ ॥
ਨਾਨਕ ਬ੍ਰਹਮ ਗਿਆਨੀ ਆਪਿ ਪਰਮੇਸੁਰ ॥੬॥

ਬ੍ਰਹਮ ਗਿਆਨੀ ਕੀ ਕੀਮਤਿ ਨਾਹਿ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕੈ ਸਗਲ ਮਨ ਮਾਹਿ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕਾ ਕਉਨ ਜਾਨੈ ਭੇਦੁ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕਉ ਸਦਾ ਅਦੇਸੁ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕਾ ਕਥਿਆ ਨ ਜਾਇ ਅਧਾਖ੍ਹਰੁ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਸਰਬ ਕਾ ਠਾਕੁਰੁ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕੀ ਮਿਤਿ ਕਉਨੁ ਬਖਾਨੈ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕੀ ਗਤਿ ਬ੍ਰਹਮ ਗਿਆਨੀ ਜਾਨੈ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕਾ ਅੰਤੁ ਨ ਪਾਰੁ ॥
ਨਾਨਕ ਬ੍ਰਹਮ ਗਿਆਨੀ ਕਉ ਸਦਾ ਨਮਸਕਾਰੁ ॥੭॥

ਬ੍ਰਹਮ ਗਿਆਨੀ ਸਭ ਸ੍ਰਿਸਟਿ ਕਾ ਕਰਤਾ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਸਦ ਜੀਵੈ ਨਹੀ ਮਰਤਾ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਮੁਕਤਿ ਜੁਗਤਿ ਜੀਅ ਕਾ ਦਾਤਾ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਪੂਰਨ ਪੁਰਖੁ ਬਿਧਾਤਾ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਅਨਾਥ ਕਾ ਨਾਥੁ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕਾ ਸਭ ਊਪਰਿ ਹਾਥੁ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕਾ ਸਗਲ ਅਕਾਰੁ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਆਪਿ ਨਿਰੰਕਾਰੁ ॥
ਬ੍ਰਹਮ ਗਿਆਨੀ ਕੀ ਸੋਭਾ ਬ੍ਰਹਮ ਗਿਆਨੀ ਬਨੀ ॥
ਨਾਨਕ ਬ੍ਰਹਮ ਗਿਆਨੀ ਸਰਬ ਕਾ ਧਨੀ ॥੮॥੮॥

ਸਲੋਕੁ ॥
ਉਰਿ ਧਾਰੈ ਜੋ ਅੰਤਰਿ ਨਾਮੁ ॥
ਸਰਬ ਮੈ ਪੇਖੈ ਭਗਵਾਨੁ ॥
ਨਿਮਖ ਨਿਮਖ ਠਾਕੁਰ ਨਮਸਕਾਰੈ ॥
ਨਾਨਕ ਓਹੁ ਅਪਰਸੁ ਸਗਲ ਨਿਸਤਾਰੈ ॥੧॥

ਅਸਟਪਦੀ ॥
ਮਿਥਿਆ ਨਾਹੀ ਰਸਨਾ ਪਰਸ ॥
ਮਨ ਮਹਿ ਪ੍ਰੀਤਿ ਨਿਰੰਜਨ ਦਰਸ ॥
ਪਰ ਤ੍ਰਿਅ ਰੂਪੁ ਨ ਪੇਖੈ ਨੇਤ੍ਰ ॥
ਸਾਧ ਕੀ ਟਹਲ ਸੰਤਸੰਗਿ ਹੇਤ ॥
ਕਰਨ ਨ ਸੁਨੈ ਕਾਹੂ ਕੀ ਨਿੰਦਾ ॥
ਸਭ ਤੇ ਜਾਨੈ ਆਪਸ ਕਉ ਮੰਦਾ ॥
ਗੁਰ ਪ੍ਰਸਾਦਿ ਬਿਖਿਆ ਪਰਹਰੈ ॥
ਮਨ ਕੀ ਬਾਸਨਾ ਮਨ ਤੇ ਟਰੈ ॥
ਇੰਦ੍ਰੀ ਜਿਤ ਪੰਚ ਦੋਖ ਤੇ ਰਹਤ ॥
ਨਾਨਕ ਕੋਟਿ ਮਧੇ ਕੋ ਐਸਾ ਅਪਰਸ ॥੧॥

ਬੈਸਨੋ ਸੋ ਜਿਸੁ ਊਪਰਿ ਸੁਪ੍ਰਸੰਨ ॥
ਬਿਸਨ ਕੀ ਮਾਇਆ ਤੇ ਹੋਇ ਭਿੰਨ ॥
ਕਰਮ ਕਰਤ ਹੋਵੈ ਨਿਹਕਰਮ ॥
ਤਿਸੁ ਬੈਸਨੋ ਕਾ ਨਿਰਮਲ ਧਰਮ ॥
ਕਾਹੂ ਫਲ ਕੀ ਇਛਾ ਨਹੀ ਬਾਛੈ ॥
ਕੇਵਲ ਭਗਤਿ ਕੀਰਤਨ ਸੰਗਿ ਰਾਚੈ ॥
ਮਨ ਤਨ ਅੰਤਰਿ ਸਿਮਰਨ ਗੋਪਾਲ ॥
ਸਭ ਊਪਰਿ ਹੋਵਤ ਕਿਰਪਾਲ ॥
ਆਪਿ ਦ੍ਰਿੜੈ ਅਵਰਹ ਨਾਮੁ ਜਪਾਵੈ ॥
ਨਾਨਕ ਓਹੁ ਬੈਸਨੋ ਪਰਮ ਗਤਿ ਪਾਵੈ ॥੨॥

ਭਗਉਤੀ ਭਗਵੰਤ ਭਗਤਿ ਕਾ ਰੰਗੁ ॥
ਸਗਲ ਤਿਆਗੈ ਦੁਸਟ ਕਾ ਸੰਗੁ ॥
ਮਨ ਤੇ ਬਿਨਸੈ ਸਗਲਾ ਭਰਮੁ ॥
ਕਰਿ ਪੂਜੈ ਸਗਲ ਪਾਰਬ੍ਰਹਮੁ ॥
ਸਾਧਸੰਗਿ ਪਾਪਾ ਮਲੁ ਖੋਵੈ ॥
ਤਿਸੁ ਭਗਉਤੀ ਕੀ ਮਤਿ ਊਤਮ ਹੋਵੈ ॥
ਭਗਵੰਤ ਕੀ ਟਹਲ ਕਰੈ ਨਿਤ ਨੀਤਿ ॥
ਮਨੁ ਤਨੁ ਅਰਪੈ ਬਿਸਨ ਪਰੀਤਿ ॥
ਹਰਿ ਕੇ ਚਰਨ ਹਿਰਦੈ ਬਸਾਵੈ ॥
ਨਾਨਕ ਐਸਾ ਭਗਉਤੀ ਭਗਵੰਤ ਕਉ ਪਾਵੈ ॥੩॥

ਸੋ ਪੰਡਿਤੁ ਜੋ ਮਨੁ ਪਰਬੋਧੈ ॥
ਰਾਮ ਨਾਮੁ ਆਤਮ ਮਹਿ ਸੋਧੈ ॥
ਰਾਮ ਨਾਮ ਸਾਰੁ ਰਸੁ ਪੀਵੈ ॥
ਉਸੁ ਪੰਡਿਤ ਕੈ ਉਪਦੇਸਿ ਜਗੁ ਜੀਵੈ ॥
ਹਰਿ ਕੀ ਕਥਾ ਹਿਰਦੈ ਬਸਾਵੈ ॥
ਸੋ ਪੰਡਿਤੁ ਫਿਰਿ ਜੋਨਿ ਨ ਆਵੈ ॥
ਬੇਦ ਪੁਰਾਨ ਸਿਮ੍ਰਿਤਿ ਬੂਝੈ ਮੂਲ ॥
ਸੂਖਮ ਮਹਿ ਜਾਨੈ ਅਸਥੂਲੁ ॥
ਚਹੁ ਵਰਨਾ ਕਉ ਦੇ ਉਪਦੇਸੁ ॥
ਨਾਨਕ ਉਸੁ ਪੰਡਿਤ ਕਉ ਸਦਾ ਅਦੇਸੁ ॥੪॥

ਬੀਜ ਮੰਤ੍ਰੁ ਸਰਬ ਕੋ ਗਿਆਨੁ ॥
ਚਹੁ ਵਰਨਾ ਮਹਿ ਜਪੈ ਕੋਊ ਨਾਮੁ ॥
ਜੋ ਜੋ ਜਪੈ ਤਿਸ ਕੀ ਗਤਿ ਹੋਇ ॥
ਸਾਧਸੰਗਿ ਪਾਵੈ ਜਨੁ ਕੋਇ ॥
ਕਰਿ ਕਿਰਪਾ ਅੰਤਰਿ ਉਰ ਧਾਰੈ ॥
ਪਸੁ ਪ੍ਰੇਤ ਮੁਘਦ ਪਾਥਰ ਕਉ ਤਾਰੈ ॥
ਸਰਬ ਰੋਗ ਕਾ ਅਉਖਦੁ ਨਾਮੁ ॥
ਕਲਿਆਣ ਰੂਪ ਮੰਗਲ ਗੁਣ ਗਾਮ ॥
ਕਾਹੂ ਜੁਗਤਿ ਕਿਤੈ ਨ ਪਾਈਐ ਧਰਮਿ ॥
ਨਾਨਕ ਤਿਸੁ ਮਿਲੈ ਜਿਸੁ ਲਿਖਿਆ ਧੁਰਿ ਕਰਮਿ ॥੫॥

ਜਿਸ ਕੈ ਮਨਿ ਪਾਰਬ੍ਰਹਮ ਕਾ ਨਿਵਾਸੁ ॥
ਤਿਸ ਕਾ ਨਾਮੁ ਸਤਿ ਰਾਮਦਾਸੁ ॥
ਆਤਮ ਰਾਮੁ ਤਿਸੁ ਨਦਰੀ ਆਇਆ ॥
ਦਾਸ ਦਸੰਤਣ ਭਾਇ ਤਿਨਿ ਪਾਇਆ ॥
ਸਦਾ ਨਿਕਟਿ ਨਿਕਟਿ ਹਰਿ ਜਾਨੁ ॥
ਸੋ ਦਾਸੁ ਦਰਗਹ ਪਰਵਾਨੁ ॥
ਅਪੁਨੇ ਦਾਸ ਕਉ ਆਪਿ ਕਿਰਪਾ ਕਰੈ ॥
ਤਿਸੁ ਦਾਸ ਕਉ ਸਭ ਸੋਝੀ ਪਰੈ ॥
ਸਗਲ ਸੰਗਿ ਆਤਮ ਉਦਾਸੁ ॥
ਐਸੀ ਜੁਗਤਿ ਨਾਨਕ ਰਾਮਦਾਸੁ ॥੬॥

ਪ੍ਰਭ ਕੀ ਆਗਿਆ ਆਤਮ ਹਿਤਾਵੈ ॥
ਜੀਵਨ ਮੁਕਤਿ ਸੋਊ ਕਹਾਵੈ ॥
ਤੈਸਾ ਹਰਖੁ ਤੈਸਾ ਉਸੁ ਸੋਗੁ ॥
ਸਦਾ ਅਨੰਦੁ ਤਹ ਨਹੀ ਬਿਓਗੁ ॥
ਤੈਸਾ ਸੁਵਰਨੁ ਤੈਸੀ ਉਸੁ ਮਾਟੀ ॥
ਤੈਸਾ ਅੰਮ੍ਰਿਤੁ ਤੈਸੀ ਬਿਖੁ ਖਾਟੀ ॥
ਤੈਸਾ ਮਾਨੁ ਤੈਸਾ ਅਭਿਮਾਨੁ ॥
ਤੈਸਾ ਰੰਕੁ ਤੈਸਾ ਰਾਜਾਨੁ ॥
ਜੋ ਵਰਤਾਏ ਸਾਈ ਜੁਗਤਿ ॥
ਨਾਨਕ ਓਹੁ ਪੁਰਖੁ ਕਹੀਐ ਜੀਵਨ ਮੁਕਤਿ ॥੭॥

ਪਾਰਬ੍ਰਹਮ ਕੇ ਸਗਲੇ ਠਾਉ ॥
ਜਿਤੁ ਜਿਤੁ ਘਰਿ ਰਾਖੈ ਤੈਸਾ ਤਿਨ ਨਾਉ ॥
ਆਪੇ ਕਰਨ ਕਰਾਵਨ ਜੋਗੁ ॥
ਪ੍ਰਭ ਭਾਵੈ ਸੋਈ ਫੁਨਿ ਹੋਗੁ ॥
ਪਸਰਿਓ ਆਪਿ ਹੋਇ ਅਨਤ ਤਰੰਗ ॥
ਲਖੇ ਨ ਜਾਹਿ ਪਾਰਬ੍ਰਹਮ ਕੇ ਰੰਗ ॥
ਜੈਸੀ ਮਤਿ ਦੇਇ ਤੈਸਾ ਪਰਗਾਸ ॥
ਪਾਰਬ੍ਰਹਮੁ ਕਰਤਾ ਅਬਿਨਾਸ ॥
ਸਦਾ ਸਦਾ ਸਦਾ ਦਇਆਲ ॥
ਸਿਮਰਿ ਸਿਮਰਿ ਨਾਨਕ ਭਏ ਨਿਹਾਲ ॥੮॥੯॥

ਸਲੋਕੁ ॥
ਉਸਤਤਿ ਕਰਹਿ ਅਨੇਕ ਜਨ ਅੰਤੁ ਨ ਪਾਰਾਵਾਰ ॥
ਨਾਨਕ ਰਚਨਾ ਪ੍ਰਭਿ ਰਚੀ ਬਹੁ ਬਿਧਿ ਅਨਿਕ ਪ੍ਰਕਾਰ ॥੧॥

ਅਸਟਪਦੀ ॥
ਕਈ ਕੋਟਿ ਹੋਏ ਪੂਜਾਰੀ ॥
ਕਈ ਕੋਟਿ ਆਚਾਰ ਬਿਉਹਾਰੀ ॥
ਕਈ ਕੋਟਿ ਭਏ ਤੀਰਥ ਵਾਸੀ ॥
ਕਈ ਕੋਟਿ ਬਨ ਭ੍ਰਮਹਿ ਉਦਾਸੀ ॥
ਕਈ ਕੋਟਿ ਬੇਦ ਕੇ ਸ੍ਰੋਤੇ ॥
ਕਈ ਕੋਟਿ ਤਪੀਸੁਰ ਹੋਤੇ ॥
ਕਈ ਕੋਟਿ ਆਤਮ ਧਿਆਨੁ ਧਾਰਹਿ ॥
ਕਈ ਕੋਟਿ ਕਬਿ ਕਾਬਿ ਬੀਚਾਰਹਿ ॥
ਕਈ ਕੋਟਿ ਨਵਤਨ ਨਾਮ ਧਿਆਵਹਿ ॥
ਨਾਨਕ ਕਰਤੇ ਕਾ ਅੰਤੁ ਨ ਪਾਵਹਿ ॥੧॥

ਕਈ ਕੋਟਿ ਭਏ ਅਭਿਮਾਨੀ ॥
ਕਈ ਕੋਟਿ ਅੰਧ ਅਗਿਆਨੀ ॥
ਕਈ ਕੋਟਿ ਕਿਰਪਨ ਕਠੋਰ ॥
ਕਈ ਕੋਟਿ ਅਭਿਗ ਆਤਮ ਨਿਕੋਰ ॥
ਕਈ ਕੋਟਿ ਪਰ ਦਰਬ ਕਉ ਹਿਰਹਿ ॥
ਕਈ ਕੋਟਿ ਪਰ ਦੂਖਨਾ ਕਰਹਿ ॥
ਕਈ ਕੋਟਿ ਮਾਇਆ ਸ੍ਰਮ ਮਾਹਿ ॥
ਕਈ ਕੋਟਿ ਪਰਦੇਸ ਭ੍ਰਮਾਹਿ ॥
ਜਿਤੁ ਜਿਤੁ ਲਾਵਹੁ ਤਿਤੁ ਤਿਤੁ ਲਗਨਾ ॥
ਨਾਨਕ ਕਰਤੇ ਕੀ ਜਾਨੈ ਕਰਤਾ ਰਚਨਾ ॥੨॥

ਕਈ ਕੋਟਿ ਸਿਧ ਜਤੀ ਜੋਗੀ ॥
ਕਈ ਕੋਟਿ ਰਾਜੇ ਰਸ ਭੋਗੀ ॥
ਕਈ ਕੋਟਿ ਪੰਖੀ ਸਰਪ ਉਪਾਏ ॥
ਕਈ ਕੋਟਿ ਪਾਥਰ ਬਿਰਖ ਨਿਪਜਾਏ ॥
ਕਈ ਕੋਟਿ ਪਵਣ ਪਾਣੀ ਬੈਸੰਤਰ ॥
ਕਈ ਕੋਟਿ ਦੇਸ ਭੂ ਮੰਡਲ ॥
ਕਈ ਕੋਟਿ ਸਸੀਅਰ ਸੂਰ ਨਖ੍ਹਤ੍ਰ ॥
ਕਈ ਕੋਟਿ ਦੇਵ ਦਾਨਵ ਇੰਦ੍ਰ ਸਿਰਿ ਛਤ੍ਰ ॥
ਸਗਲ ਸਮਗ੍ਰੀ ਅਪਨੈ ਸੂਤਿ ਧਾਰੈ ॥
ਨਾਨਕ ਜਿਸੁ ਜਿਸੁ ਭਾਵੈ ਤਿਸੁ ਤਿਸੁ ਨਿਸਤਾਰੈ ॥੩॥

ਕਈ ਕੋਟਿ ਰਾਜਸ ਤਾਮਸ ਸਾਤਕ ॥
ਕਈ ਕੋਟਿ ਬੇਦ ਪੁਰਾਨ ਸਿਮ੍ਰਿਤਿ ਅਰੁ ਸਾਸਤ ॥
ਕਈ ਕੋਟਿ ਕੀਏ ਰਤਨ ਸਮੁਦ ॥
ਕਈ ਕੋਟਿ ਨਾਨਾ ਪ੍ਰਕਾਰ ਜੰਤ ॥
ਕਈ ਕੋਟਿ ਕੀਏ ਚਿਰ ਜੀਵੇ ॥
ਕਈ ਕੋਟਿ ਗਿਰੀ ਮੇਰ ਸੁਵਰਨ ਥੀਵੇ ॥
ਕਈ ਕੋਟਿ ਜਖ੍ਹ ਕਿੰਨਰ ਪਿਸਾਚ ॥
ਕਈ ਕੋਟਿ ਭੂਤ ਪ੍ਰੇਤ ਸੂਕਰ ਮ੍ਰਿਗਾਚ ॥
ਸਭ ਤੇ ਨੇਰੈ ਸਭਹੂ ਤੇ ਦੂਰਿ ॥
ਨਾਨਕ ਆਪਿ ਅਲਿਪਤੁ ਰਹਿਆ ਭਰਪੂਰਿ ॥੪॥

ਕਈ ਕੋਟਿ ਪਾਤਾਲ ਕੇ ਵਾਸੀ ॥
ਕਈ ਕੋਟਿ ਨਰਕ ਸੁਰਗ ਨਿਵਾਸੀ ॥
ਕਈ ਕੋਟਿ ਜਨਮਹਿ ਜੀਵਹਿ ਮਰਹਿ ॥
ਕਈ ਕੋਟਿ ਬਹੁ ਜੋਨੀ ਫਿਰਹਿ ॥
ਕਈ ਕੋਟਿ ਬੈਠਤ ਹੀ ਖਾਹਿ ॥
ਕਈ ਕੋਟਿ ਘਾਲਹਿ ਥਕਿ ਪਾਹਿ ॥
ਕਈ ਕੋਟਿ ਕੀਏ ਧਨਵੰਤ ॥
ਕਈ ਕੋਟਿ ਮਾਇਆ ਮਹਿ ਚਿੰਤ ॥
ਜਹ ਜਹ ਭਾਣਾ ਤਹ ਤਹ ਰਾਖੇ ॥
ਨਾਨਕ ਸਭੁ ਕਿਛੁ ਪ੍ਰਭ ਕੈ ਹਾਥੇ ॥੫॥

ਕਈ ਕੋਟਿ ਭਏ ਬੈਰਾਗੀ ॥
ਰਾਮ ਨਾਮ ਸੰਗਿ ਤਿਨਿ ਲਿਵ ਲਾਗੀ ॥
ਕਈ ਕੋਟਿ ਪ੍ਰਭ ਕਉ ਖੋਜੰਤੇ ॥
ਆਤਮ ਮਹਿ ਪਾਰਬ੍ਰਹਮੁ ਲਹੰਤੇ ॥
ਕਈ ਕੋਟਿ ਦਰਸਨ ਪ੍ਰਭ ਪਿਆਸ ॥
ਤਿਨ ਕਉ ਮਿਲਿਓ ਪ੍ਰਭੁ ਅਬਿਨਾਸ ॥
ਕਈ ਕੋਟਿ ਮਾਗਹਿ ਸਤਸੰਗੁ ॥
ਪਾਰਬ੍ਰਹਮ ਤਿਨ ਲਾਗਾ ਰੰਗੁ ॥
ਜਿਨ ਕਉ ਹੋਏ ਆਪਿ ਸੁਪ੍ਰਸੰਨ ॥

ਨਾਨਕ ਤੇ ਜਨ ਸਦਾ ਧਨਿ ਧੰਨਿ ॥੬॥
ਕਈ ਕੋਟਿ ਖਾਣੀ ਅਰੁ ਖੰਡ ॥
ਕਈ ਕੋਟਿ ਅਕਾਸ ਬ੍ਰਹਮੰਡ ॥
ਕਈ ਕੋਟਿ ਹੋਏ ਅਵਤਾਰ ॥
ਕਈ ਜੁਗਤਿ ਕੀਨੋ ਬਿਸਥਾਰ ॥
ਕਈ ਬਾਰ ਪਸਰਿਓ ਪਾਸਾਰ ॥
ਸਦਾ ਸਦਾ ਇਕੁ ਏਕੰਕਾਰ ॥
ਕਈ ਕੋਟਿ ਕੀਨੇ ਬਹੁ ਭਾਤਿ ॥
ਪ੍ਰਭ ਤੇ ਹੋਏ ਪ੍ਰਭ ਮਾਹਿ ਸਮਾਤਿ ॥
ਤਾ ਕਾ ਅੰਤੁ ਨ ਜਾਨੈ ਕੋਇ ॥
ਆਪੇ ਆਪਿ ਨਾਨਕ ਪ੍ਰਭੁ ਸੋਇ ॥੭॥

ਕਈ ਕੋਟਿ ਪਾਰਬ੍ਰਹਮ ਕੇ ਦਾਸ ॥
ਤਿਨ ਹੋਵਤ ਆਤਮ ਪਰਗਾਸ ॥
ਕਈ ਕੋਟਿ ਤਤ ਕੇ ਬੇਤੇ ॥
ਸਦਾ ਨਿਹਾਰਹਿ ਏਕੋ ਨੇਤ੍ਰੇ ॥
ਕਈ ਕੋਟਿ ਨਾਮ ਰਸੁ ਪੀਵਹਿ ॥
ਅਮਰ ਭਏ ਸਦ ਸਦ ਹੀ ਜੀਵਹਿ ॥
ਕਈ ਕੋਟਿ ਨਾਮ ਗੁਨ ਗਾਵਹਿ ॥
ਆਤਮ ਰਸਿ ਸੁਖਿ ਸਹਜਿ ਸਮਾਵਹਿ ॥
ਅਪੁਨੇ ਜਨ ਕਉ ਸਾਸਿ ਸਾਸਿ ਸਮਾਰੇ ॥
ਨਾਨਕ ਓਇ ਪਰਮੇਸੁਰ ਕੇ ਪਿਆਰੇ ॥੮॥੧੦॥

ਸਲੋਕੁ ॥
ਕਰਣ ਕਾਰਣ ਪ੍ਰਭੁ ਏਕੁ ਹੈ ਦੂਸਰ ਨਾਹੀ ਕੋਇ ॥
ਨਾਨਕ ਤਿਸੁ ਬਲਿਹਾਰਣੈ ਜਲਿ ਥਲਿ ਮਹੀਅਲਿ ਸੋਇ ॥੧॥

ਅਸਟਪਦੀ ॥
ਕਰਨ ਕਰਾਵਨ ਕਰਨੈ ਜੋਗੁ ॥
ਜੋ ਤਿਸੁ ਭਾਵੈ ਸੋਈ ਹੋਗੁ ॥
ਖਿਨ ਮਹਿ ਥਾਪਿ ਉਥਾਪਨਹਾਰਾ ॥
ਅੰਤੁ ਨਹੀ ਕਿਛੁ ਪਾਰਾਵਾਰਾ ॥
ਹੁਕਮੇ ਧਾਰਿ ਅਧਰ ਰਹਾਵੈ ॥
ਹੁਕਮੇ ਉਪਜੈ ਹੁਕਮਿ ਸਮਾਵੈ ॥
ਹੁਕਮੇ ਊਚ ਨੀਚ ਬਿਉਹਾਰ ॥
ਹੁਕਮੇ ਅਨਿਕ ਰੰਗ ਪਰਕਾਰ ॥
ਕਰਿ ਕਰਿ ਦੇਖੈ ਅਪਨੀ ਵਡਿਆਈ ॥
ਨਾਨਕ ਸਭ ਮਹਿ ਰਹਿਆ ਸਮਾਈ ॥੧॥

ਪ੍ਰਭ ਭਾਵੈ ਮਾਨੁਖ ਗਤਿ ਪਾਵੈ ॥
ਪ੍ਰਭ ਭਾਵੈ ਤਾ ਪਾਥਰ ਤਰਾਵੈ ॥
ਪ੍ਰਭ ਭਾਵੈ ਬਿਨੁ ਸਾਸ ਤੇ ਰਾਖੈ ॥
ਪ੍ਰਭ ਭਾਵੈ ਤਾ ਹਰਿ ਗੁਣ ਭਾਖੈ ॥
ਪ੍ਰਭ ਭਾਵੈ ਤਾ ਪਤਿਤ ਉਧਾਰੈ ॥
ਆਪਿ ਕਰੈ ਆਪਨ ਬੀਚਾਰੈ ॥
ਦੁਹਾ ਸਿਰਿਆ ਕਾ ਆਪਿ ਸੁਆਮੀ ॥
ਖੇਲੈ ਬਿਗਸੈ ਅੰਤਰਜਾਮੀ ॥
ਜੋ ਭਾਵੈ ਸੋ ਕਾਰ ਕਰਾਵੈ ॥
ਨਾਨਕ ਦ੍ਰਿਸਟੀ ਅਵਰੁ ਨ ਆਵੈ ॥੨॥

ਕਹੁ ਮਾਨੁਖ ਤੇ ਕਿਆ ਹੋਇ ਆਵੈ ॥
ਜੋ ਤਿਸੁ ਭਾਵੈ ਸੋਈ ਕਰਾਵੈ ॥
ਇਸ ਕੈ ਹਾਥਿ ਹੋਇ ਤਾ ਸਭੁ ਕਿਛੁ ਲੇਇ ॥
ਜੋ ਤਿਸੁ ਭਾਵੈ ਸੋਈ ਕਰੇਇ ॥
ਅਨਜਾਨਤ ਬਿਖਿਆ ਮਹਿ ਰਚੈ ॥
ਜੇ ਜਾਨਤ ਆਪਨ ਆਪ ਬਚੈ ॥
ਭਰਮੇ ਭੂਲਾ ਦਹ ਦਿਸਿ ਧਾਵੈ ॥
ਨਿਮਖ ਮਾਹਿ ਚਾਰਿ ਕੁੰਟ ਫਿਰਿ ਆਵੈ ॥
ਕਰਿ ਕਿਰਪਾ ਜਿਸੁ ਅਪਨੀ ਭਗਤਿ ਦੇਇ ॥
ਨਾਨਕ ਤੇ ਜਨ ਨਾਮਿ ਮਿਲੇਇ ॥੩॥

ਖਿਨ ਮਹਿ ਨੀਚ ਕੀਟ ਕਉ ਰਾਜ ॥
ਪਾਰਬ੍ਰਹਮ ਗਰੀਬ ਨਿਵਾਜ ॥
ਜਾ ਕਾ ਦ੍ਰਿਸਟਿ ਕਛੂ ਨ ਆਵੈ ॥
ਤਿਸੁ ਤਤਕਾਲ ਦਹ ਦਿਸ ਪ੍ਰਗਟਾਵੈ ॥
ਜਾ ਕਉ ਅਪੁਨੀ ਕਰੈ ਬਖਸੀਸ ॥
ਤਾ ਕਾ ਲੇਖਾ ਨ ਗਨੈ ਜਗਦੀਸ ॥
ਜੀਉ ਪਿੰਡੁ ਸਭ ਤਿਸ ਕੀ ਰਾਸਿ ॥
ਘਟਿ ਘਟਿ ਪੂਰਨ ਬ੍ਰਹਮ ਪ੍ਰਗਾਸ ॥
ਅਪਨੀ ਬਣਤ ਆਪਿ ਬਨਾਈ ॥
ਨਾਨਕ ਜੀਵੈ ਦੇਖਿ ਬਡਾਈ ॥੪॥

ਇਸ ਕਾ ਬਲੁ ਨਾਹੀ ਇਸੁ ਹਾਥ ॥
ਕਰਨ ਕਰਾਵਨ ਸਰਬ ਕੋ ਨਾਥ ॥
ਆਗਿਆਕਾਰੀ ਬਪੁਰਾ ਜੀਉ ॥
ਜੋ ਤਿਸੁ ਭਾਵੈ ਸੋਈ ਫੁਨਿ ਥੀਉ ॥
ਕਬਹੂ ਊਚ ਨੀਚ ਮਹਿ ਬਸੈ ॥
ਕਬਹੂ ਸੋਗ ਹਰਖ ਰੰਗਿ ਹਸੈ ॥
ਕਬਹੂ ਨਿੰਦ ਚਿੰਦ ਬਿਉਹਾਰ ॥
ਕਬਹੂ ਊਭ ਅਕਾਸ ਪਇਆਲ ॥
ਕਬਹੂ ਬੇਤਾ ਬ੍ਰਹਮ ਬੀਚਾਰ ॥
ਨਾਨਕ ਆਪਿ ਮਿਲਾਵਣਹਾਰ ॥੫॥

ਕਬਹੂ ਨਿਰਤਿ ਕਰੈ ਬਹੁ ਭਾਤਿ ॥
ਕਬਹੂ ਸੋਇ ਰਹੈ ਦਿਨੁ ਰਾਤਿ ॥
ਕਬਹੂ ਮਹਾ ਕ੍ਰੋਧ ਬਿਕਰਾਲ ॥
ਕਬਹੂੰ ਸਰਬ ਕੀ ਹੋਤ ਰਵਾਲ ॥
ਕਬਹੂ ਹੋਇ ਬਹੈ ਬਡ ਰਾਜਾ ॥
ਕਬਹੁ ਭੇਖਾਰੀ ਨੀਚ ਕਾ ਸਾਜਾ ॥
ਕਬਹੂ ਅਪਕੀਰਤਿ ਮਹਿ ਆਵੈ ॥
ਕਬਹੂ ਭਲਾ ਭਲਾ ਕਹਾਵੈ ॥
ਜਿਉ ਪ੍ਰਭੁ ਰਾਖੈ ਤਿਵ ਹੀ ਰਹੈ ॥
ਗੁਰ ਪ੍ਰਸਾਦਿ ਨਾਨਕ ਸਚੁ ਕਹੈ ॥੬॥

ਕਬਹੂ ਹੋਇ ਪੰਡਿਤੁ ਕਰੇ ਬਖ੍ਹਾਨੁ ॥
ਕਬਹੂ ਮੋਨਿਧਾਰੀ ਲਾਵੈ ਧਿਆਨੁ ॥
ਕਬਹੂ ਤਟ ਤੀਰਥ ਇਸਨਾਨ ॥
ਕਬਹੂ ਸਿਧ ਸਾਧਿਕ ਮੁਖਿ ਗਿਆਨ ॥
ਕਬਹੂ ਕੀਟ ਹਸਤਿ ਪਤੰਗ ਹੋਇ ਜੀਆ ॥
ਅਨਿਕ ਜੋਨਿ ਭਰਮੈ ਭਰਮੀਆ ॥
ਨਾਨਾ ਰੂਪ ਜਿਉ ਸ੍ਵਾਗੀ ਦਿਖਾਵੈ ॥
ਜਿਉ ਪ੍ਰਭ ਭਾਵੈ ਤਿਵੈ ਨਚਾਵੈ ॥
ਜੋ ਤਿਸੁ ਭਾਵੈ ਸੋਈ ਹੋਇ ॥
ਨਾਨਕ ਦੂਜਾ ਅਵਰੁ ਨ ਕੋਇ ॥੭॥

ਕਬਹੂ ਸਾਧਸੰਗਤਿ ਇਹੁ ਪਾਵੈ ॥
ਉਸੁ ਅਸਥਾਨ ਤੇ ਬਹੁਰਿ ਨ ਆਵੈ ॥
ਅੰਤਰਿ ਹੋਇ ਗਿਆਨ ਪਰਗਾਸੁ ॥
ਉਸੁ ਅਸਥਾਨ ਕਾ ਨਹੀ ਬਿਨਾਸੁ ॥
ਮਨ ਤਨ ਨਾਮਿ ਰਤੇ ਇਕ ਰੰਗਿ ॥
ਸਦਾ ਬਸਹਿ ਪਾਰਬ੍ਰਹਮ ਕੈ ਸੰਗਿ ॥
ਜਿਉ ਜਲ ਮਹਿ ਜਲੁ ਆਇ ਖਟਾਨਾ ॥
ਤਿਉ ਜੋਤੀ ਸੰਗਿ ਜੋਤਿ ਸਮਾਨਾ ॥
ਮਿਟਿ ਗਏ ਗਵਨ ਪਾਏ ਬਿਸ੍ਰਾਮ ॥
ਨਾਨਕ ਪ੍ਰਭ ਕੈ ਸਦ ਕੁਰਬਾਨ ॥੮॥੧੧॥

ਸਲੋਕੁ ॥
ਸੁਖੀ ਬਸੈ ਮਸਕੀਨੀਆ ਆਪੁ ਨਿਵਾਰਿ ਤਲੇ ॥
ਬਡੇ ਬਡੇ ਅਹੰਕਾਰੀਆ ਨਾਨਕ ਗਰਬਿ ਗਲੇ ॥੧॥

ਅਸਟਪਦੀ ॥
ਜਿਸ ਕੈ ਅੰਤਰਿ ਰਾਜ ਅਭਿਮਾਨੁ ॥
ਸੋ ਨਰਕਪਾਤੀ ਹੋਵਤ ਸੁਆਨੁ ॥
ਜੋ ਜਾਨੈ ਮੈ ਜੋਬਨਵੰਤੁ ॥
ਸੋ ਹੋਵਤ ਬਿਸਟਾ ਕਾ ਜੰਤੁ ॥
ਆਪਸ ਕਉ ਕਰਮਵੰਤੁ ਕਹਾਵੈ ॥
ਜਨਮਿ ਮਰੈ ਬਹੁ ਜੋਨਿ ਭ੍ਰਮਾਵੈ ॥
ਧਨ ਭੂਮਿ ਕਾ ਜੋ ਕਰੈ ਗੁਮਾਨੁ ॥
ਸੋ ਮੂਰਖੁ ਅੰਧਾ ਅਗਿਆਨੁ ॥
ਕਰਿ ਕਿਰਪਾ ਜਿਸ ਕੈ ਹਿਰਦੈ ਗਰੀਬੀ ਬਸਾਵੈ ॥
ਨਾਨਕ ਈਹਾ ਮੁਕਤੁ ਆਗੈ ਸੁਖੁ ਪਾਵੈ ॥੧॥

ਧਨਵੰਤਾ ਹੋਇ ਕਰਿ ਗਰਬਾਵੈ ॥
ਤ੍ਰਿਣ ਸਮਾਨਿ ਕਛੁ ਸੰਗਿ ਨ ਜਾਵੈ ॥
ਬਹੁ ਲਸਕਰ ਮਾਨੁਖ ਊਪਰਿ ਕਰੇ ਆਸ ॥
ਪਲ ਭੀਤਰਿ ਤਾ ਕਾ ਹੋਇ ਬਿਨਾਸ ॥
ਸਭ ਤੇ ਆਪ ਜਾਨੈ ਬਲਵੰਤੁ ॥
ਖਿਨ ਮਹਿ ਹੋਇ ਜਾਇ ਭਸਮੰਤੁ ॥
ਕਿਸੈ ਨ ਬਦੈ ਆਪਿ ਅਹੰਕਾਰੀ ॥
ਧਰਮ ਰਾਇ ਤਿਸੁ ਕਰੇ ਖੁਆਰੀ ॥
ਗੁਰ ਪ੍ਰਸਾਦਿ ਜਾ ਕਾ ਮਿਟੈ ਅਭਿਮਾਨੁ ॥
ਸੋ ਜਨੁ ਨਾਨਕ ਦਰਗਹ ਪਰਵਾਨੁ ॥੨॥

ਕੋਟਿ ਕਰਮ ਕਰੈ ਹਉ ਧਾਰੇ ॥
ਸ੍ਰਮੁ ਪਾਵੈ ਸਗਲੇ ਬਿਰਥਾਰੇ ॥
ਅਨਿਕ ਤਪਸਿਆ ਕਰੇ ਅਹੰਕਾਰ ॥
ਨਰਕ ਸੁਰਗ ਫਿਰਿ ਫਿਰਿ ਅਵਤਾਰ ॥
ਅਨਿਕ ਜਤਨ ਕਰਿ ਆਤਮ ਨਹੀ ਦ੍ਰਵੈ ॥
ਹਰਿ ਦਰਗਹ ਕਹੁ ਕੈਸੇ ਗਵੈ ॥
ਆਪਸ ਕਉ ਜੋ ਭਲਾ ਕਹਾਵੈ ॥
ਤਿਸਹਿ ਭਲਾਈ ਨਿਕਟਿ ਨ ਆਵੈ ॥
ਸਰਬ ਕੀ ਰੇਨ ਜਾ ਕਾ ਮਨੁ ਹੋਇ ॥
ਕਹੁ ਨਾਨਕ ਤਾ ਕੀ ਨਿਰਮਲ ਸੋਇ ॥੩॥

ਜਬ ਲਗੁ ਜਾਨੈ ਮੁਝ ਤੇ ਕਛੁ ਹੋਇ ॥
ਤਬ ਇਸ ਕਉ ਸੁਖੁ ਨਾਹੀ ਕੋਇ ॥
ਜਬ ਇਹ ਜਾਨੈ ਮੈ ਕਿਛੁ ਕਰਤਾ ॥
ਤਬ ਲਗੁ ਗਰਭ ਜੋਨਿ ਮਹਿ ਫਿਰਤਾ ॥
ਜਬ ਧਾਰੈ ਕੋਊ ਬੈਰੀ ਮੀਤੁ ॥
ਤਬ ਲਗੁ ਨਿਹਚਲੁ ਨਾਹੀ ਚੀਤੁ ॥
ਜਬ ਲਗੁ ਮੋਹ ਮਗਨ ਸੰਗਿ ਮਾਇ ॥
ਤਬ ਲਗੁ ਧਰਮ ਰਾਇ ਦੇਇ ਸਜਾਇ ॥
ਪ੍ਰਭ ਕਿਰਪਾ ਤੇ ਬੰਧਨ ਤੂਟੈ ॥
ਗੁਰ ਪ੍ਰਸਾਦਿ ਨਾਨਕ ਹਉ ਛੂਟੈ ॥੪॥

ਸਹਸ ਖਟੇ ਲਖ ਕਉ ਉਠਿ ਧਾਵੈ ॥
ਤ੍ਰਿਪਤਿ ਨ ਆਵੈ ਮਾਇਆ ਪਾਛੈ ਪਾਵੈ ॥
ਅਨਿਕ ਭੋਗ ਬਿਖਿਆ ਕੇ ਕਰੈ ॥
ਨਹ ਤ੍ਰਿਪਤਾਵੈ ਖਪਿ ਖਪਿ ਮਰੈ ॥
ਬਿਨਾ ਸੰਤੋਖ ਨਹੀ ਕੋਊ ਰਾਜੈ ॥
ਸੁਪਨ ਮਨੋਰਥ ਬ੍ਰਿਥੇ ਸਭ ਕਾਜੈ ॥
ਨਾਮ ਰੰਗਿ ਸਰਬ ਸੁਖੁ ਹੋਇ ॥
ਬਡਭਾਗੀ ਕਿਸੈ ਪਰਾਪਤਿ ਹੋਇ ॥
ਕਰਨ ਕਰਾਵਨ ਆਪੇ ਆਪਿ ॥
ਸਦਾ ਸਦਾ ਨਾਨਕ ਹਰਿ ਜਾਪਿ ॥੫॥

ਕਰਨ ਕਰਾਵਨ ਕਰਨੈਹਾਰੁ ॥
ਇਸ ਕੈ ਹਾਥਿ ਕਹਾ ਬੀਚਾਰੁ ॥
ਜੈਸੀ ਦ੍ਰਿਸਟਿ ਕਰੇ ਤੈਸਾ ਹੋਇ ॥
ਆਪੇ ਆਪਿ ਆਪਿ ਪ੍ਰਭੁ ਸੋਇ ॥
ਜੋ ਕਿਛੁ ਕੀਨੋ ਸੁ ਅਪਨੈ ਰੰਗਿ ॥
ਸਭ ਤੇ ਦੂਰਿ ਸਭਹੂ ਕੈ ਸੰਗਿ ॥
ਬੂਝੈ ਦੇਖੈ ਕਰੈ ਬਿਬੇਕ ॥
ਆਪਹਿ ਏਕ ਆਪਹਿ ਅਨੇਕ ॥
ਮਰੈ ਨ ਬਿਨਸੈ ਆਵੈ ਨ ਜਾਇ ॥
ਨਾਨਕ ਸਦ ਹੀ ਰਹਿਆ ਸਮਾਇ ॥੬॥

ਆਪਿ ਉਪਦੇਸੈ ਸਮਝੈ ਆਪਿ ॥
ਆਪੇ ਰਚਿਆ ਸਭ ਕੈ ਸਾਥਿ ॥
ਆਪਿ ਕੀਨੋ ਆਪਨ ਬਿਸਥਾਰੁ ॥
ਸਭੁ ਕਛੁ ਉਸ ਕਾ ਓਹੁ ਕਰਨੈਹਾਰੁ ॥
ਉਸ ਤੇ ਭਿੰਨ ਕਹਹੁ ਕਿਛੁ ਹੋਇ ॥
ਥਾਨ ਥਨੰਤਰਿ ਏਕੈ ਸੋਇ ॥
ਅਪੁਨੇ ਚਲਿਤ ਆਪਿ ਕਰਣੈਹਾਰ ॥
ਕਉਤਕ ਕਰੈ ਰੰਗ ਆਪਾਰ ॥
ਮਨ ਮਹਿ ਆਪਿ ਮਨ ਅਪੁਨੇ ਮਾਹਿ ॥
ਨਾਨਕ ਕੀਮਤਿ ਕਹਨੁ ਨ ਜਾਇ ॥੭॥

ਸਤਿ ਸਤਿ ਸਤਿ ਪ੍ਰਭੁ ਸੁਆਮੀ ॥
ਗੁਰ ਪਰਸਾਦਿ ਕਿਨੈ ਵਖਿਆਨੀ ॥
ਸਚੁ ਸਚੁ ਸਚੁ ਸਭੁ ਕੀਨਾ ॥
ਕੋਟਿ ਮਧੇ ਕਿਨੈ ਬਿਰਲੈ ਚੀਨਾ ॥
ਭਲਾ ਭਲਾ ਭਲਾ ਤੇਰਾ ਰੂਪ ॥
ਅਤਿ ਸੁੰਦਰ ਅਪਾਰ ਅਨੂਪ ॥
ਨਿਰਮਲ ਨਿਰਮਲ ਨਿਰਮਲ ਤੇਰੀ ਬਾਣੀ ॥
ਘਟਿ ਘਟਿ ਸੁਨੀ ਸ੍ਰਵਨ ਬਖ੍ਹਾਣੀ ॥
ਪਵਿਤ੍ਰ ਪਵਿਤ੍ਰ ਪਵਿਤ੍ਰ ਪੁਨੀਤ ॥
ਨਾਮੁ ਜਪੈ ਨਾਨਕ ਮਨਿ ਪ੍ਰੀਤਿ ॥੮॥੧੨॥

ਸਲੋਕੁ ॥
ਸੰਤ ਸਰਨਿ ਜੋ ਜਨੁ ਪਰੈ ਸੋ ਜਨੁ ਉਧਰਨਹਾਰ ॥
ਸੰਤ ਕੀ ਨਿੰਦਾ ਨਾਨਕਾ ਬਹੁਰਿ ਬਹੁਰਿ ਅਵਤਾਰ ॥੧॥

ਅਸਟਪਦੀ ॥
ਸੰਤ ਕੈ ਦੂਖਨਿ ਆਰਜਾ ਘਟੈ ॥
ਸੰਤ ਕੈ ਦੂਖਨਿ ਜਮ ਤੇ ਨਹੀ ਛੁਟੈ ॥
ਸੰਤ ਕੈ ਦੂਖਨਿ ਸੁਖੁ ਸਭੁ ਜਾਇ ॥
ਸੰਤ ਕੈ ਦੂਖਨਿ ਨਰਕ ਮਹਿ ਪਾਇ ॥
ਸੰਤ ਕੈ ਦੂਖਨਿ ਮਤਿ ਹੋਇ ਮਲੀਨ ॥
ਸੰਤ ਕੈ ਦੂਖਨਿ ਸੋਭਾ ਤੇ ਹੀਨ ॥
ਸੰਤ ਕੇ ਹਤੇ ਕਉ ਰਖੈ ਨ ਕੋਇ ॥
ਸੰਤ ਕੈ ਦੂਖਨਿ ਥਾਨ ਭ੍ਰਸਟੁ ਹੋਇ ॥
ਸੰਤ ਕ੍ਰਿਪਾਲ ਕ੍ਰਿਪਾ ਜੇ ਕਰੈ ॥
ਨਾਨਕ ਸੰਤਸੰਗਿ ਨਿੰਦਕੁ ਭੀ ਤਰੈ ॥੧॥

ਸੰਤ ਕੇ ਦੂਖਨ ਤੇ ਮੁਖੁ ਭਵੈ ॥
ਸੰਤਨ ਕੈ ਦੂਖਨਿ ਕਾਗ ਜਿਉ ਲਵੈ ॥
ਸੰਤਨ ਕੈ ਦੂਖਨਿ ਸਰਪ ਜੋਨਿ ਪਾਇ ॥
ਸੰਤ ਕੈ ਦੂਖਨਿ ਤ੍ਰਿਗਦ ਜੋਨਿ ਕਿਰਮਾਇ ॥
ਸੰਤਨ ਕੈ ਦੂਖਨਿ ਤ੍ਰਿਸਨਾ ਮਹਿ ਜਲੈ ॥
ਸੰਤ ਕੈ ਦੂਖਨਿ ਸਭੁ ਕੋ ਛਲੈ ॥
ਸੰਤ ਕੈ ਦੂਖਨਿ ਤੇਜੁ ਸਭੁ ਜਾਇ ॥
ਸੰਤ ਕੈ ਦੂਖਨਿ ਨੀਚੁ ਨੀਚਾਇ ॥
ਸੰਤ ਦੋਖੀ ਕਾ ਥਾਉ ਕੋ ਨਾਹਿ ॥
ਨਾਨਕ ਸੰਤ ਭਾਵੈ ਤਾ ਓਇ ਭੀ ਗਤਿ ਪਾਹਿ ॥੨॥

ਸੰਤ ਕਾ ਨਿੰਦਕੁ ਮਹਾ ਅਤਤਾਈ ॥
ਸੰਤ ਕਾ ਨਿੰਦਕੁ ਖਿਨੁ ਟਿਕਨੁ ਨ ਪਾਈ ॥
ਸੰਤ ਕਾ ਨਿੰਦਕੁ ਮਹਾ ਹਤਿਆਰਾ ॥
ਸੰਤ ਕਾ ਨਿੰਦਕੁ ਪਰਮੇਸੁਰਿ ਮਾਰਾ ॥
ਸੰਤ ਕਾ ਨਿੰਦਕੁ ਰਾਜ ਤੇ ਹੀਨੁ ॥
ਸੰਤ ਕਾ ਨਿੰਦਕੁ ਦੁਖੀਆ ਅਰੁ ਦੀਨੁ ॥
ਸੰਤ ਕੇ ਨਿੰਦਕ ਕਉ ਸਰਬ ਰੋਗ ॥
ਸੰਤ ਕੇ ਨਿੰਦਕ ਕਉ ਸਦਾ ਬਿਜੋਗ ॥
ਸੰਤ ਕੀ ਨਿੰਦਾ ਦੋਖ ਮਹਿ ਦੋਖੁ ॥
ਨਾਨਕ ਸੰਤ ਭਾਵੈ ਤਾ ਉਸ ਕਾ ਭੀ ਹੋਇ ਮੋਖੁ ॥੩॥

ਸੰਤ ਕਾ ਦੋਖੀ ਸਦਾ ਅਪਵਿਤੁ ॥
ਸੰਤ ਕਾ ਦੋਖੀ ਕਿਸੈ ਕਾ ਨਹੀ ਮਿਤੁ ॥
ਸੰਤ ਕੇ ਦੋਖੀ ਕਉ ਡਾਨੁ ਲਾਗੈ ॥
ਸੰਤ ਕੇ ਦੋਖੀ ਕਉ ਸਭ ਤਿਆਗੈ ॥
ਸੰਤ ਕਾ ਦੋਖੀ ਮਹਾ ਅਹੰਕਾਰੀ ॥
ਸੰਤ ਕਾ ਦੋਖੀ ਸਦਾ ਬਿਕਾਰੀ ॥
ਸੰਤ ਕਾ ਦੋਖੀ ਜਨਮੈ ਮਰੈ ॥
ਸੰਤ ਕੀ ਦੂਖਨਾ ਸੁਖ ਤੇ ਟਰੈ ॥
ਸੰਤ ਕੇ ਦੋਖੀ ਕਉ ਨਾਹੀ ਠਾਉ ॥
ਨਾਨਕ ਸੰਤ ਭਾਵੈ ਤਾ ਲਏ ਮਿਲਾਇ ॥੪॥

ਸੰਤ ਕਾ ਦੋਖੀ ਅਧ ਬੀਚ ਤੇ ਟੂਟੈ ॥
ਸੰਤ ਕਾ ਦੋਖੀ ਕਿਤੈ ਕਾਜਿ ਨ ਪਹੂਚੈ ॥
ਸੰਤ ਕੇ ਦੋਖੀ ਕਉ ਉਦਿਆਨ ਭ੍ਰਮਾਈਐ ॥
ਸੰਤ ਕਾ ਦੋਖੀ ਉਝੜਿ ਪਾਈਐ ॥
ਸੰਤ ਕਾ ਦੋਖੀ ਅੰਤਰ ਤੇ ਥੋਥਾ ॥
ਜਿਉ ਸਾਸ ਬਿਨਾ ਮਿਰਤਕ ਕੀ ਲੋਥਾ ॥
ਸੰਤ ਕੇ ਦੋਖੀ ਕੀ ਜੜ ਕਿਛੁ ਨਾਹਿ ॥
ਆਪਨ ਬੀਜਿ ਆਪੇ ਹੀ ਖਾਹਿ ॥
ਸੰਤ ਕੇ ਦੋਖੀ ਕਉ ਅਵਰੁ ਨ ਰਾਖਨਹਾਰੁ ॥
ਨਾਨਕ ਸੰਤ ਭਾਵੈ ਤਾ ਲਏ ਉਬਾਰਿ ॥੫॥

ਸੰਤ ਕਾ ਦੋਖੀ ਇਉ ਬਿਲਲਾਇ ॥
ਜਿਉ ਜਲ ਬਿਹੂਨ ਮਛੁਲੀ ਤੜਫੜਾਇ ॥
ਸੰਤ ਕਾ ਦੋਖੀ ਭੂਖਾ ਨਹੀ ਰਾਜੈ ॥
ਜਿਉ ਪਾਵਕੁ ਈਧਨਿ ਨਹੀ ਧ੍ਰਾਪੈ ॥
ਸੰਤ ਕਾ ਦੋਖੀ ਛੁਟੈ ਇਕੇਲਾ ॥
ਜਿਉ ਬੂਆੜੁ ਤਿਲੁ ਖੇਤ ਮਾਹਿ ਦੁਹੇਲਾ ॥
ਸੰਤ ਕਾ ਦੋਖੀ ਧਰਮ ਤੇ ਰਹਤ ॥
ਸੰਤ ਕਾ ਦੋਖੀ ਸਦ ਮਿਥਿਆ ਕਹਤ ॥
ਕਿਰਤੁ ਨਿੰਦਕ ਕਾ ਧੁਰਿ ਹੀ ਪਇਆ ॥
ਨਾਨਕ ਜੋ ਤਿਸੁ ਭਾਵੈ ਸੋਈ ਥਿਆ ॥੬॥

ਸੰਤ ਕਾ ਦੋਖੀ ਬਿਗੜ ਰੂਪੁ ਹੋਇ ਜਾਇ ॥
ਸੰਤ ਕੇ ਦੋਖੀ ਕਉ ਦਰਗਹ ਮਿਲੈ ਸਜਾਇ ॥
ਸੰਤ ਕਾ ਦੋਖੀ ਸਦਾ ਸਹਕਾਈਐ ॥
ਸੰਤ ਕਾ ਦੋਖੀ ਨ ਮਰੈ ਨ ਜੀਵਾਈਐ ॥
ਸੰਤ ਕੇ ਦੋਖੀ ਕੀ ਪੁਜੈ ਨ ਆਸਾ ॥
ਸੰਤ ਕਾ ਦੋਖੀ ਉਠਿ ਚਲੈ ਨਿਰਾਸਾ ॥
ਸੰਤ ਕੈ ਦੋਖਿ ਨ ਤ੍ਰਿਸਟੈ ਕੋਇ ॥
ਜੈਸਾ ਭਾਵੈ ਤੈਸਾ ਕੋਈ ਹੋਇ ॥
ਪਇਆ ਕਿਰਤੁ ਨ ਮੇਟੈ ਕੋਇ ॥
ਨਾਨਕ ਜਾਨੈ ਸਚਾ ਸੋਇ ॥੭॥

ਸਭ ਘਟ ਤਿਸ ਕੇ ਓਹੁ ਕਰਨੈਹਾਰੁ ॥
ਸਦਾ ਸਦਾ ਤਿਸ ਕਉ ਨਮਸਕਾਰੁ ॥
ਪ੍ਰਭ ਕੀ ਉਸਤਤਿ ਕਰਹੁ ਦਿਨੁ ਰਾਤਿ ॥
ਤਿਸਹਿ ਧਿਆਵਹੁ ਸਾਸਿ ਗਿਰਾਸਿ ॥
ਸਭੁ ਕਛੁ ਵਰਤੈ ਤਿਸ ਕਾ ਕੀਆ ॥
ਜੈਸਾ ਕਰੇ ਤੈਸਾ ਕੋ ਥੀਆ ॥
ਅਪਨਾ ਖੇਲੁ ਆਪਿ ਕਰਨੈਹਾਰੁ ॥
ਦੂਸਰ ਕਉਨੁ ਕਹੈ ਬੀਚਾਰੁ ॥
ਜਿਸ ਨੋ ਕ੍ਰਿਪਾ ਕਰੈ ਤਿਸੁ ਆਪਨ ਨਾਮੁ ਦੇਇ ॥
ਬਡਭਾਗੀ ਨਾਨਕ ਜਨ ਸੇਇ ॥੮॥੧੩॥

ਸਲੋਕੁ ॥
ਤਜਹੁ ਸਿਆਨਪ ਸੁਰਿ ਜਨਹੁ ਸਿਮਰਹੁ ਹਰਿ ਹਰਿ ਰਾਇ ॥
ਏਕ ਆਸ ਹਰਿ ਮਨਿ ਰਖਹੁ ਨਾਨਕ ਦੂਖੁ ਭਰਮੁ ਭਉ ਜਾਇ ॥੧॥

ਅਸਟਪਦੀ ॥
ਮਾਨੁਖ ਕੀ ਟੇਕ ਬ੍ਰਿਥੀ ਸਭ ਜਾਨੁ ॥
ਦੇਵਨ ਕਉ ਏਕੈ ਭਗਵਾਨੁ ॥
ਜਿਸ ਕੈ ਦੀਐ ਰਹੈ ਅਘਾਇ ॥
ਬਹੁਰਿ ਨ ਤ੍ਰਿਸਨਾ ਲਾਗੈ ਆਇ ॥
ਮਾਰੈ ਰਾਖੈ ਏਕੋ ਆਪਿ ॥
ਮਾਨੁਖ ਕੈ ਕਿਛੁ ਨਾਹੀ ਹਾਥਿ ॥
ਤਿਸ ਕਾ ਹੁਕਮੁ ਬੂਝਿ ਸੁਖੁ ਹੋਇ ॥
ਤਿਸ ਕਾ ਨਾਮੁ ਰਖੁ ਕੰਠਿ ਪਰੋਇ ॥
ਸਿਮਰਿ ਸਿਮਰਿ ਸਿਮਰਿ ਪ੍ਰਭੁ ਸੋਇ ॥
ਨਾਨਕ ਬਿਘਨੁ ਨ ਲਾਗੈ ਕੋਇ ॥੧॥

ਉਸਤਤਿ ਮਨ ਮਹਿ ਕਰਿ ਨਿਰੰਕਾਰ ॥
ਕਰਿ ਮਨ ਮੇਰੇ ਸਤਿ ਬਿਉਹਾਰ ॥
ਨਿਰਮਲ ਰਸਨਾ ਅੰਮ੍ਰਿਤੁ ਪੀਉ ॥
ਸਦਾ ਸੁਹੇਲਾ ਕਰਿ ਲੇਹਿ ਜੀਉ ॥
ਨੈਨਹੁ ਪੇਖੁ ਠਾਕੁਰ ਕਾ ਰੰਗੁ ॥
ਸਾਧਸੰਗਿ ਬਿਨਸੈ ਸਭ ਸੰਗੁ ॥
ਚਰਨ ਚਲਉ ਮਾਰਗਿ ਗੋਬਿੰਦ ॥
ਮਿਟਹਿ ਪਾਪ ਜਪੀਐ ਹਰਿ ਬਿੰਦ ॥
ਕਰ ਹਰਿ ਕਰਮ ਸ੍ਰਵਨਿ ਹਰਿ ਕਥਾ ॥
ਹਰਿ ਦਰਗਹ ਨਾਨਕ ਊਜਲ ਮਥਾ ॥੨॥

ਬਡਭਾਗੀ ਤੇ ਜਨ ਜਗ ਮਾਹਿ ॥
ਸਦਾ ਸਦਾ ਹਰਿ ਕੇ ਗੁਨ ਗਾਹਿ ॥
ਰਾਮ ਨਾਮ ਜੋ ਕਰਹਿ ਬੀਚਾਰ ॥
ਸੇ ਧਨਵੰਤ ਗਨੀ ਸੰਸਾਰ ॥
ਮਨਿ ਤਨਿ ਮੁਖਿ ਬੋਲਹਿ ਹਰਿ ਮੁਖੀ ॥
ਸਦਾ ਸਦਾ ਜਾਨਹੁ ਤੇ ਸੁਖੀ ॥
ਏਕੋ ਏਕੁ ਏਕੁ ਪਛਾਨੈ ॥
ਇਤ ਉਤ ਕੀ ਓਹੁ ਸੋਝੀ ਜਾਨੈ ॥
ਨਾਮ ਸੰਗਿ ਜਿਸ ਕਾ ਮਨੁ ਮਾਨਿਆ ॥
ਨਾਨਕ ਤਿਨਹਿ ਨਿਰੰਜਨੁ ਜਾਨਿਆ ॥੩॥

ਗੁਰ ਪ੍ਰਸਾਦਿ ਆਪਨ ਆਪੁ ਸੁਝੈ ॥
ਤਿਸ ਕੀ ਜਾਨਹੁ ਤ੍ਰਿਸਨਾ ਬੁਝੈ ॥
ਸਾਧਸੰਗਿ ਹਰਿ ਹਰਿ ਜਸੁ ਕਹਤ ॥
ਸਰਬ ਰੋਗ ਤੇ ਓਹੁ ਹਰਿ ਜਨੁ ਰਹਤ ॥
ਅਨਦਿਨੁ ਕੀਰਤਨੁ ਕੇਵਲ ਬਖ੍ਹਾਨੁ ॥
ਗ੍ਰਿਹਸਤ ਮਹਿ ਸੋਈ ਨਿਰਬਾਨੁ ॥
ਏਕ ਊਪਰਿ ਜਿਸੁ ਜਨ ਕੀ ਆਸਾ ॥
ਤਿਸ ਕੀ ਕਟੀਐ ਜਮ ਕੀ ਫਾਸਾ ॥
ਪਾਰਬ੍ਰਹਮ ਕੀ ਜਿਸੁ ਮਨਿ ਭੂਖ ॥
ਨਾਨਕ ਤਿਸਹਿ ਨ ਲਾਗਹਿ ਦੂਖ ॥੪॥

ਜਿਸ ਕਉ ਹਰਿ ਪ੍ਰਭੁ ਮਨਿ ਚਿਤਿ ਆਵੈ ॥
ਸੋ ਸੰਤੁ ਸੁਹੇਲਾ ਨਹੀ ਡੁਲਾਵੈ ॥
ਜਿਸੁ ਪ੍ਰਭੁ ਅਪੁਨਾ ਕਿਰਪਾ ਕਰੈ ॥
ਸੋ ਸੇਵਕੁ ਕਹੁ ਕਿਸ ਤੇ ਡਰੈ ॥
ਜੈਸਾ ਸਾ ਤੈਸਾ ਦ੍ਰਿਸਟਾਇਆ ॥
ਅਪੁਨੇ ਕਾਰਜ ਮਹਿ ਆਪਿ ਸਮਾਇਆ ॥
ਸੋਧਤ ਸੋਧਤ ਸੋਧਤ ਸੀਝਿਆ ॥
ਗੁਰ ਪ੍ਰਸਾਦਿ ਤਤੁ ਸਭੁ ਬੂਝਿਆ ॥
ਜਬ ਦੇਖਉ ਤਬ ਸਭੁ ਕਿਛੁ ਮੂਲੁ ॥
ਨਾਨਕ ਸੋ ਸੂਖਮੁ ਸੋਈ ਅਸਥੂਲੁ ॥੫॥

ਨਹ ਕਿਛੁ ਜਨਮੈ ਨਹ ਕਿਛੁ ਮਰੈ ॥
ਆਪਨ ਚਲਿਤੁ ਆਪ ਹੀ ਕਰੈ ॥
ਆਵਨੁ ਜਾਵਨੁ ਦ੍ਰਿਸਟਿ ਅਨਦ੍ਰਿਸਟਿ ॥
ਆਗਿਆਕਾਰੀ ਧਾਰੀ ਸਭ ਸ੍ਰਿਸਟਿ ॥
ਆਪੇ ਆਪਿ ਸਗਲ ਮਹਿ ਆਪਿ ॥
ਅਨਿਕ ਜੁਗਤਿ ਰਚਿ ਥਾਪਿ ਉਥਾਪਿ ॥
ਅਬਿਨਾਸੀ ਨਾਹੀ ਕਿਛੁ ਖੰਡ ॥
ਧਾਰਣ ਧਾਰਿ ਰਹਿਓ ਬ੍ਰਹਮੰਡ ॥
ਅਲਖ ਅਭੇਵ ਪੁਰਖ ਪਰਤਾਪ ॥
ਆਪਿ ਜਪਾਏ ਤ ਨਾਨਕ ਜਾਪ ॥੬॥

ਜਿਨ ਪ੍ਰਭੁ ਜਾਤਾ ਸੁ ਸੋਭਾਵੰਤ ॥
ਸਗਲ ਸੰਸਾਰੁ ਉਧਰੈ ਤਿਨ ਮੰਤ ॥
ਪ੍ਰਭ ਕੇ ਸੇਵਕ ਸਗਲ ਉਧਾਰਨ ॥
ਪ੍ਰਭ ਕੇ ਸੇਵਕ ਦੂਖ ਬਿਸਾਰਨ ॥
ਆਪੇ ਮੇਲਿ ਲਏ ਕਿਰਪਾਲ ॥
ਗੁਰ ਕਾ ਸਬਦੁ ਜਪਿ ਭਏ ਨਿਹਾਲ ॥
ਉਨ ਕੀ ਸੇਵਾ ਸੋਈ ਲਾਗੈ ॥
ਜਿਸ ਨੋ ਕ੍ਰਿਪਾ ਕਰਹਿ ਬਡਭਾਗੈ ॥
ਨਾਮੁ ਜਪਤ ਪਾਵਹਿ ਬਿਸ੍ਰਾਮੁ ॥
ਨਾਨਕ ਤਿਨ ਪੁਰਖ ਕਉ ਊਤਮ ਕਰਿ ਮਾਨੁ ॥੭॥

ਜੋ ਕਿਛੁ ਕਰੈ ਸੁ ਪ੍ਰਭ ਕੈ ਰੰਗਿ ॥
ਸਦਾ ਸਦਾ ਬਸੈ ਹਰਿ ਸੰਗਿ ॥
ਸਹਜ ਸੁਭਾਇ ਹੋਵੈ ਸੋ ਹੋਇ ॥
ਕਰਣੈਹਾਰੁ ਪਛਾਣੈ ਸੋਇ ॥
ਪ੍ਰਭ ਕਾ ਕੀਆ ਜਨ ਮੀਠ ਲਗਾਨਾ ॥
ਜੈਸਾ ਸਾ ਤੈਸਾ ਦ੍ਰਿਸਟਾਨਾ ॥
ਜਿਸ ਤੇ ਉਪਜੇ ਤਿਸੁ ਮਾਹਿ ਸਮਾਏ ॥
ਓਇ ਸੁਖ ਨਿਧਾਨ ਉਨਹੂ ਬਨਿ ਆਏ ॥
ਆਪਸ ਕਉ ਆਪਿ ਦੀਨੋ ਮਾਨੁ ॥
ਨਾਨਕ ਪ੍ਰਭ ਜਨੁ ਏਕੋ ਜਾਨੁ ॥੮॥੧੪॥

ਸਲੋਕੁ ॥
ਸਰਬ ਕਲਾ ਭਰਪੂਰ ਪ੍ਰਭ ਬਿਰਥਾ ਜਾਨਨਹਾਰ ॥
ਜਾ ਕੈ ਸਿਮਰਨਿ ਉਧਰੀਐ ਨਾਨਕ ਤਿਸੁ ਬਲਿਹਾਰ ॥੧॥

ਅਸਟਪਦੀ ॥
ਟੂਟੀ ਗਾਢਨਹਾਰ ਗੁੋਪਾਲ ॥
ਸਰਬ ਜੀਆ ਆਪੇ ਪ੍ਰਤਿਪਾਲ ॥
ਸਗਲ ਕੀ ਚਿੰਤਾ ਜਿਸੁ ਮਨ ਮਾਹਿ ॥
ਤਿਸ ਤੇ ਬਿਰਥਾ ਕੋਈ ਨਾਹਿ ॥
ਰੇ ਮਨ ਮੇਰੇ ਸਦਾ ਹਰਿ ਜਾਪਿ ॥
ਅਬਿਨਾਸੀ ਪ੍ਰਭੁ ਆਪੇ ਆਪਿ ॥
ਆਪਨ ਕੀਆ ਕਛੂ ਨ ਹੋਇ ॥
ਜੇ ਸਉ ਪ੍ਰਾਨੀ ਲੋਚੈ ਕੋਇ ॥
ਤਿਸੁ ਬਿਨੁ ਨਾਹੀ ਤੇਰੈ ਕਿਛੁ ਕਾਮ ॥
ਗਤਿ ਨਾਨਕ ਜਪਿ ਏਕ ਹਰਿ ਨਾਮ ॥੧॥

ਰੂਪਵੰਤੁ ਹੋਇ ਨਾਹੀ ਮੋਹੈ ॥
ਪ੍ਰਭ ਕੀ ਜੋਤਿ ਸਗਲ ਘਟ ਸੋਹੈ ॥
ਧਨਵੰਤਾ ਹੋਇ ਕਿਆ ਕੋ ਗਰਬੈ ॥
ਜਾ ਸਭੁ ਕਿਛੁ ਤਿਸ ਕਾ ਦੀਆ ਦਰਬੈ ॥
ਅਤਿ ਸੂਰਾ ਜੇ ਕੋਊ ਕਹਾਵੈ ॥
ਪ੍ਰਭ ਕੀ ਕਲਾ ਬਿਨਾ ਕਹ ਧਾਵੈ ॥
ਜੇ ਕੋ ਹੋਇ ਬਹੈ ਦਾਤਾਰੁ ॥
ਤਿਸੁ ਦੇਨਹਾਰੁ ਜਾਨੈ ਗਾਵਾਰੁ ॥
ਜਿਸੁ ਗੁਰ ਪ੍ਰਸਾਦਿ ਤੂਟੈ ਹਉ ਰੋਗੁ ॥
ਨਾਨਕ ਸੋ ਜਨੁ ਸਦਾ ਅਰੋਗੁ ॥੨॥

ਜਿਉ ਮੰਦਰ ਕਉ ਥਾਮੈ ਥੰਮਨੁ ॥
ਤਿਉ ਗੁਰ ਕਾ ਸਬਦੁ ਮਨਹਿ ਅਸਥੰਮਨੁ ॥
ਜਿਉ ਪਾਖਾਣੁ ਨਾਵ ਚੜਿ ਤਰੈ ॥
ਪ੍ਰਾਣੀ ਗੁਰ ਚਰਣ ਲਗਤੁ ਨਿਸਤਰੈ ॥
ਜਿਉ ਅੰਧਕਾਰ ਦੀਪਕ ਪਰਗਾਸੁ ॥
ਗੁਰ ਦਰਸਨੁ ਦੇਖਿ ਮਨਿ ਹੋਇ ਬਿਗਾਸੁ ॥
ਜਿਉ ਮਹਾ ਉਦਿਆਨ ਮਹਿ ਮਾਰਗੁ ਪਾਵੈ ॥
ਤਿਉ ਸਾਧੂ ਸੰਗਿ ਮਿਲਿ ਜੋਤਿ ਪ੍ਰਗਟਾਵੈ ॥
ਤਿਨ ਸੰਤਨ ਕੀ ਬਾਛਉ ਧੂਰਿ ॥
ਨਾਨਕ ਕੀ ਹਰਿ ਲੋਚਾ ਪੂਰਿ ॥੩॥

ਮਨ ਮੂਰਖ ਕਾਹੇ ਬਿਲਲਾਈਐ ॥
ਪੁਰਬ ਲਿਖੇ ਕਾ ਲਿਖਿਆ ਪਾਈਐ ॥
ਦੂਖ ਸੂਖ ਪ੍ਰਭ ਦੇਵਨਹਾਰੁ ॥
ਅਵਰ ਤਿਆਗਿ ਤੂ ਤਿਸਹਿ ਚਿਤਾਰੁ ॥
ਜੋ ਕਛੁ ਕਰੈ ਸੋਈ ਸੁਖੁ ਮਾਨੁ ॥
ਭੂਲਾ ਕਾਹੇ ਫਿਰਹਿ ਅਜਾਨ ॥
ਕਉਨ ਬਸਤੁ ਆਈ ਤੇਰੈ ਸੰਗ ॥
ਲਪਟਿ ਰਹਿਓ ਰਸਿ ਲੋਭੀ ਪਤੰਗ ॥
ਰਾਮ ਨਾਮ ਜਪਿ ਹਿਰਦੇ ਮਾਹਿ ॥
ਨਾਨਕ ਪਤਿ ਸੇਤੀ ਘਰਿ ਜਾਹਿ ॥੪॥

ਜਿਸੁ ਵਖਰ ਕਉ ਲੈਨਿ ਤੂ ਆਇਆ ॥
ਰਾਮ ਨਾਮੁ ਸੰਤਨ ਘਰਿ ਪਾਇਆ ॥
ਤਜਿ ਅਭਿਮਾਨੁ ਲੇਹੁ ਮਨ ਮੋਲਿ ॥
ਰਾਮ ਨਾਮੁ ਹਿਰਦੇ ਮਹਿ ਤੋਲਿ ॥
ਲਾਦਿ ਖੇਪ ਸੰਤਹ ਸੰਗਿ ਚਾਲੁ ॥
ਅਵਰ ਤਿਆਗਿ ਬਿਖਿਆ ਜੰਜਾਲ ॥
ਧੰਨਿ ਧੰਨਿ ਕਹੈ ਸਭੁ ਕੋਇ ॥
ਮੁਖ ਊਜਲ ਹਰਿ ਦਰਗਹ ਸੋਇ ॥
ਇਹੁ ਵਾਪਾਰੁ ਵਿਰਲਾ ਵਾਪਾਰੈ ॥
ਨਾਨਕ ਤਾ ਕੈ ਸਦ ਬਲਿਹਾਰੈ ॥੫॥

ਚਰਨ ਸਾਧ ਕੇ ਧੋਇ ਧੋਇ ਪੀਉ ॥
ਅਰਪਿ ਸਾਧ ਕਉ ਅਪਨਾ ਜੀਉ ॥
ਸਾਧ ਕੀ ਧੂਰਿ ਕਰਹੁ ਇਸਨਾਨੁ ॥
ਸਾਧ ਊਪਰਿ ਜਾਈਐ ਕੁਰਬਾਨੁ ॥
ਸਾਧ ਸੇਵਾ ਵਡਭਾਗੀ ਪਾਈਐ ॥
ਸਾਧਸੰਗਿ ਹਰਿ ਕੀਰਤਨੁ ਗਾਈਐ ॥
ਅਨਿਕ ਬਿਘਨ ਤੇ ਸਾਧੂ ਰਾਖੈ ॥
ਹਰਿ ਗੁਨ ਗਾਇ ਅੰਮ੍ਰਿਤ ਰਸੁ ਚਾਖੈ ॥
ਓਟ ਗਹੀ ਸੰਤਹ ਦਰਿ ਆਇਆ ॥
ਸਰਬ ਸੂਖ ਨਾਨਕ ਤਿਹ ਪਾਇਆ ॥੬॥

ਮਿਰਤਕ ਕਉ ਜੀਵਾਲਨਹਾਰ ॥
ਭੂਖੇ ਕਉ ਦੇਵਤ ਅਧਾਰ ॥
ਸਰਬ ਨਿਧਾਨ ਜਾ ਕੀ ਦ੍ਰਿਸਟੀ ਮਾਹਿ ॥
ਪੁਰਬ ਲਿਖੇ ਕਾ ਲਹਣਾ ਪਾਹਿ ॥
ਸਭੁ ਕਿਛੁ ਤਿਸ ਕਾ ਓਹੁ ਕਰਨੈ ਜੋਗੁ ॥
ਤਿਸੁ ਬਿਨੁ ਦੂਸਰ ਹੋਆ ਨ ਹੋਗੁ ॥
ਜਪਿ ਜਨ ਸਦਾ ਸਦਾ ਦਿਨੁ ਰੈਣੀ ॥
ਸਭ ਤੇ ਊਚ ਨਿਰਮਲ ਇਹ ਕਰਣੀ ॥
ਕਰਿ ਕਿਰਪਾ ਜਿਸ ਕਉ ਨਾਮੁ ਦੀਆ ॥
ਨਾਨਕ ਸੋ ਜਨੁ ਨਿਰਮਲੁ ਥੀਆ ॥੭॥

ਜਾ ਕੈ ਮਨਿ ਗੁਰ ਕੀ ਪਰਤੀਤਿ ॥
ਤਿਸੁ ਜਨ ਆਵੈ ਹਰਿ ਪ੍ਰਭੁ ਚੀਤਿ ॥
ਭਗਤੁ ਭਗਤੁ ਸੁਨੀਐ ਤਿਹੁ ਲੋਇ ॥
ਜਾ ਕੈ ਹਿਰਦੈ ਏਕੋ ਹੋਇ ॥
ਸਚੁ ਕਰਣੀ ਸਚੁ ਤਾ ਕੀ ਰਹਤ ॥
ਸਚੁ ਹਿਰਦੈ ਸਤਿ ਮੁਖਿ ਕਹਤ ॥
ਸਾਚੀ ਦ੍ਰਿਸਟਿ ਸਾਚਾ ਆਕਾਰੁ ॥
ਸਚੁ ਵਰਤੈ ਸਾਚਾ ਪਾਸਾਰੁ ॥
ਪਾਰਬ੍ਰਹਮੁ ਜਿਨਿ ਸਚੁ ਕਰਿ ਜਾਤਾ ॥
ਨਾਨਕ ਸੋ ਜਨੁ ਸਚਿ ਸਮਾਤਾ ॥੮॥੧੫॥

ਸਲੋਕੁ ॥
ਰੂਪੁ ਨ ਰੇਖ ਨ ਰੰਗੁ ਕਿਛੁ ਤ੍ਰਿਹੁ ਗੁਣ ਤੇ ਪ੍ਰਭ ਭਿੰਨ ॥
ਤਿਸਹਿ ਬੁਝਾਏ ਨਾਨਕਾ ਜਿਸੁ ਹੋਵੈ ਸੁਪ੍ਰਸੰਨ ॥੧॥

ਅਸਟਪਦੀ ॥
ਅਬਿਨਾਸੀ ਪ੍ਰਭੁ ਮਨ ਮਹਿ ਰਾਖੁ ॥
ਮਾਨੁਖ ਕੀ ਤੂ ਪ੍ਰੀਤਿ ਤਿਆਗੁ ॥
ਤਿਸ ਤੇ ਪਰੈ ਨਾਹੀ ਕਿਛੁ ਕੋਇ ॥
ਸਰਬ ਨਿਰੰਤਰਿ ਏਕੋ ਸੋਇ ॥
ਆਪੇ ਬੀਨਾ ਆਪੇ ਦਾਨਾ ॥
ਗਹਿਰ ਗੰਭੀਰੁ ਗਹੀਰੁ ਸੁਜਾਨਾ ॥
ਪਾਰਬ੍ਰਹਮ ਪਰਮੇਸੁਰ ਗੋਬਿੰਦ ॥
ਕ੍ਰਿਪਾ ਨਿਧਾਨ ਦਇਆਲ ਬਖਸੰਦ ॥
ਸਾਧ ਤੇਰੇ ਕੀ ਚਰਨੀ ਪਾਉ ॥
ਨਾਨਕ ਕੈ ਮਨਿ ਇਹੁ ਅਨਰਾਉ ॥੧॥

ਮਨਸਾ ਪੂਰਨ ਸਰਨਾ ਜੋਗ ॥
ਜੋ ਕਰਿ ਪਾਇਆ ਸੋਈ ਹੋਗੁ ॥
ਹਰਨ ਭਰਨ ਜਾ ਕਾ ਨੇਤ੍ਰ ਫੋਰੁ ॥
ਤਿਸ ਕਾ ਮੰਤ੍ਰੁ ਨ ਜਾਨੈ ਹੋਰੁ ॥
ਅਨਦ ਰੂਪ ਮੰਗਲ ਸਦ ਜਾ ਕੈ ॥
ਸਰਬ ਥੋਕ ਸੁਨੀਅਹਿ ਘਰਿ ਤਾ ਕੈ ॥
ਰਾਜ ਮਹਿ ਰਾਜੁ ਜੋਗ ਮਹਿ ਜੋਗੀ ॥
ਤਪ ਮਹਿ ਤਪੀਸਰੁ ਗ੍ਰਿਹਸਤ ਮਹਿ ਭੋਗੀ ॥
ਧਿਆਇ ਧਿਆਇ ਭਗਤਹ ਸੁਖੁ ਪਾਇਆ ॥
ਨਾਨਕ ਤਿਸੁ ਪੁਰਖ ਕਾ ਕਿਨੈ ਅੰਤੁ ਨ ਪਾਇਆ ॥੨॥

ਜਾ ਕੀ ਲੀਲਾ ਕੀ ਮਿਤਿ ਨਾਹਿ ॥
ਸਗਲ ਦੇਵ ਹਾਰੇ ਅਵਗਾਹਿ ॥
ਪਿਤਾ ਕਾ ਜਨਮੁ ਕਿ ਜਾਨੈ ਪੂਤੁ ॥
ਸਗਲ ਪਰੋਈ ਅਪੁਨੈ ਸੂਤਿ ॥
ਸੁਮਤਿ ਗਿਆਨੁ ਧਿਆਨੁ ਜਿਨ ਦੇਇ ॥
ਜਨ ਦਾਸ ਨਾਮੁ ਧਿਆਵਹਿ ਸੇਇ ॥
ਤਿਹੁ ਗੁਣ ਮਹਿ ਜਾ ਕਉ ਭਰਮਾਏ ॥
ਜਨਮਿ ਮਰੈ ਫਿਰਿ ਆਵੈ ਜਾਏ ॥
ਊਚ ਨੀਚ ਤਿਸ ਕੇ ਅਸਥਾਨ ॥
ਜੈਸਾ ਜਨਾਵੈ ਤੈਸਾ ਨਾਨਕ ਜਾਨ ॥੩॥

ਨਾਨਾ ਰੂਪ ਨਾਨਾ ਜਾ ਕੇ ਰੰਗ ॥
ਨਾਨਾ ਭੇਖ ਕਰਹਿ ਇਕ ਰੰਗ ॥
ਨਾਨਾ ਬਿਧਿ ਕੀਨੋ ਬਿਸਥਾਰੁ ॥
ਪ੍ਰਭੁ ਅਬਿਨਾਸੀ ਏਕੰਕਾਰੁ ॥
ਨਾਨਾ ਚਲਿਤ ਕਰੇ ਖਿਨ ਮਾਹਿ ॥
ਪੂਰਿ ਰਹਿਓ ਪੂਰਨੁ ਸਭ ਠਾਇ ॥
ਨਾਨਾ ਬਿਧਿ ਕਰਿ ਬਨਤ ਬਨਾਈ ॥
ਅਪਨੀ ਕੀਮਤਿ ਆਪੇ ਪਾਈ ॥
ਸਭ ਘਟ ਤਿਸ ਕੇ ਸਭ ਤਿਸ ਕੇ ਠਾਉ ॥
ਜਪਿ ਜਪਿ ਜੀਵੈ ਨਾਨਕ ਹਰਿ ਨਾਉ ॥੪॥

ਨਾਮ ਕੇ ਧਾਰੇ ਸਗਲੇ ਜੰਤ ॥
ਨਾਮ ਕੇ ਧਾਰੇ ਖੰਡ ਬ੍ਰਹਮੰਡ ॥
ਨਾਮ ਕੇ ਧਾਰੇ ਸਿਮ੍ਰਿਤਿ ਬੇਦ ਪੁਰਾਨ ॥
ਨਾਮ ਕੇ ਧਾਰੇ ਸੁਨਨ ਗਿਆਨ ਧਿਆਨ ॥
ਨਾਮ ਕੇ ਧਾਰੇ ਆਗਾਸ ਪਾਤਾਲ ॥
ਨਾਮ ਕੇ ਧਾਰੇ ਸਗਲ ਆਕਾਰ ॥
ਨਾਮ ਕੇ ਧਾਰੇ ਪੁਰੀਆ ਸਭ ਭਵਨ ॥
ਨਾਮ ਕੈ ਸੰਗਿ ਉਧਰੇ ਸੁਨਿ ਸ੍ਰਵਨ ॥
ਕਰਿ ਕਿਰਪਾ ਜਿਸੁ ਆਪਨੈ ਨਾਮਿ ਲਾਏ ॥
ਨਾਨਕ ਚਉਥੇ ਪਦ ਮਹਿ ਸੋ ਜਨੁ ਗਤਿ ਪਾਏ ॥੫॥

ਰੂਪੁ ਸਤਿ ਜਾ ਕਾ ਸਤਿ ਅਸਥਾਨੁ ॥
ਪੁਰਖੁ ਸਤਿ ਕੇਵਲ ਪਰਧਾਨੁ ॥
ਕਰਤੂਤਿ ਸਤਿ ਸਤਿ ਜਾ ਕੀ ਬਾਣੀ ॥
ਸਤਿ ਪੁਰਖ ਸਭ ਮਾਹਿ ਸਮਾਣੀ ॥
ਸਤਿ ਕਰਮੁ ਜਾ ਕੀ ਰਚਨਾ ਸਤਿ ॥
ਮੂਲੁ ਸਤਿ ਸਤਿ ਉਤਪਤਿ ॥
ਸਤਿ ਕਰਣੀ ਨਿਰਮਲ ਨਿਰਮਲੀ ॥
ਜਿਸਹਿ ਬੁਝਾਏ ਤਿਸਹਿ ਸਭ ਭਲੀ ॥
ਸਤਿ ਨਾਮੁ ਪ੍ਰਭ ਕਾ ਸੁਖਦਾਈ ॥
ਬਿਸ੍ਵਾਸੁ ਸਤਿ ਨਾਨਕ ਗੁਰ ਤੇ ਪਾਈ ॥੬॥

ਸਤਿ ਬਚਨ ਸਾਧੂ ਉਪਦੇਸ ॥
ਸਤਿ ਤੇ ਜਨ ਜਾ ਕੈ ਰਿਦੈ ਪ੍ਰਵੇਸ ॥
ਸਤਿ ਨਿਰਤਿ ਬੂਝੈ ਜੇ ਕੋਇ ॥
ਨਾਮੁ ਜਪਤ ਤਾ ਕੀ ਗਤਿ ਹੋਇ ॥
ਆਪਿ ਸਤਿ ਕੀਆ ਸਭੁ ਸਤਿ ॥
ਆਪੇ ਜਾਨੈ ਅਪਨੀ ਮਿਤਿ ਗਤਿ ॥
ਜਿਸ ਕੀ ਸ੍ਰਿਸਟਿ ਸੁ ਕਰਣੈਹਾਰੁ ॥
ਅਵਰ ਨ ਬੂਝਿ ਕਰਤ ਬੀਚਾਰੁ ॥
ਕਰਤੇ ਕੀ ਮਿਤਿ ਨ ਜਾਨੈ ਕੀਆ ॥
ਨਾਨਕ ਜੋ ਤਿਸੁ ਭਾਵੈ ਸੋ ਵਰਤੀਆ ॥੭॥

ਬਿਸਮਨ ਬਿਸਮ ਭਏ ਬਿਸਮਾਦ ॥
ਜਿਨਿ ਬੂਝਿਆ ਤਿਸੁ ਆਇਆ ਸ੍ਵਾਦ ॥
ਪ੍ਰਭ ਕੈ ਰੰਗਿ ਰਾਚਿ ਜਨ ਰਹੇ ॥
ਗੁਰ ਕੈ ਬਚਨਿ ਪਦਾਰਥ ਲਹੇ ॥
ਓਇ ਦਾਤੇ ਦੁਖ ਕਾਟਨਹਾਰ ॥
ਜਾ ਕੈ ਸੰਗਿ ਤਰੈ ਸੰਸਾਰ ॥
ਜਨ ਕਾ ਸੇਵਕੁ ਸੋ ਵਡਭਾਗੀ ॥
ਜਨ ਕੈ ਸੰਗਿ ਏਕ ਲਿਵ ਲਾਗੀ ॥
ਗੁਨ ਗੋਬਿਦ ਕੀਰਤਨੁ ਜਨੁ ਗਾਵੈ ॥
ਗੁਰ ਪ੍ਰਸਾਦਿ ਨਾਨਕ ਫਲੁ ਪਾਵੈ ॥੮॥੧੬॥

ਸਲੋਕੁ ॥
ਆਦਿ ਸਚੁ ਜੁਗਾਦਿ ਸਚੁ ॥
ਹੈ ਭਿ ਸਚੁ ਨਾਨਕ ਹੋਸੀ ਭਿ ਸਚੁ ॥੧॥

ਅਸਟਪਦੀ ॥
ਚਰਨ ਸਤਿ ਸਤਿ ਪਰਸਨਹਾਰ ॥
ਪੂਜਾ ਸਤਿ ਸਤਿ ਸੇਵਦਾਰ ॥
ਦਰਸਨੁ ਸਤਿ ਸਤਿ ਪੇਖਨਹਾਰ ॥
ਨਾਮੁ ਸਤਿ ਸਤਿ ਧਿਆਵਨਹਾਰ ॥
ਆਪਿ ਸਤਿ ਸਤਿ ਸਭ ਧਾਰੀ ॥
ਆਪੇ ਗੁਣ ਆਪੇ ਗੁਣਕਾਰੀ ॥
ਸਬਦੁ ਸਤਿ ਸਤਿ ਪ੍ਰਭੁ ਬਕਤਾ ॥
ਸੁਰਤਿ ਸਤਿ ਸਤਿ ਜਸੁ ਸੁਨਤਾ ॥
ਬੁਝਨਹਾਰ ਕਉ ਸਤਿ ਸਭ ਹੋਇ ॥
ਨਾਨਕ ਸਤਿ ਸਤਿ ਪ੍ਰਭੁ ਸੋਇ ॥੧॥

ਸਤਿ ਸਰੂਪੁ ਰਿਦੈ ਜਿਨਿ ਮਾਨਿਆ ॥
ਕਰਨ ਕਰਾਵਨ ਤਿਨਿ ਮੂਲੁ ਪਛਾਨਿਆ ॥
ਜਾ ਕੈ ਰਿਦੈ ਬਿਸ੍ਵਾਸੁ ਪ੍ਰਭ ਆਇਆ ॥
ਤਤੁ ਗਿਆਨੁ ਤਿਸੁ ਮਨਿ ਪ੍ਰਗਟਾਇਆ ॥
ਭੈ ਤੇ ਨਿਰਭਉ ਹੋਇ ਬਸਾਨਾ ॥
ਜਿਸ ਤੇ ਉਪਜਿਆ ਤਿਸੁ ਮਾਹਿ ਸਮਾਨਾ ॥
ਬਸਤੁ ਮਾਹਿ ਲੇ ਬਸਤੁ ਗਡਾਈ ॥
ਤਾ ਕਉ ਭਿੰਨ ਨ ਕਹਨਾ ਜਾਈ ॥
ਬੂਝੈ ਬੂਝਨਹਾਰੁ ਬਿਬੇਕ ॥
ਨਾਰਾਇਨ ਮਿਲੇ ਨਾਨਕ ਏਕ ॥੨॥

ਠਾਕੁਰ ਕਾ ਸੇਵਕੁ ਆਗਿਆਕਾਰੀ ॥
ਠਾਕੁਰ ਕਾ ਸੇਵਕੁ ਸਦਾ ਪੂਜਾਰੀ ॥
ਠਾਕੁਰ ਕੇ ਸੇਵਕ ਕੈ ਮਨਿ ਪਰਤੀਤਿ ॥
ਠਾਕੁਰ ਕੇ ਸੇਵਕ ਕੀ ਨਿਰਮਲ ਰੀਤਿ ॥
ਠਾਕੁਰ ਕਉ ਸੇਵਕੁ ਜਾਨੈ ਸੰਗਿ ॥
ਪ੍ਰਭ ਕਾ ਸੇਵਕੁ ਨਾਮ ਕੈ ਰੰਗਿ ॥
ਸੇਵਕ ਕਉ ਪ੍ਰਭ ਪਾਲਨਹਾਰਾ ॥
ਸੇਵਕ ਕੀ ਰਾਖੈ ਨਿਰੰਕਾਰਾ ॥
ਸੋ ਸੇਵਕੁ ਜਿਸੁ ਦਇਆ ਪ੍ਰਭੁ ਧਾਰੈ ॥
ਨਾਨਕ ਸੋ ਸੇਵਕੁ ਸਾਸਿ ਸਾਸਿ ਸਮਾਰੈ ॥੩॥

ਅਪੁਨੇ ਜਨ ਕਾ ਪਰਦਾ ਢਾਕੈ ॥
ਅਪਨੇ ਸੇਵਕ ਕੀ ਸਰਪਰ ਰਾਖੈ ॥
ਅਪਨੇ ਦਾਸ ਕਉ ਦੇਇ ਵਡਾਈ ॥
ਅਪਨੇ ਸੇਵਕ ਕਉ ਨਾਮੁ ਜਪਾਈ ॥
ਅਪਨੇ ਸੇਵਕ ਕੀ ਆਪਿ ਪਤਿ ਰਾਖੈ ॥
ਤਾ ਕੀ ਗਤਿ ਮਿਤਿ ਕੋਇ ਨ ਲਾਖੈ ॥
ਪ੍ਰਭ ਕੇ ਸੇਵਕ ਕਉ ਕੋ ਨ ਪਹੂਚੈ ॥
ਪ੍ਰਭ ਕੇ ਸੇਵਕ ਊਚ ਤੇ ਊਚੇ ॥
ਜੋ ਪ੍ਰਭਿ ਅਪਨੀ ਸੇਵਾ ਲਾਇਆ ॥
ਨਾਨਕ ਸੋ ਸੇਵਕੁ ਦਹ ਦਿਸਿ ਪ੍ਰਗਟਾਇਆ ॥੪॥

ਨੀਕੀ ਕੀਰੀ ਮਹਿ ਕਲ ਰਾਖੈ ॥
ਭਸਮ ਕਰੈ ਲਸਕਰ ਕੋਟਿ ਲਾਖੈ ॥
ਜਿਸ ਕਾ ਸਾਸੁ ਨ ਕਾਢਤ ਆਪਿ ॥
ਤਾ ਕਉ ਰਾਖਤ ਦੇ ਕਰਿ ਹਾਥ ॥
ਮਾਨਸ ਜਤਨ ਕਰਤ ਬਹੁ ਭਾਤਿ ॥
ਤਿਸ ਕੇ ਕਰਤਬ ਬਿਰਥੇ ਜਾਤਿ ॥
ਮਾਰੈ ਨ ਰਾਖੈ ਅਵਰੁ ਨ ਕੋਇ ॥
ਸਰਬ ਜੀਆ ਕਾ ਰਾਖਾ ਸੋਇ ॥
ਕਾਹੇ ਸੋਚ ਕਰਹਿ ਰੇ ਪ੍ਰਾਣੀ ॥
ਜਪਿ ਨਾਨਕ ਪ੍ਰਭ ਅਲਖ ਵਿਡਾਣੀ ॥੫॥

ਬਾਰੰ ਬਾਰ ਬਾਰ ਪ੍ਰਭੁ ਜਪੀਐ ॥
ਪੀ ਅੰਮ੍ਰਿਤੁ ਇਹੁ ਮਨੁ ਤਨੁ ਧ੍ਰਪੀਐ ॥
ਨਾਮ ਰਤਨੁ ਜਿਨਿ ਗੁਰਮੁਖਿ ਪਾਇਆ ॥
ਤਿਸੁ ਕਿਛੁ ਅਵਰੁ ਨਾਹੀ ਦ੍ਰਿਸਟਾਇਆ ॥
ਨਾਮੁ ਧਨੁ ਨਾਮੋ ਰੂਪੁ ਰੰਗੁ ॥
ਨਾਮੋ ਸੁਖੁ ਹਰਿ ਨਾਮ ਕਾ ਸੰਗੁ ॥
ਨਾਮ ਰਸਿ ਜੋ ਜਨ ਤ੍ਰਿਪਤਾਨੇ ॥
ਮਨ ਤਨ ਨਾਮਹਿ ਨਾਮਿ ਸਮਾਨੇ ॥
ਊਠਤ ਬੈਠਤ ਸੋਵਤ ਨਾਮ ॥
ਕਹੁ ਨਾਨਕ ਜਨ ਕੈ ਸਦ ਕਾਮ ॥੬॥

ਬੋਲਹੁ ਜਸੁ ਜਿਹਬਾ ਦਿਨੁ ਰਾਤਿ ॥
ਪ੍ਰਭਿ ਅਪਨੈ ਜਨ ਕੀਨੀ ਦਾਤਿ ॥
ਕਰਹਿ ਭਗਤਿ ਆਤਮ ਕੈ ਚਾਇ ॥
ਪ੍ਰਭ ਅਪਨੇ ਸਿਉ ਰਹਹਿ ਸਮਾਇ ॥
ਜੋ ਹੋਆ ਹੋਵਤ ਸੋ ਜਾਨੈ ॥
ਪ੍ਰਭ ਅਪਨੇ ਕਾ ਹੁਕਮੁ ਪਛਾਨੈ ॥
ਤਿਸ ਕੀ ਮਹਿਮਾ ਕਉਨ ਬਖਾਨਉ ॥
ਤਿਸ ਕਾ ਗੁਨੁ ਕਹਿ ਏਕ ਨ ਜਾਨਉ ॥
ਆਠ ਪਹਰ ਪ੍ਰਭ ਬਸਹਿ ਹਜੂਰੇ ॥
ਕਹੁ ਨਾਨਕ ਸੇਈ ਜਨ ਪੂਰੇ ॥੭॥

ਮਨ ਮੇਰੇ ਤਿਨ ਕੀ ਓਟ ਲੇਹਿ ॥
ਮਨੁ ਤਨੁ ਅਪਨਾ ਤਿਨ ਜਨ ਦੇਹਿ ॥
ਜਿਨਿ ਜਨਿ ਅਪਨਾ ਪ੍ਰਭੂ ਪਛਾਤਾ ॥
ਸੋ ਜਨੁ ਸਰਬ ਥੋਕ ਕਾ ਦਾਤਾ ॥
ਤਿਸ ਕੀ ਸਰਨਿ ਸਰਬ ਸੁਖ ਪਾਵਹਿ ॥
ਤਿਸ ਕੈ ਦਰਸਿ ਸਭ ਪਾਪ ਮਿਟਾਵਹਿ ॥
ਅਵਰ ਸਿਆਨਪ ਸਗਲੀ ਛਾਡੁ ॥
ਤਿਸੁ ਜਨ ਕੀ ਤੂ ਸੇਵਾ ਲਾਗੁ ॥
ਆਵਨੁ ਜਾਨੁ ਨ ਹੋਵੀ ਤੇਰਾ ॥
ਨਾਨਕ ਤਿਸੁ ਜਨ ਕੇ ਪੂਜਹੁ ਸਦ ਪੈਰਾ ॥੮॥੧੭॥

ਸਲੋਕੁ ॥
ਸਤਿ ਪੁਰਖੁ ਜਿਨਿ ਜਾਨਿਆ ਸਤਿਗੁਰੁ ਤਿਸ ਕਾ ਨਾਉ ॥
ਤਿਸ ਕੈ ਸੰਗਿ ਸਿਖੁ ਉਧਰੈ ਨਾਨਕ ਹਰਿ ਗੁਨ ਗਾਉ ॥੧॥

ਅਸਟਪਦੀ ॥
ਸਤਿਗੁਰੁ ਸਿਖ ਕੀ ਕਰੈ ਪ੍ਰਤਿਪਾਲ ॥
ਸੇਵਕ ਕਉ ਗੁਰੁ ਸਦਾ ਦਇਆਲ ॥
ਸਿਖ ਕੀ ਗੁਰੁ ਦੁਰਮਤਿ ਮਲੁ ਹਿਰੈ ॥
ਗੁਰ ਬਚਨੀ ਹਰਿ ਨਾਮੁ ਉਚਰੈ ॥
ਸਤਿਗੁਰੁ ਸਿਖ ਕੇ ਬੰਧਨ ਕਾਟੈ ॥
ਗੁਰ ਕਾ ਸਿਖੁ ਬਿਕਾਰ ਤੇ ਹਾਟੈ ॥
ਸਤਿਗੁਰੁ ਸਿਖ ਕਉ ਨਾਮ ਧਨੁ ਦੇਇ ॥
ਗੁਰ ਕਾ ਸਿਖੁ ਵਡਭਾਗੀ ਹੇ ॥
ਸਤਿਗੁਰੁ ਸਿਖ ਕਾ ਹਲਤੁ ਪਲਤੁ ਸਵਾਰੈ ॥
ਨਾਨਕ ਸਤਿਗੁਰੁ ਸਿਖ ਕਉ ਜੀਅ ਨਾਲਿ ਸਮਾਰੈ ॥੧॥

ਗੁਰ ਕੈ ਗ੍ਰਿਹਿ ਸੇਵਕੁ ਜੋ ਰਹੈ ॥
ਗੁਰ ਕੀ ਆਗਿਆ ਮਨ ਮਹਿ ਸਹੈ ॥
ਆਪਸ ਕਉ ਕਰਿ ਕਛੁ ਨ ਜਨਾਵੈ ॥
ਹਰਿ ਹਰਿ ਨਾਮੁ ਰਿਦੈ ਸਦ ਧਿਆਵੈ ॥
ਮਨੁ ਬੇਚੈ ਸਤਿਗੁਰ ਕੈ ਪਾਸਿ ॥
ਤਿਸੁ ਸੇਵਕ ਕੇ ਕਾਰਜ ਰਾਸਿ ॥
ਸੇਵਾ ਕਰਤ ਹੋਇ ਨਿਹਕਾਮੀ ॥
ਤਿਸ ਕਉ ਹੋਤ ਪਰਾਪਤਿ ਸੁਆਮੀ ॥
ਅਪਨੀ ਕ੍ਰਿਪਾ ਜਿਸੁ ਆਪਿ ਕਰੇਇ ॥
ਨਾਨਕ ਸੋ ਸੇਵਕੁ ਗੁਰ ਕੀ ਮਤਿ ਲੇਇ ॥੨॥

ਬੀਸ ਬਿਸਵੇ ਗੁਰ ਕਾ ਮਨੁ ਮਾਨੈ ॥
ਸੋ ਸੇਵਕੁ ਪਰਮੇਸੁਰ ਕੀ ਗਤਿ ਜਾਨੈ ॥
ਸੋ ਸਤਿਗੁਰੁ ਜਿਸੁ ਰਿਦੈ ਹਰਿ ਨਾਉ ॥
ਅਨਿਕ ਬਾਰ ਗੁਰ ਕਉ ਬਲਿ ਜਾਉ ॥
ਸਰਬ ਨਿਧਾਨ ਜੀਅ ਕਾ ਦਾਤਾ ॥
ਆਠ ਪਹਰ ਪਾਰਬ੍ਰਹਮ ਰੰਗਿ ਰਾਤਾ ॥
ਬ੍ਰਹਮ ਮਹਿ ਜਨੁ ਜਨ ਮਹਿ ਪਾਰਬ੍ਰਹਮੁ ॥
ਏਕਹਿ ਆਪਿ ਨਹੀ ਕਛੁ ਭਰਮੁ ॥
ਸਹਸ ਸਿਆਨਪ ਲਇਆ ਨ ਜਾਈਐ ॥
ਨਾਨਕ ਐਸਾ ਗੁਰੁ ਬਡਭਾਗੀ ਪਾਈਐ ॥੩॥

ਸਫਲ ਦਰਸਨੁ ਪੇਖਤ ਪੁਨੀਤ ॥
ਪਰਸਤ ਚਰਨ ਗਤਿ ਨਿਰਮਲ ਰੀਤਿ ॥
ਭੇਟਤ ਸੰਗਿ ਰਾਮ ਗੁਨ ਰਵੇ ॥
ਪਾਰਬ੍ਰਹਮ ਕੀ ਦਰਗਹ ਗਵੇ ॥
ਸੁਨਿ ਕਰਿ ਬਚਨ ਕਰਨ ਆਘਾਨੇ ॥
ਮਨਿ ਸੰਤੋਖੁ ਆਤਮ ਪਤੀਆਨੇ ॥
ਪੂਰਾ ਗੁਰੁ ਅਖ੍ਹਓ ਜਾ ਕਾ ਮੰਤ੍ਰ ॥
ਅੰਮ੍ਰਿਤ ਦ੍ਰਿਸਟਿ ਪੇਖੈ ਹੋਇ ਸੰਤ ॥
ਗੁਣ ਬਿਅੰਤ ਕੀਮਤਿ ਨਹੀ ਪਾਇ ॥
ਨਾਨਕ ਜਿਸੁ ਭਾਵੈ ਤਿਸੁ ਲਏ ਮਿਲਾਇ ॥੪॥

ਜਿਹਬਾ ਏਕ ਉਸਤਤਿ ਅਨੇਕ ॥
ਸਤਿ ਪੁਰਖ ਪੂਰਨ ਬਿਬੇਕ ॥
ਕਾਹੂ ਬੋਲ ਨ ਪਹੁਚਤ ਪ੍ਰਾਨੀ ॥
ਅਗਮ ਅਗੋਚਰ ਪ੍ਰਭ ਨਿਰਬਾਨੀ ॥
ਨਿਰਾਹਾਰ ਨਿਰਵੈਰ ਸੁਖਦਾਈ ॥
ਤਾ ਕੀ ਕੀਮਤਿ ਕਿਨੈ ਨ ਪਾਈ ॥
ਅਨਿਕ ਭਗਤ ਬੰਦਨ ਨਿਤ ਕਰਹਿ ॥
ਚਰਨ ਕਮਲ ਹਿਰਦੈ ਸਿਮਰਹਿ ॥
ਸਦ ਬਲਿਹਾਰੀ ਸਤਿਗੁਰ ਅਪਨੇ ॥
ਨਾਨਕ ਜਿਸੁ ਪ੍ਰਸਾਦਿ ਐਸਾ ਪ੍ਰਭੁ ਜਪਨੇ ॥੫॥

ਇਹੁ ਹਰਿ ਰਸੁ ਪਾਵੈ ਜਨੁ ਕੋਇ ॥
ਅੰਮ੍ਰਿਤੁ ਪੀਵੈ ਅਮਰੁ ਸੋ ਹੋਇ ॥
ਉਸੁ ਪੁਰਖ ਕਾ ਨਾਹੀ ਕਦੇ ਬਿਨਾਸ ॥
ਜਾ ਕੈ ਮਨਿ ਪ੍ਰਗਟੇ ਗੁਨਤਾਸ ॥
ਆਠ ਪਹਰ ਹਰਿ ਕਾ ਨਾਮੁ ਲੇਇ ॥
ਸਚੁ ਉਪਦੇਸੁ ਸੇਵਕ ਕਉ ਦੇਇ ॥
ਮੋਹ ਮਾਇਆ ਕੈ ਸੰਗਿ ਨ ਲੇਪੁ ॥
ਮਨ ਮਹਿ ਰਾਖੈ ਹਰਿ ਹਰਿ ਏਕੁ ॥
ਅੰਧਕਾਰ ਦੀਪਕ ਪਰਗਾਸੇ ॥
ਨਾਨਕ ਭਰਮ ਮੋਹ ਦੁਖ ਤਹ ਤੇ ਨਾਸੇ ॥੬॥

ਤਪਤਿ ਮਾਹਿ ਠਾਢਿ ਵਰਤਾਈ ॥
ਅਨਦੁ ਭਇਆ ਦੁਖ ਨਾਠੇ ਭਾਈ ॥
ਜਨਮ ਮਰਨ ਕੇ ਮਿਟੇ ਅੰਦੇਸੇ ॥
ਸਾਧੂ ਕੇ ਪੂਰਨ ਉਪਦੇਸੇ ॥
ਭਉ ਚੂਕਾ ਨਿਰਭਉ ਹੋਇ ਬਸੇ ॥
ਸਗਲ ਬਿਆਧਿ ਮਨ ਤੇ ਖੈ ਨਸੇ ॥
ਜਿਸ ਕਾ ਸਾ ਤਿਨਿ ਕਿਰਪਾ ਧਾਰੀ ॥
ਸਾਧਸੰਗਿ ਜਪਿ ਨਾਮੁ ਮੁਰਾਰੀ ॥
ਥਿਤਿ ਪਾਈ ਚੂਕੇ ਭ੍ਰਮ ਗਵਨ ॥
ਸੁਨਿ ਨਾਨਕ ਹਰਿ ਹਰਿ ਜਸੁ ਸ੍ਰਵਨ ॥੭॥

ਨਿਰਗੁਨੁ ਆਪਿ ਸਰਗੁਨੁ ਭੀ ਓਹੀ ॥
ਕਲਾ ਧਾਰਿ ਜਿਨਿ ਸਗਲੀ ਮੋਹੀ ॥
ਅਪਨੇ ਚਰਿਤ ਪ੍ਰਭਿ ਆਪਿ ਬਨਾਏ ॥
ਅਪੁਨੀ ਕੀਮਤਿ ਆਪੇ ਪਾਏ ॥
ਹਰਿ ਬਿਨੁ ਦੂਜਾ ਨਾਹੀ ਕੋਇ ॥
ਸਰਬ ਨਿਰੰਤਰਿ ਏਕੋ ਸੋਇ ॥
ਓਤਿ ਪੋਤਿ ਰਵਿਆ ਰੂਪ ਰੰਗ ॥
ਭਏ ਪ੍ਰਗਾਸ ਸਾਧ ਕੈ ਸੰਗ ॥
ਰਚਿ ਰਚਨਾ ਅਪਨੀ ਕਲ ਧਾਰੀ ॥
ਅਨਿਕ ਬਾਰ ਨਾਨਕ ਬਲਿਹਾਰੀ ॥੮॥੧੮॥

ਸਲੋਕੁ ॥
ਸਾਥਿ ਨ ਚਾਲੈ ਬਿਨੁ ਭਜਨ ਬਿਖਿਆ ਸਗਲੀ ਛਾਰੁ ॥
ਹਰਿ ਹਰਿ ਨਾਮੁ ਕਮਾਵਨਾ ਨਾਨਕ ਇਹੁ ਧਨੁ ਸਾਰੁ ॥੧॥

ਅਸਟਪਦੀ ॥
ਸੰਤ ਜਨਾ ਮਿਲਿ ਕਰਹੁ ਬੀਚਾਰੁ ॥
ਏਕੁ ਸਿਮਰਿ ਨਾਮ ਆਧਾਰੁ ॥
ਅਵਰਿ ਉਪਾਵ ਸਭਿ ਮੀਤ ਬਿਸਾਰਹੁ ॥
ਚਰਨ ਕਮਲ ਰਿਦ ਮਹਿ ਉਰਿ ਧਾਰਹੁ ॥
ਕਰਨ ਕਾਰਨ ਸੋ ਪ੍ਰਭੁ ਸਮਰਥੁ ॥
ਦ੍ਰਿੜੁ ਕਰਿ ਗਹਹੁ ਨਾਮੁ ਹਰਿ ਵਥੁ ॥
ਇਹੁ ਧਨੁ ਸੰਚਹੁ ਹੋਵਹੁ ਭਗਵੰਤ ॥
ਸੰਤ ਜਨਾ ਕਾ ਨਿਰਮਲ ਮੰਤ ॥
ਏਕ ਆਸ ਰਾਖਹੁ ਮਨ ਮਾਹਿ ॥
ਸਰਬ ਰੋਗ ਨਾਨਕ ਮਿਟਿ ਜਾਹਿ ॥੧॥

ਜਿਸੁ ਧਨ ਕਉ ਚਾਰਿ ਕੁੰਟ ਉਠਿ ਧਾਵਹਿ ॥
ਸੋ ਧਨੁ ਹਰਿ ਸੇਵਾ ਤੇ ਪਾਵਹਿ ॥
ਜਿਸੁ ਸੁਖ ਕਉ ਨਿਤ ਬਾਛਹਿ ਮੀਤ ॥
ਸੋ ਸੁਖੁ ਸਾਧੂ ਸੰਗਿ ਪਰੀਤਿ ॥
ਜਿਸੁ ਸੋਭਾ ਕਉ ਕਰਹਿ ਭਲੀ ਕਰਨੀ ॥
ਸਾ ਸੋਭਾ ਭਜੁ ਹਰਿ ਕੀ ਸਰਨੀ ॥
ਅਨਿਕ ਉਪਾਵੀ ਰੋਗੁ ਨ ਜਾਇ ॥
ਰੋਗੁ ਮਿਟੈ ਹਰਿ ਅਵਖਧੁ ਲਾਇ ॥
ਸਰਬ ਨਿਧਾਨ ਮਹਿ ਹਰਿ ਨਾਮੁ ਨਿਧਾਨੁ ॥
ਜਪਿ ਨਾਨਕ ਦਰਗਹਿ ਪਰਵਾਨੁ ॥੨॥

ਮਨੁ ਪਰਬੋਧਹੁ ਹਰਿ ਕੈ ਨਾਇ ॥
ਦਹ ਦਿਸਿ ਧਾਵਤ ਆਵੈ ਠਾਇ ॥
ਤਾ ਕਉ ਬਿਘਨੁ ਨ ਲਾਗੈ ਕੋਇ ॥
ਜਾ ਕੈ ਰਿਦੈ ਬਸੈ ਹਰਿ ਸੋਇ ॥
ਕਲਿ ਤਾਤੀ ਠਾਂਢਾ ਹਰਿ ਨਾਉ ॥
ਸਿਮਰਿ ਸਿਮਰਿ ਸਦਾ ਸੁਖ ਪਾਉ ॥
ਭਉ ਬਿਨਸੈ ਪੂਰਨ ਹੋਇ ਆਸ ॥
ਭਗਤਿ ਭਾਇ ਆਤਮ ਪਰਗਾਸ ॥
ਤਿਤੁ ਘਰਿ ਜਾਇ ਬਸੈ ਅਬਿਨਾਸੀ ॥
ਕਹੁ ਨਾਨਕ ਕਾਟੀ ਜਮ ਫਾਸੀ ॥੩॥

ਤਤੁ ਬੀਚਾਰੁ ਕਹੈ ਜਨੁ ਸਾਚਾ ॥
ਜਨਮਿ ਮਰੈ ਸੋ ਕਾਚੋ ਕਾਚਾ ॥
ਆਵਾ ਗਵਨੁ ਮਿਟੈ ਪ੍ਰਭ ਸੇਵ ॥
ਆਪੁ ਤਿਆਗਿ ਸਰਨਿ ਗੁਰਦੇਵ ॥
ਇਉ ਰਤਨ ਜਨਮ ਕਾ ਹੋਇ ਉਧਾਰੁ ॥
ਹਰਿ ਹਰਿ ਸਿਮਰਿ ਪ੍ਰਾਨ ਆਧਾਰੁ ॥
ਅਨਿਕ ਉਪਾਵ ਨ ਛੂਟਨਹਾਰੇ ॥
ਸਿੰਮ੍ਰਿਤਿ ਸਾਸਤ ਬੇਦ ਬੀਚਾਰੇ ॥
ਹਰਿ ਕੀ ਭਗਤਿ ਕਰਹੁ ਮਨੁ ਲਾਇ ॥
ਮਨਿ ਬੰਛਤ ਨਾਨਕ ਫਲ ਪਾਇ ॥੪॥

ਸੰਗਿ ਨ ਚਾਲਸਿ ਤੇਰੈ ਧਨਾ ॥
ਤੂੰ ਕਿਆ ਲਪਟਾਵਹਿ ਮੂਰਖ ਮਨਾ ॥
ਸੁਤ ਮੀਤ ਕੁਟੰਬ ਅਰੁ ਬਨਿਤਾ ॥
ਇਨ ਤੇ ਕਹਹੁ ਤੁਮ ਕਵਨ ਸਨਾਥਾ ॥
ਰਾਜ ਰੰਗ ਮਾਇਆ ਬਿਸਥਾਰ ॥
ਇਨ ਤੇ ਕਹਹੁ ਕਵਨ ਛੁਟਕਾਰ ॥
ਅਸੁ ਹਸਤੀ ਰਥ ਅਸਵਾਰੀ ॥
ਝੂਠਾ ਡੰਫੁ ਝੂਠੁ ਪਾਸਾਰੀ ॥
ਜਿਨਿ ਦੀਏ ਤਿਸੁ ਬੁਝੈ ਨ ਬਿਗਾਨਾ ॥
ਨਾਮੁ ਬਿਸਾਰਿ ਨਾਨਕ ਪਛੁਤਾਨਾ ॥੫॥

ਗੁਰ ਕੀ ਮਤਿ ਤੂੰ ਲੇਹਿ ਇਆਨੇ ॥
ਭਗਤਿ ਬਿਨਾ ਬਹੁ ਡੂਬੇ ਸਿਆਨੇ ॥
ਹਰਿ ਕੀ ਭਗਤਿ ਕਰਹੁ ਮਨ ਮੀਤ ॥
ਨਿਰਮਲ ਹੋਇ ਤੁਮਾ੍ਰੀ ਚੀਤ ॥
ਚਰਨ ਕਮਲ ਰਾਖਹੁ ਮਨ ਮਾਹਿ ॥
ਜਨਮ ਜਨਮ ਕੇ ਕਿਲਬਿਖ ਜਾਹਿ ॥
ਆਪਿ ਜਪਹੁ ਅਵਰਾ ਨਾਮੁ ਜਪਾਵਹੁ ॥
ਸੁਨਤ ਕਹਤ ਰਹਤ ਗਤਿ ਪਾਵਹੁ ॥
ਸਾਰ ਭੂਤ ਸਤਿ ਹਰਿ ਕੋ ਨਾਉ ॥
ਸਹਜਿ ਸੁਭਾਇ ਨਾਨਕ ਗੁਨ ਗਾਉ ॥੬॥

ਗੁਨ ਗਾਵਤ ਤੇਰੀ ਉਤਰਸਿ ਮੈਲੁ ॥
ਬਿਨਸਿ ਜਾਇ ਹਉਮੈ ਬਿਖੁ ਫੈਲੁ ॥
ਹੋਹਿ ਅਚਿੰਤੁ ਬਸੈ ਸੁਖ ਨਾਲਿ ॥
ਸਾਸਿ ਗ੍ਰਾਸਿ ਹਰਿ ਨਾਮੁ ਸਮਾਲਿ ॥
ਛਾਡਿ ਸਿਆਨਪ ਸਗਲੀ ਮਨਾ ॥
ਸਾਧਸੰਗਿ ਪਾਵਹਿ ਸਚੁ ਧਨਾ ॥
ਹਰਿ ਪੂੰਜੀ ਸੰਚਿ ਕਰਹੁ ਬਿਉਹਾਰੁ ॥
ਈਹਾ ਸੁਖੁ ਦਰਗਹ ਜੈਕਾਰੁ ॥
ਸਰਬ ਨਿਰੰਤਰਿ ਏਕੋ ਦੇਖੁ ॥
ਕਹੁ ਨਾਨਕ ਜਾ ਕੈ ਮਸਤਕਿ ਲੇਖੁ ॥੭॥

ਏਕੋ ਜਪਿ ਏਕੋ ਸਾਲਾਹਿ ॥
ਏਕੁ ਸਿਮਰਿ ਏਕੋ ਮਨ ਆਹਿ ॥
ਏਕਸ ਕੇ ਗੁਨ ਗਾਉ ਅਨੰਤ ॥
ਮਨਿ ਤਨਿ ਜਾਪਿ ਏਕ ਭਗਵੰਤ ॥
ਏਕੋ ਏਕੁ ਏਕੁ ਹਰਿ ਆਪਿ ॥
ਪੂਰਨ ਪੂਰਿ ਰਹਿਓ ਪ੍ਰਭੁ ਬਿਆਪਿ ॥
ਅਨਿਕ ਬਿਸਥਾਰ ਏਕ ਤੇ ਭਏ ॥
ਏਕੁ ਅਰਾਧਿ ਪਰਾਛਤ ਗਏ ॥
ਮਨ ਤਨ ਅੰਤਰਿ ਏਕੁ ਪ੍ਰਭੁ ਰਾਤਾ ॥
ਗੁਰ ਪ੍ਰਸਾਦਿ ਨਾਨਕ ਇਕੁ ਜਾਤਾ ॥੮॥੧੯॥

ਸਲੋਕੁ ॥
ਫਿਰਤ ਫਿਰਤ ਪ੍ਰਭ ਆਇਆ ਪਰਿਆ ਤਉ ਸਰਨਾਇ ॥
ਨਾਨਕ ਕੀ ਪ੍ਰਭ ਬੇਨਤੀ ਅਪਨੀ ਭਗਤੀ ਲਾਇ ॥੧॥

ਅਸਟਪਦੀ ॥
ਜਾਚਕ ਜਨੁ ਜਾਚੈ ਪ੍ਰਭ ਦਾਨੁ ॥
ਕਰਿ ਕਿਰਪਾ ਦੇਵਹੁ ਹਰਿ ਨਾਮੁ ॥
ਸਾਧ ਜਨਾ ਕੀ ਮਾਗਉ ਧੂਰਿ ॥
ਪਾਰਬ੍ਰਹਮ ਮੇਰੀ ਸਰਧਾ ਪੂਰਿ ॥
ਸਦਾ ਸਦਾ ਪ੍ਰਭ ਕੇ ਗੁਨ ਗਾਵਉ ॥
ਸਾਸਿ ਸਾਸਿ ਪ੍ਰਭ ਤੁਮਹਿ ਧਿਆਵਉ ॥
ਚਰਨ ਕਮਲ ਸਿਉ ਲਾਗੈ ਪ੍ਰੀਤਿ ॥
ਭਗਤਿ ਕਰਉ ਪ੍ਰਭ ਕੀ ਨਿਤ ਨੀਤਿ ॥
ਏਕ ਓਟ ਏਕੋ ਆਧਾਰੁ ॥
ਨਾਨਕੁ ਮਾਗੈ ਨਾਮੁ ਪ੍ਰਭ ਸਾਰੁ ॥੧॥

ਪ੍ਰਭ ਕੀ ਦ੍ਰਿਸਟਿ ਮਹਾ ਸੁਖੁ ਹੋਇ ॥
ਹਰਿ ਰਸੁ ਪਾਵੈ ਬਿਰਲਾ ਕੋਇ ॥
ਜਿਨ ਚਾਖਿਆ ਸੇ ਜਨ ਤ੍ਰਿਪਤਾਨੇ ॥
ਪੂਰਨ ਪੁਰਖ ਨਹੀ ਡੋਲਾਨੇ ॥
ਸੁਭਰ ਭਰੇ ਪ੍ਰੇਮ ਰਸ ਰੰਗਿ ॥
ਉਪਜੈ ਚਾਉ ਸਾਧ ਕੈ ਸੰਗਿ ॥
ਪਰੇ ਸਰਨਿ ਆਨ ਸਭ ਤਿਆਗਿ ॥
ਅੰਤਰਿ ਪ੍ਰਗਾਸ ਅਨਦਿਨੁ ਲਿਵ ਲਾਗਿ ॥
ਬਡਭਾਗੀ ਜਪਿਆ ਪ੍ਰਭੁ ਸੋਇ ॥
ਨਾਨਕ ਨਾਮਿ ਰਤੇ ਸੁਖੁ ਹੋਇ ॥੨॥

ਸੇਵਕ ਕੀ ਮਨਸਾ ਪੂਰੀ ਭਈ ॥
ਸਤਿਗੁਰ ਤੇ ਨਿਰਮਲ ਮਤਿ ਲਈ ॥
ਜਨ ਕਉ ਪ੍ਰਭੁ ਹੋਇਓ ਦਇਆਲੁ ॥
ਸੇਵਕੁ ਕੀਨੋ ਸਦਾ ਨਿਹਾਲੁ ॥
ਬੰਧਨ ਕਾਟਿ ਮੁਕਤਿ ਜਨੁ ਭਇਆ ॥
ਜਨਮ ਮਰਨ ਦੂਖੁ ਭ੍ਰਮੁ ਗਇਆ ॥
ਇਛ ਪੁਨੀ ਸਰਧਾ ਸਭ ਪੂਰੀ ॥
ਰਵਿ ਰਹਿਆ ਸਦ ਸੰਗਿ ਹਜੂਰੀ ॥
ਜਿਸ ਕਾ ਸਾ ਤਿਨਿ ਲੀਆ ਮਿਲਾਇ ॥
ਨਾਨਕ ਭਗਤੀ ਨਾਮਿ ਸਮਾਇ ॥੩॥

ਸੋ ਕਿਉ ਬਿਸਰੈ ਜਿ ਘਾਲ ਨ ਭਾਨੈ ॥
ਸੋ ਕਿਉ ਬਿਸਰੈ ਜਿ ਕੀਆ ਜਾਨੈ ॥
ਸੋ ਕਿਉ ਬਿਸਰੈ ਜਿਨਿ ਸਭੁ ਕਿਛੁ ਦੀਆ ॥
ਸੋ ਕਿਉ ਬਿਸਰੈ ਜਿ ਜੀਵਨ ਜੀਆ ॥
ਸੋ ਕਿਉ ਬਿਸਰੈ ਜਿ ਅਗਨਿ ਮਹਿ ਰਾਖੈ ॥
ਗੁਰ ਪ੍ਰਸਾਦਿ ਕੋ ਬਿਰਲਾ ਲਾਖੈ ॥
ਸੋ ਕਿਉ ਬਿਸਰੈ ਜਿ ਬਿਖੁ ਤੇ ਕਾਢੈ ॥
ਜਨਮ ਜਨਮ ਕਾ ਟੂਟਾ ਗਾਢੈ ॥
ਗੁਰਿ ਪੂਰੈ ਤਤੁ ਇਹੈ ਬੁਝਾਇਆ ॥
ਪ੍ਰਭੁ ਅਪਨਾ ਨਾਨਕ ਜਨ ਧਿਆਇਆ ॥੪॥

ਸਾਜਨ ਸੰਤ ਕਰਹੁ ਇਹੁ ਕਾਮੁ ॥
ਆਨ ਤਿਆਗਿ ਜਪਹੁ ਹਰਿ ਨਾਮੁ ॥
ਸਿਮਰਿ ਸਿਮਰਿ ਸਿਮਰਿ ਸੁਖ ਪਾਵਹੁ ॥
ਆਪਿ ਜਪਹੁ ਅਵਰਹ ਨਾਮੁ ਜਪਾਵਹੁ ॥
ਭਗਤਿ ਭਾਇ ਤਰੀਐ ਸੰਸਾਰੁ ॥
ਬਿਨੁ ਭਗਤੀ ਤਨੁ ਹੋਸੀ ਛਾਰੁ ॥
ਸਰਬ ਕਲਿਆਣ ਸੂਖ ਨਿਧਿ ਨਾਮੁ ॥
ਬੂਡਤ ਜਾਤ ਪਾਏ ਬਿਸ੍ਰਾਮੁ ॥
ਸਗਲ ਦੂਖ ਕਾ ਹੋਵਤ ਨਾਸੁ ॥
ਨਾਨਕ ਨਾਮੁ ਜਪਹੁ ਗੁਨਤਾਸੁ ॥੫॥

ਉਪਜੀ ਪ੍ਰੀਤਿ ਪ੍ਰੇਮ ਰਸੁ ਚਾਉ ॥
ਮਨ ਤਨ ਅੰਤਰਿ ਇਹੀ ਸੁਆਉ ॥
ਨੇਤ੍ਰਹੁ ਪੇਖਿ ਦਰਸੁ ਸੁਖੁ ਹੋਇ ॥
ਮਨੁ ਬਿਗਸੈ ਸਾਧ ਚਰਨ ਧੋਇ ॥
ਭਗਤ ਜਨਾ ਕੈ ਮਨਿ ਤਨਿ ਰੰਗੁ ॥
ਬਿਰਲਾ ਕੋਊ ਪਾਵੈ ਸੰਗੁ ॥
ਏਕ ਬਸਤੁ ਦੀਜੈ ਕਰਿ ਮਇਆ ॥
ਗੁਰ ਪ੍ਰਸਾਦਿ ਨਾਮੁ ਜਪਿ ਲਇਆ ॥
ਤਾ ਕੀ ਉਪਮਾ ਕਹੀ ਨ ਜਾਇ ॥
ਨਾਨਕ ਰਹਿਆ ਸਰਬ ਸਮਾਇ ॥੬॥

ਪ੍ਰਭ ਬਖਸੰਦ ਦੀਨ ਦਇਆਲ ॥
ਭਗਤਿ ਵਛਲ ਸਦਾ ਕਿਰਪਾਲ ॥
ਅਨਾਥ ਨਾਥ ਗੋਬਿੰਦ ਗੁਪਾਲ ॥
ਸਰਬ ਘਟਾ ਕਰਤ ਪ੍ਰਤਿਪਾਲ ॥
ਆਦਿ ਪੁਰਖ ਕਾਰਣ ਕਰਤਾਰ ॥
ਭਗਤ ਜਨਾ ਕੇ ਪ੍ਰਾਨ ਅਧਾਰ ॥
ਜੋ ਜੋ ਜਪੈ ਸੁ ਹੋਇ ਪੁਨੀਤ ॥
ਭਗਤਿ ਭਾਇ ਲਾਵੈ ਮਨ ਹੀਤ ॥
ਹਮ ਨਿਰਗੁਨੀਆਰ ਨੀਚ ਅਜਾਨ ॥
ਨਾਨਕ ਤੁਮਰੀ ਸਰਨਿ ਪੁਰਖ ਭਗਵਾਨ ॥੭॥

ਸਰਬ ਬੈਕੁੰਠ ਮੁਕਤਿ ਮੋਖ ਪਾਏ ॥
ਏਕ ਨਿਮਖ ਹਰਿ ਕੇ ਗੁਨ ਗਾਏ ॥
ਅਨਿਕ ਰਾਜ ਭੋਗ ਬਡਿਆਈ ॥
ਹਰਿ ਕੇ ਨਾਮ ਕੀ ਕਥਾ ਮਨਿ ਭਾਈ ॥
ਬਹੁ ਭੋਜਨ ਕਾਪਰ ਸੰਗੀਤ ॥
ਰਸਨਾ ਜਪਤੀ ਹਰਿ ਹਰਿ ਨੀਤ ॥
ਭਲੀ ਸੁ ਕਰਨੀ ਸੋਭਾ ਧਨਵੰਤ ॥
ਹਿਰਦੈ ਬਸੇ ਪੂਰਨ ਗੁਰ ਮੰਤ ॥
ਸਾਧਸੰਗਿ ਪ੍ਰਭ ਦੇਹੁ ਨਿਵਾਸ ॥
ਸਰਬ ਸੂਖ ਨਾਨਕ ਪਰਗਾਸ ॥੮॥੨੦॥

ਸਲੋਕੁ ॥
ਸਰਗੁਨ ਨਿਰਗੁਨ ਨਿਰੰਕਾਰ ਸੁੰਨ ਸਮਾਧੀ ਆਪਿ ॥
ਆਪਨ ਕੀਆ ਨਾਨਕਾ ਆਪੇ ਹੀ ਫਿਰਿ ਜਾਪਿ ॥੧॥

ਅਸਟਪਦੀ ॥
ਜਬ ਅਕਾਰੁ ਇਹੁ ਕਛੁ ਨ ਦ੍ਰਿਸਟੇਤਾ ॥
ਪਾਪ ਪੁੰਨ ਤਬ ਕਹ ਤੇ ਹੋਤਾ ॥
ਜਬ ਧਾਰੀ ਆਪਨ ਸੁੰਨ ਸਮਾਧਿ ॥
ਤਬ ਬੈਰ ਬਿਰੋਧ ਕਿਸੁ ਸੰਗਿ ਕਮਾਤਿ ॥
ਜਬ ਇਸ ਕਾ ਬਰਨੁ ਚਿਹਨੁ ਨ ਜਾਪਤ ॥
ਤਬ ਹਰਖ ਸੋਗ ਕਹੁ ਕਿਸਹਿ ਬਿਆਪਤ ॥
ਜਬ ਆਪਨ ਆਪ ਆਪਿ ਪਾਰਬ੍ਰਹਮ ॥
ਤਬ ਮੋਹ ਕਹਾ ਕਿਸੁ ਹੋਵਤ ਭਰਮ ॥
ਆਪਨ ਖੇਲੁ ਆਪਿ ਵਰਤੀਜਾ ॥
ਨਾਨਕ ਕਰਨੈਹਾਰੁ ਨ ਦੂਜਾ ॥੧॥

ਜਬ ਹੋਵਤ ਪ੍ਰਭ ਕੇਵਲ ਧਨੀ ॥
ਤਬ ਬੰਧ ਮੁਕਤਿ ਕਹੁ ਕਿਸ ਕਉ ਗਨੀ ॥
ਜਬ ਏਕਹਿ ਹਰਿ ਅਗਮ ਅਪਾਰ ॥
ਤਬ ਨਰਕ ਸੁਰਗ ਕਹੁ ਕਉਨ ਅਉਤਾਰ ॥
ਜਬ ਨਿਰਗੁਨ ਪ੍ਰਭ ਸਹਜ ਸੁਭਾਇ ॥
ਤਬ ਸਿਵ ਸਕਤਿ ਕਹਹੁ ਕਿਤੁ ਠਾਇ ॥
ਜਬ ਆਪਹਿ ਆਪਿ ਅਪਨੀ ਜੋਤਿ ਧਰੈ ॥
ਤਬ ਕਵਨ ਨਿਡਰੁ ਕਵਨ ਕਤ ਡਰੈ ॥
ਆਪਨ ਚਲਿਤ ਆਪਿ ਕਰਨੈਹਾਰ ॥
ਨਾਨਕ ਠਾਕੁਰ ਅਗਮ ਅਪਾਰ ॥੨॥

ਅਬਿਨਾਸੀ ਸੁਖ ਆਪਨ ਆਸਨ ॥
ਤਹ ਜਨਮ ਮਰਨ ਕਹੁ ਕਹਾ ਬਿਨਾਸਨ ॥
ਜਬ ਪੂਰਨ ਕਰਤਾ ਪ੍ਰਭੁ ਸੋਇ ॥
ਤਬ ਜਮ ਕੀ ਤ੍ਰਾਸ ਕਹਹੁ ਕਿਸੁ ਹੋਇ ॥
ਜਬ ਅਬਿਗਤ ਅਗੋਚਰ ਪ੍ਰਭ ਏਕਾ ॥
ਤਬ ਚਿਤ੍ਰ ਗੁਪਤ ਕਿਸੁ ਪੂਛਤ ਲੇਖਾ ॥
ਜਬ ਨਾਥ ਨਿਰੰਜਨ ਅਗੋਚਰ ਅਗਾਧੇ ॥
ਤਬ ਕਉਨ ਛੁਟੇ ਕਉਨ ਬੰਧਨ ਬਾਧੇ ॥
ਆਪਨ ਆਪ ਆਪ ਹੀ ਅਚਰਜਾ ॥
ਨਾਨਕ ਆਪਨ ਰੂਪ ਆਪ ਹੀ ਉਪਰਜਾ ॥੩॥

ਜਹ ਨਿਰਮਲ ਪੁਰਖੁ ਪੁਰਖ ਪਤਿ ਹੋਤਾ ॥
ਤਹ ਬਿਨੁ ਮੈਲੁ ਕਹਹੁ ਕਿਆ ਧੋਤਾ ॥
ਜਹ ਨਿਰੰਜਨ ਨਿਰੰਕਾਰ ਨਿਰਬਾਨ ॥
ਤਹ ਕਉਨ ਕਉ ਮਾਨ ਕਉਨ ਅਭਿਮਾਨ ॥
ਜਹ ਸਰੂਪ ਕੇਵਲ ਜਗਦੀਸ ॥
ਤਹ ਛਲ ਛਿਦ੍ਰ ਲਗਤ ਕਹੁ ਕੀਸ ॥
ਜਹ ਜੋਤਿ ਸਰੂਪੀ ਜੋਤਿ ਸੰਗਿ ਸਮਾਵੈ ॥
ਤਹ ਕਿਸਹਿ ਭੂਖ ਕਵਨੁ ਤ੍ਰਿਪਤਾਵੈ ॥
ਕਰਨ ਕਰਾਵਨ ਕਰਨੈਹਾਰੁ ॥
ਨਾਨਕ ਕਰਤੇ ਕਾ ਨਾਹਿ ਸੁਮਾਰੁ ॥੪॥

ਜਬ ਅਪਨੀ ਸੋਭਾ ਆਪਨ ਸੰਗਿ ਬਨਾਈ ॥
ਤਬ ਕਵਨ ਮਾਇ ਬਾਪ ਮਿਤ੍ਰ ਸੁਤ ਭਾਈ ॥
ਜਹ ਸਰਬ ਕਲਾ ਆਪਹਿ ਪਰਬੀਨ ॥
ਤਹ ਬੇਦ ਕਤੇਬ ਕਹਾ ਕੋਊ ਚੀਨ ॥
ਜਬ ਆਪਨ ਆਪੁ ਆਪਿ ਉਰਿ ਧਾਰੈ ॥
ਤਉ ਸਗਨ ਅਪਸਗਨ ਕਹਾ ਬੀਚਾਰੈ ॥
ਜਹ ਆਪਨ ਊਚ ਆਪਨ ਆਪਿ ਨੇਰਾ ॥
ਤਹ ਕਉਨ ਠਾਕੁਰੁ ਕਉਨੁ ਕਹੀਐ ਚੇਰਾ ॥
ਬਿਸਮਨ ਬਿਸਮ ਰਹੇ ਬਿਸਮਾਦ ॥
ਨਾਨਕ ਅਪਨੀ ਗਤਿ ਜਾਨਹੁ ਆਪਿ ॥੫॥

ਜਹ ਅਛਲ ਅਛੇਦ ਅਭੇਦ ਸਮਾਇਆ ॥
ਊਹਾ ਕਿਸਹਿ ਬਿਆਪਤ ਮਾਇਆ ॥
ਆਪਸ ਕਉ ਆਪਹਿ ਆਦੇਸੁ ॥
ਤਿਹੁ ਗੁਣ ਕਾ ਨਾਹੀ ਪਰਵੇਸੁ ॥
ਜਹ ਏਕਹਿ ਏਕ ਏਕ ਭਗਵੰਤਾ ॥
ਤਹ ਕਉਨੁ ਅਚਿੰਤੁ ਕਿਸੁ ਲਾਗੈ ਚਿੰਤਾ ॥
ਜਹ ਆਪਨ ਆਪੁ ਆਪਿ ਪਤੀਆਰਾ ॥
ਤਹ ਕਉਨੁ ਕਥੈ ਕਉਨੁ ਸੁਨਨੈਹਾਰਾ ॥
ਬਹੁ ਬੇਅੰਤ ਊਚ ਤੇ ਊਚਾ ॥
ਨਾਨਕ ਆਪਸ ਕਉ ਆਪਹਿ ਪਹੂਚਾ ॥੬॥

ਜਹ ਆਪਿ ਰਚਿਓ ਪਰਪੰਚੁ ਅਕਾਰੁ ॥
ਤਿਹੁ ਗੁਣ ਮਹਿ ਕੀਨੋ ਬਿਸਥਾਰੁ ॥
ਪਾਪੁ ਪੁੰਨੁ ਤਹ ਭਈ ਕਹਾਵਤ ॥
ਕੋਊ ਨਰਕ ਕੋਊ ਸੁਰਗ ਬੰਛਾਵਤ ॥
ਆਲ ਜਾਲ ਮਾਇਆ ਜੰਜਾਲ ॥
ਹਉਮੈ ਮੋਹ ਭਰਮ ਭੈ ਭਾਰ ॥
ਦੂਖ ਸੂਖ ਮਾਨ ਅਪਮਾਨ ॥
ਅਨਿਕ ਪ੍ਰਕਾਰ ਕੀਓ ਬਖ੍ਹਾਨ ॥
ਆਪਨ ਖੇਲੁ ਆਪਿ ਕਰਿ ਦੇਖੈ ॥
ਖੇਲੁ ਸੰਕੋਚੈ ਤਉ ਨਾਨਕ ਏਕੈ ॥੭॥

ਜਹ ਅਬਿਗਤੁ ਭਗਤੁ ਤਹ ਆਪਿ ॥
ਜਹ ਪਸਰੈ ਪਾਸਾਰੁ ਸੰਤ ਪਰਤਾਪਿ ॥
ਦੁਹੂ ਪਾਖ ਕਾ ਆਪਹਿ ਧਨੀ ॥
ਉਨ ਕੀ ਸੋਭਾ ਉਨਹੂ ਬਨੀ ॥
ਆਪਹਿ ਕਉਤਕ ਕਰੈ ਅਨਦ ਚੋਜ ॥
ਆਪਹਿ ਰਸ ਭੋਗਨ ਨਿਰਜੋਗ ॥
ਜਿਸੁ ਭਾਵੈ ਤਿਸੁ ਆਪਨ ਨਾਇ ਲਾਵੈ ॥
ਜਿਸੁ ਭਾਵੈ ਤਿਸੁ ਖੇਲ ਖਿਲਾਵੈ ॥
ਬੇਸੁਮਾਰ ਅਥਾਹ ਅਗਨਤ ਅਤੋਲੈ ॥
ਜਿਉ ਬੁਲਾਵਹੁ ਤਿਉ ਨਾਨਕ ਦਾਸ ਬੋਲੈ ॥੮॥੨੧॥

ਸਲੋਕੁ ॥
ਜੀਅ ਜੰਤ ਕੇ ਠਾਕੁਰਾ ਆਪੇ ਵਰਤਣਹਾਰ ॥
ਨਾਨਕ ਏਕੋ ਪਸਰਿਆ ਦੂਜਾ ਕਹ ਦ੍ਰਿਸਟਾਰ ॥੧॥

ਅਸਟਪਦੀ ॥
ਆਪਿ ਕਥੈ ਆਪਿ ਸੁਨਨੈਹਾਰੁ ॥
ਆਪਹਿ ਏਕੁ ਆਪਿ ਬਿਸਥਾਰੁ ॥
ਜਾ ਤਿਸੁ ਭਾਵੈ ਤਾ ਸ੍ਰਿਸਟਿ ਉਪਾਏ ॥
ਆਪਨੈ ਭਾਣੈ ਲਏ ਸਮਾਏ ॥
ਤੁਮ ਤੇ ਭਿੰਨ ਨਹੀ ਕਿਛੁ ਹੋਇ ॥
ਆਪਨ ਸੂਤਿ ਸਭੁ ਜਗਤੁ ਪਰੋਇ ॥
ਜਾ ਕਉ ਪ੍ਰਭ ਜੀਉ ਆਪਿ ਬੁਝਾਏ ॥
ਸਚੁ ਨਾਮੁ ਸੋਈ ਜਨੁ ਪਾਏ ॥
ਸੋ ਸਮਦਰਸੀ ਤਤ ਕਾ ਬੇਤਾ ॥
ਨਾਨਕ ਸਗਲ ਸ੍ਰਿਸਟਿ ਕਾ ਜੇਤਾ ॥੧॥

ਜੀਅ ਜੰਤ੍ਰ ਸਭ ਤਾ ਕੈ ਹਾਥ ॥
ਦੀਨ ਦਇਆਲ ਅਨਾਥ ਕੋ ਨਾਥੁ ॥
ਜਿਸੁ ਰਾਖੈ ਤਿਸੁ ਕੋਇ ਨ ਮਾਰੈ ॥
ਸੋ ਮੂਆ ਜਿਸੁ ਮਨਹੁ ਬਿਸਾਰੈ ॥
ਤਿਸੁ ਤਜਿ ਅਵਰ ਕਹਾ ਕੋ ਜਾਇ ॥
ਸਭ ਸਿਰਿ ਏਕੁ ਨਿਰੰਜਨ ਰਾਇ ॥
ਜੀਅ ਕੀ ਜੁਗਤਿ ਜਾ ਕੈ ਸਭ ਹਾਥਿ ॥
ਅੰਤਰਿ ਬਾਹਰਿ ਜਾਨਹੁ ਸਾਥਿ ॥
ਗੁਨ ਨਿਧਾਨ ਬੇਅੰਤ ਅਪਾਰ ॥
ਨਾਨਕ ਦਾਸ ਸਦਾ ਬਲਿਹਾਰ ॥੨॥

ਪੂਰਨ ਪੂਰਿ ਰਹੇ ਦਇਆਲ ॥
ਸਭ ਊਪਰਿ ਹੋਵਤ ਕਿਰਪਾਲ ॥
ਅਪਨੇ ਕਰਤਬ ਜਾਨੈ ਆਪਿ ॥
ਅੰਤਰਜਾਮੀ ਰਹਿਓ ਬਿਆਪਿ ॥
ਪ੍ਰਤਿਪਾਲੈ ਜੀਅਨ ਬਹੁ ਭਾਤਿ ॥
ਜੋ ਜੋ ਰਚਿਓ ਸੁ ਤਿਸਹਿ ਧਿਆਤਿ ॥
ਜਿਸੁ ਭਾਵੈ ਤਿਸੁ ਲਏ ਮਿਲਾਇ ॥
ਭਗਤਿ ਕਰਹਿ ਹਰਿ ਕੇ ਗੁਣ ਗਾਇ ॥
ਮਨ ਅੰਤਰਿ ਬਿਸ੍ਵਾਸੁ ਕਰਿ ਮਾਨਿਆ ॥
ਕਰਨਹਾਰੁ ਨਾਨਕ ਇਕੁ ਜਾਨਿਆ ॥੩॥

ਜਨੁ ਲਾਗਾ ਹਰਿ ਏਕੈ ਨਾਇ ॥
ਤਿਸ ਕੀ ਆਸ ਨ ਬਿਰਥੀ ਜਾਇ ॥
ਸੇਵਕ ਕਉ ਸੇਵਾ ਬਨਿ ਆਈ ॥
ਹੁਕਮੁ ਬੂਝਿ ਪਰਮ ਪਦੁ ਪਾਈ ॥
ਇਸ ਤੇ ਊਪਰਿ ਨਹੀ ਬੀਚਾਰੁ ॥
ਜਾ ਕੈ ਮਨਿ ਬਸਿਆ ਨਿਰੰਕਾਰੁ ॥
ਬੰਧਨ ਤੋਰਿ ਭਏ ਨਿਰਵੈਰ ॥
ਅਨਦਿਨੁ ਪੂਜਹਿ ਗੁਰ ਕੇ ਪੈਰ ॥
ਇਹ ਲੋਕ ਸੁਖੀਏ ਪਰਲੋਕ ਸੁਹੇਲੇ ॥
ਨਾਨਕ ਹਰਿ ਪ੍ਰਭਿ ਆਪਹਿ ਮੇਲੇ ॥੪॥

ਸਾਧਸੰਗਿ ਮਿਲਿ ਕਰਹੁ ਅਨੰਦ ॥
ਗੁਨ ਗਾਵਹੁ ਪ੍ਰਭ ਪਰਮਾਨੰਦ ॥
ਰਾਮ ਨਾਮ ਤਤੁ ਕਰਹੁ ਬੀਚਾਰੁ ॥
ਦ੍ਰੁਲਭ ਦੇਹ ਕਾ ਕਰਹੁ ਉਧਾਰੁ ॥
ਅੰਮ੍ਰਿਤ ਬਚਨ ਹਰਿ ਕੇ ਗੁਨ ਗਾਉ ॥
ਪ੍ਰਾਨ ਤਰਨ ਕਾ ਇਹੈ ਸੁਆਉ ॥
ਆਠ ਪਹਰ ਪ੍ਰਭ ਪੇਖਹੁ ਨੇਰਾ ॥
ਮਿਟੈ ਅਗਿਆਨੁ ਬਿਨਸੈ ਅੰਧੇਰਾ ॥
ਸੁਨਿ ਉਪਦੇਸੁ ਹਿਰਦੈ ਬਸਾਵਹੁ ॥
ਮਨ ਇਛੇ ਨਾਨਕ ਫਲ ਪਾਵਹੁ ॥੫॥

ਹਲਤੁ ਪਲਤੁ ਦੁਇ ਲੇਹੁ ਸਵਾਰਿ ॥
ਰਾਮ ਨਾਮੁ ਅੰਤਰਿ ਉਰਿ ਧਾਰਿ ॥
ਪੂਰੇ ਗੁਰ ਕੀ ਪੂਰੀ ਦੀਖਿਆ ॥
ਜਿਸੁ ਮਨਿ ਬਸੈ ਤਿਸੁ ਸਾਚੁ ਪਰੀਖਿਆ ॥
ਮਨਿ ਤਨਿ ਨਾਮੁ ਜਪਹੁ ਲਿਵ ਲਾਇ ॥
ਦੂਖੁ ਦਰਦੁ ਮਨ ਤੇ ਭਉ ਜਾਇ ॥
ਸਚੁ ਵਾਪਾਰੁ ਕਰਹੁ ਵਾਪਾਰੀ ॥
ਦਰਗਹ ਨਿਬਹੈ ਖੇਪ ਤੁਮਾਰੀ ॥
ਏਕਾ ਟੇਕ ਰਖਹੁ ਮਨ ਮਾਹਿ ॥
ਨਾਨਕ ਬਹੁਰਿ ਨ ਆਵਹਿ ਜਾਹਿ ॥੬॥

ਤਿਸ ਤੇ ਦੂਰਿ ਕਹਾ ਕੋ ਜਾਇ ॥
ਉਬਰੈ ਰਾਖਨਹਾਰੁ ਧਿਆਇ ॥
ਨਿਰਭਉ ਜਪੈ ਸਗਲ ਭਉ ਮਿਟੈ ॥
ਪ੍ਰਭ ਕਿਰਪਾ ਤੇ ਪ੍ਰਾਣੀ ਛੁਟੈ ॥
ਜਿਸੁ ਪ੍ਰਭੁ ਰਾਖੈ ਤਿਸੁ ਨਾਹੀ ਦੂਖ ॥
ਨਾਮੁ ਜਪਤ ਮਨਿ ਹੋਵਤ ਸੂਖ ॥
ਚਿੰਤਾ ਜਾਇ ਮਿਟੈ ਅਹੰਕਾਰੁ ॥
ਤਿਸੁ ਜਨ ਕਉ ਕੋਇ ਨ ਪਹੁਚਨਹਾਰੁ ॥
ਸਿਰ ਊਪਰਿ ਠਾਢਾ ਗੁਰੁ ਸੂਰਾ ॥
ਨਾਨਕ ਤਾ ਕੇ ਕਾਰਜ ਪੂਰਾ ॥੭॥

ਮਤਿ ਪੂਰੀ ਅੰਮ੍ਰਿਤੁ ਜਾ ਕੀ ਦ੍ਰਿਸਟਿ ॥
ਦਰਸਨੁ ਪੇਖਤ ਉਧਰਤ ਸ੍ਰਿਸਟਿ ॥
ਚਰਨ ਕਮਲ ਜਾ ਕੇ ਅਨੂਪ ॥
ਸਫਲ ਦਰਸਨੁ ਸੁੰਦਰ ਹਰਿ ਰੂਪ ॥
ਧੰਨੁ ਸੇਵਾ ਸੇਵਕੁ ਪਰਵਾਨੁ ॥
ਅੰਤਰਜਾਮੀ ਪੁਰਖੁ ਪ੍ਰਧਾਨੁ ॥
ਜਿਸੁ ਮਨਿ ਬਸੈ ਸੁ ਹੋਤ ਨਿਹਾਲੁ ॥
ਤਾ ਕੈ ਨਿਕਟਿ ਨ ਆਵਤ ਕਾਲੁ ॥
ਅਮਰ ਭਏ ਅਮਰਾ ਪਦੁ ਪਾਇਆ ॥
ਸਾਧਸੰਗਿ ਨਾਨਕ ਹਰਿ ਧਿਆਇਆ ॥੮॥੨੨॥ 

ਸਲੋਕੁ ॥
ਗਿਆਨ ਅੰਜਨੁ ਗੁਰਿ ਦੀਆ ਅਗਿਆਨ ਅੰਧੇਰ ਬਿਨਾਸੁ ॥
ਹਰਿ ਕਿਰਪਾ ਤੇ ਸੰਤ ਭੇਟਿਆ ਨਾਨਕ ਮਨਿ ਪਰਗਾਸੁ ॥੧॥

ਅਸਟਪਦੀ ॥
ਸੰਤਸੰਗਿ ਅੰਤਰਿ ਪ੍ਰਭੁ ਡੀਠਾ ॥
ਨਾਮੁ ਪ੍ਰਭੂ ਕਾ ਲਾਗਾ ਮੀਠਾ ॥
ਸਗਲ ਸਮਿਗ੍ਰੀ ਏਕਸੁ ਘਟ ਮਾਹਿ ॥
ਅਨਿਕ ਰੰਗ ਨਾਨਾ ਦ੍ਰਿਸਟਾਹਿ ॥
ਨਉ ਨਿਧਿ ਅੰਮ੍ਰਿਤੁ ਪ੍ਰਭ ਕਾ ਨਾਮੁ ॥
ਦੇਹੀ ਮਹਿ ਇਸ ਕਾ ਬਿਸ੍ਰਾਮੁ ॥
ਸੁੰਨ ਸਮਾਧਿ ਅਨਹਤ ਤਹ ਨਾਦ ॥
ਕਹਨੁ ਨ ਜਾਈ ਅਚਰਜ ਬਿਸਮਾਦ ॥
ਤਿਨਿ ਦੇਖਿਆ ਜਿਸੁ ਆਪਿ ਦਿਖਾਏ ॥
ਨਾਨਕ ਤਿਸੁ ਜਨ ਸੋਝੀ ਪਾਏ ॥੧॥

ਸੋ ਅੰਤਰਿ ਸੋ ਬਾਹਰਿ ਅਨੰਤ ॥
ਘਟਿ ਘਟਿ ਬਿਆਪਿ ਰਹਿਆ ਭਗਵੰਤ ॥
ਧਰਨਿ ਮਾਹਿ ਆਕਾਸ ਪਇਆਲ ॥
ਸਰਬ ਲੋਕ ਪੂਰਨ ਪ੍ਰਤਿਪਾਲ ॥
ਬਨਿ ਤਿਨਿ ਪਰਬਤਿ ਹੈ ਪਾਰਬ੍ਰਹਮੁ ॥
ਜੈਸੀ ਆਗਿਆ ਤੈਸਾ ਕਰਮੁ ॥
ਪਉਣ ਪਾਣੀ ਬੈਸੰਤਰ ਮਾਹਿ ॥
ਚਾਰਿ ਕੁੰਟ ਦਹ ਦਿਸੇ ਸਮਾਹਿ ॥
ਤਿਸ ਤੇ ਭਿੰਨ ਨਹੀ ਕੋ ਠਾਉ ॥
ਗੁਰ ਪ੍ਰਸਾਦਿ ਨਾਨਕ ਸੁਖੁ ਪਾਉ ॥੨॥

ਬੇਦ ਪੁਰਾਨ ਸਿੰਮ੍ਰਿਤਿ ਮਹਿ ਦੇਖੁ ॥
ਸਸੀਅਰ ਸੂਰ ਨਖ੍ਹਤ੍ਰ ਮਹਿ ਏਕੁ ॥
ਬਾਣੀ ਪ੍ਰਭ ਕੀ ਸਭੁ ਕੋ ਬੋਲੈ ॥
ਆਪਿ ਅਡੋਲੁ ਨ ਕਬਹੂ ਡੋਲੈ ॥
ਸਰਬ ਕਲਾ ਕਰਿ ਖੇਲੈ ਖੇਲ ॥
ਮੋਲਿ ਨ ਪਾਈਐ ਗੁਣਹ ਅਮੋਲ ॥
ਸਰਬ ਜੋਤਿ ਮਹਿ ਜਾ ਕੀ ਜੋਤਿ ॥
ਧਾਰਿ ਰਹਿਓ ਸੁਆਮੀ ਓਤਿ ਪੋਤਿ ॥
ਗੁਰ ਪਰਸਾਦਿ ਭਰਮ ਕਾ ਨਾਸੁ ॥
ਨਾਨਕ ਤਿਨ ਮਹਿ ਏਹੁ ਬਿਸਾਸੁ ॥੩॥

ਸੰਤ ਜਨਾ ਕਾ ਪੇਖਨੁ ਸਭੁ ਬ੍ਰਹਮ ॥
ਸੰਤ ਜਨਾ ਕੈ ਹਿਰਦੈ ਸਭਿ ਧਰਮ ॥
ਸੰਤ ਜਨਾ ਸੁਨਹਿ ਸੁਭ ਬਚਨ ॥
ਸਰਬ ਬਿਆਪੀ ਰਾਮ ਸੰਗਿ ਰਚਨ ॥
ਜਿਨਿ ਜਾਤਾ ਤਿਸ ਕੀ ਇਹ ਰਹਤ ॥
ਸਤਿ ਬਚਨ ਸਾਧੂ ਸਭਿ ਕਹਤ ॥
ਜੋ ਜੋ ਹੋਇ ਸੋਈ ਸੁਖੁ ਮਾਨੈ ॥
ਕਰਨ ਕਰਾਵਨਹਾਰੁ ਪ੍ਰਭੁ ਜਾਨੈ ॥
ਅੰਤਰਿ ਬਸੇ ਬਾਹਰਿ ਭੀ ਓਹੀ ॥
ਨਾਨਕ ਦਰਸਨੁ ਦੇਖਿ ਸਭ ਮੋਹੀ ॥੪॥

ਆਪਿ ਸਤਿ ਕੀਆ ਸਭੁ ਸਤਿ ॥
ਤਿਸੁ ਪ੍ਰਭ ਤੇ ਸਗਲੀ ਉਤਪਤਿ ॥
ਤਿਸੁ ਭਾਵੈ ਤਾ ਕਰੇ ਬਿਸਥਾਰੁ ॥
ਤਿਸੁ ਭਾਵੈ ਤਾ ਏਕੰਕਾਰੁ ॥
ਅਨਿਕ ਕਲਾ ਲਖੀ ਨਹ ਜਾਇ ॥
ਜਿਸੁ ਭਾਵੈ ਤਿਸੁ ਲਏ ਮਿਲਾਇ ॥
ਕਵਨ ਨਿਕਟਿ ਕਵਨ ਕਹੀਐ ਦੂਰਿ ॥
ਆਪੇ ਆਪਿ ਆਪ ਭਰਪੂਰਿ ॥
ਅੰਤਰਗਤਿ ਜਿਸੁ ਆਪਿ ਜਨਾਏ ॥
ਨਾਨਕ ਤਿਸੁ ਜਨ ਆਪਿ ਬੁਝਾਏ ॥੫॥

ਸਰਬ ਭੂਤ ਆਪਿ ਵਰਤਾਰਾ ॥
ਸਰਬ ਨੈਨ ਆਪਿ ਪੇਖਨਹਾਰਾ ॥
ਸਗਲ ਸਮਗ੍ਰੀ ਜਾ ਕਾ ਤਨਾ ॥
ਆਪਨ ਜਸੁ ਆਪ ਹੀ ਸੁਨਾ ॥
ਆਵਨ ਜਾਨੁ ਇਕੁ ਖੇਲੁ ਬਨਾਇਆ ॥
ਆਗਿਆਕਾਰੀ ਕੀਨੀ ਮਾਇਆ ॥
ਸਭ ਕੈ ਮਧਿ ਅਲਿਪਤੋ ਰਹੈ ॥
ਜੋ ਕਿਛੁ ਕਹਣਾ ਸੁ ਆਪੇ ਕਹੈ ॥
ਆਗਿਆ ਆਵੈ ਆਗਿਆ ਜਾਇ ॥
ਨਾਨਕ ਜਾ ਭਾਵੈ ਤਾ ਲਏ ਸਮਾਇ ॥੬॥

ਇਸ ਤੇ ਹੋਇ ਸੁ ਨਾਹੀ ਬੁਰਾ ॥
ਓਰੈ ਕਹਹੁ ਕਿਨੈ ਕਛੁ ਕਰਾ ॥
ਆਪਿ ਭਲਾ ਕਰਤੂਤਿ ਅਤਿ ਨੀਕੀ ॥
ਆਪੇ ਜਾਨੈ ਅਪਨੇ ਜੀ ਕੀ ॥
ਆਪਿ ਸਾਚੁ ਧਾਰੀ ਸਭ ਸਾਚੁ ॥
ਓਤਿ ਪੋਤਿ ਆਪਨ ਸੰਗਿ ਰਾਚੁ ॥
ਤਾ ਕੀ ਗਤਿ ਮਿਤਿ ਕਹੀ ਨ ਜਾਇ ॥
ਦੂਸਰ ਹੋਇ ਤ ਸੋਝੀ ਪਾਇ ॥
ਤਿਸ ਕਾ ਕੀਆ ਸਭੁ ਪਰਵਾਨੁ ॥
ਗੁਰ ਪ੍ਰਸਾਦਿ ਨਾਨਕ ਇਹੁ ਜਾਨੁ ॥੭॥

ਜੋ ਜਾਨੈ ਤਿਸੁ ਸਦਾ ਸੁਖੁ ਹੋਇ ॥
ਆਪਿ ਮਿਲਾਇ ਲਏ ਪ੍ਰਭੁ ਸੋਇ ॥
ਓਹੁ ਧਨਵੰਤੁ ਕੁਲਵੰਤੁ ਪਤਿਵੰਤੁ ॥
ਜੀਵਨ ਮੁਕਤਿ ਜਿਸੁ ਰਿਦੈ ਭਗਵੰਤੁ ॥
ਧੰਨੁ ਧੰਨੁ ਧੰਨੁ ਜਨੁ ਆਇਆ ॥
ਜਿਸੁ ਪ੍ਰਸਾਦਿ ਸਭੁ ਜਗਤੁ ਤਰਾਇਆ ॥
ਜਨ ਆਵਨ ਕਾ ਇਹੈ ਸੁਆਉ ॥
ਜਨ ਕੈ ਸੰਗਿ ਚਿਤਿ ਆਵੈ ਨਾਉ ॥
ਆਪਿ ਮੁਕਤੁ ਮੁਕਤੁ ਕਰੈ ਸੰਸਾਰੁ ॥
ਨਾਨਕ ਤਿਸੁ ਜਨ ਕਉ ਸਦਾ ਨਮਸਕਾਰੁ ॥੮॥੨੩॥

ਸਲੋਕੁ ॥
ਪੂਰਾ ਪ੍ਰਭੁ ਆਰਾਧਿਆ ਪੂਰਾ ਜਾ ਕਾ ਨਾਉ ॥
ਨਾਨਕ ਪੂਰਾ ਪਾਇਆ ਪੂਰੇ ਕੇ ਗੁਨ ਗਾਉ ॥੧॥

ਅਸਟਪਦੀ ॥
ਪੂਰੇ ਗੁਰ ਕਾ ਸੁਨਿ ਉਪਦੇਸੁ ॥
ਪਾਰਬ੍ਰਹਮੁ ਨਿਕਟਿ ਕਰਿ ਪੇਖੁ ॥
ਸਾਸਿ ਸਾਸਿ ਸਿਮਰਹੁ ਗੋਬਿੰਦ ॥
ਮਨ ਅੰਤਰ ਕੀ ਉਤਰੈ ਚਿੰਦ ॥
ਆਸ ਅਨਿਤ ਤਿਆਗਹੁ ਤਰੰਗ ॥
ਸੰਤ ਜਨਾ ਕੀ ਧੂਰਿ ਮਨ ਮੰਗ ॥
ਆਪੁ ਛੋਡਿ ਬੇਨਤੀ ਕਰਹੁ ॥
ਸਾਧਸੰਗਿ ਅਗਨਿ ਸਾਗਰੁ ਤਰਹੁ ॥
ਹਰਿ ਧਨ ਕੇ ਭਰਿ ਲੇਹੁ ਭੰਡਾਰ ॥
ਨਾਨਕ ਗੁਰ ਪੂਰੇ ਨਮਸਕਾਰ ॥੧॥

ਖੇਮ ਕੁਸਲ ਸਹਜ ਆਨੰਦ ॥
ਸਾਧਸੰਗਿ ਭਜੁ ਪਰਮਾਨੰਦ ॥
ਨਰਕ ਨਿਵਾਰਿ ਉਧਾਰਹੁ ਜੀਉ ॥
ਗੁਨ ਗੋਬਿੰਦ ਅੰਮ੍ਰਿਤ ਰਸੁ ਪੀਉ ॥
ਚਿਤਿ ਚਿਤਵਹੁ ਨਾਰਾਇਣ ਏਕ ॥
ਏਕ ਰੂਪ ਜਾ ਕੇ ਰੰਗ ਅਨੇਕ ॥
ਗੋਪਾਲ ਦਾਮੋਦਰ ਦੀਨ ਦਇਆਲ ॥
ਦੁਖ ਭੰਜਨ ਪੂਰਨ ਕਿਰਪਾਲ ॥
ਸਿਮਰਿ ਸਿਮਰਿ ਨਾਮੁ ਬਾਰੰ ਬਾਰ ॥
ਨਾਨਕ ਜੀਅ ਕਾ ਇਹੈ ਅਧਾਰ ॥੨॥

ਉਤਮ ਸਲੋਕ ਸਾਧ ਕੇ ਬਚਨ ॥
ਅਮੁਲੀਕ ਲਾਲ ਏਹਿ ਰਤਨ ॥
ਸੁਨਤ ਕਮਾਵਤ ਹੋਤ ਉਧਾਰ ॥
ਆਪਿ ਤਰੈ ਲੋਕਹ ਨਿਸਤਾਰ ॥
ਸਫਲ ਜੀਵਨੁ ਸਫਲੁ ਤਾ ਕਾ ਸੰਗੁ ॥
ਜਾ ਕੈ ਮਨਿ ਲਾਗਾ ਹਰਿ ਰੰਗੁ ॥
ਜੈ ਜੈ ਸਬਦੁ ਅਨਾਹਦੁ ਵਾਜੈ ॥
ਸੁਨਿ ਸੁਨਿ ਅਨਦ ਕਰੇ ਪ੍ਰਭੁ ਗਾਜੈ ॥
ਪ੍ਰਗਟੇ ਗੁਪਾਲ ਮਹਾਂਤ ਕੈ ਮਾਥੇ ॥
ਨਾਨਕ ਉਧਰੇ ਤਿਨ ਕੈ ਸਾਥੇ ॥੩॥

ਸਰਨਿ ਜੋਗੁ ਸੁਨਿ ਸਰਨੀ ਆਏ ॥
ਕਰਿ ਕਿਰਪਾ ਪ੍ਰਭ ਆਪ ਮਿਲਾਏ ॥
ਮਿਟਿ ਗਏ ਬੈਰ ਭਏ ਸਭ ਰੇਨ ॥
ਅੰਮ੍ਰਿਤ ਨਾਮੁ ਸਾਧਸੰਗਿ ਲੈਨ ॥
ਸੁਪ੍ਰਸੰਨ ਭਏ ਗੁਰਦੇਵ ॥
ਪੂਰਨ ਹੋਈ ਸੇਵਕ ਕੀ ਸੇਵ ॥
ਆਲ ਜੰਜਾਲ ਬਿਕਾਰ ਤੇ ਰਹਤੇ ॥
ਰਾਮ ਨਾਮ ਸੁਨਿ ਰਸਨਾ ਕਹਤੇ ॥
ਕਰਿ ਪ੍ਰਸਾਦੁ ਦਇਆ ਪ੍ਰਭਿ ਧਾਰੀ ॥
ਨਾਨਕ ਨਿਬਹੀ ਖੇਪ ਹਮਾਰੀ ॥੪॥

ਪ੍ਰਭ ਕੀ ਉਸਤਤਿ ਕਰਹੁ ਸੰਤ ਮੀਤ ॥
ਸਾਵਧਾਨ ਏਕਾਗਰ ਚੀਤ ॥
ਸੁਖਮਨੀ ਸਹਜ ਗੋਬਿੰਦ ਗੁਨ ਨਾਮ ॥
ਜਿਸੁ ਮਨਿ ਬਸੈ ਸੁ ਹੋਤ ਨਿਧਾਨ ॥
ਸਰਬ ਇਛਾ ਤਾ ਕੀ ਪੂਰਨ ਹੋਇ ॥
ਪ੍ਰਧਾਨ ਪੁਰਖੁ ਪ੍ਰਗਟੁ ਸਭ ਲੋਇ ॥
ਸਭ ਤੇ ਊਚ ਪਾਏ ਅਸਥਾਨੁ ॥
ਬਹੁਰਿ ਨ ਹੋਵੈ ਆਵਨ ਜਾਨੁ ॥
ਹਰਿ ਧਨੁ ਖਾਟਿ ਚਲੈ ਜਨੁ ਸੋਇ ॥
ਨਾਨਕ ਜਿਸਹਿ ਪਰਾਪਤਿ ਹੋਇ ॥੫॥

ਖੇਮ ਸਾਂਤਿ ਰਿਧਿ ਨਵ ਨਿਧਿ ॥
ਬੁਧਿ ਗਿਆਨੁ ਸਰਬ ਤਹ ਸਿਧਿ ॥
ਬਿਦਿਆ ਤਪੁ ਜੋਗੁ ਪ੍ਰਭ ਧਿਆਨੁ ॥
ਗਿਆਨੁ ਸ੍ਰੇਸਟ ਊਤਮ ਇਸਨਾਨੁ ॥
ਚਾਰਿ ਪਦਾਰਥ ਕਮਲ ਪ੍ਰਗਾਸ ॥
ਸਭ ਕੈ ਮਧਿ ਸਗਲ ਤੇ ਉਦਾਸ ॥
ਸੁੰਦਰੁ ਚਤੁਰੁ ਤਤ ਕਾ ਬੇਤਾ ॥
ਸਮਦਰਸੀ ਏਕ ਦ੍ਰਿਸਟੇਤਾ ॥
ਇਹ ਫਲ ਤਿਸੁ ਜਨ ਕੈ ਮੁਖਿ ਭਨੇ ॥
ਗੁਰ ਨਾਨਕ ਨਾਮ ਬਚਨ ਮਨਿ ਸੁਨੇ ॥੬॥

ਇਹੁ ਨਿਧਾਨੁ ਜਪੈ ਮਨਿ ਕੋਇ ॥
ਸਭ ਜੁਗ ਮਹਿ ਤਾ ਕੀ ਗਤਿ ਹੋਇ ॥
ਗੁਣ ਗੋਬਿੰਦ ਨਾਮ ਧੁਨਿ ਬਾਣੀ ॥
ਸਿਮ੍ਰਿਤਿ ਸਾਸਤ੍ਰ ਬੇਦ ਬਖਾਣੀ ॥
ਸਗਲ ਮਤਾਂਤ ਕੇਵਲ ਹਰਿ ਨਾਮ ॥
ਗੋਬਿੰਦ ਭਗਤ ਕੈ ਮਨਿ ਬਿਸ੍ਰਾਮ ॥
ਕੋਟਿ ਅਪ੍ਰਾਧ ਸਾਧਸੰਗਿ ਮਿਟੈ ॥
ਸੰਤ ਕ੍ਰਿਪਾ ਤੇ ਜਮ ਤੇ ਛੁਟੈ ॥
ਜਾ ਕੈ ਮਸਤਕਿ ਕਰਮ ਪ੍ਰਭਿ ਪਾਏ ॥
ਸਾਧ ਸਰਣਿ ਨਾਨਕ ਤੇ ਆਏ ॥੭॥

ਜਿਸੁ ਮਨਿ ਬਸੈ ਸੁਨੈ ਲਾਇ ਪ੍ਰੀਤਿ ॥
ਤਿਸੁ ਜਨ ਆਵੈ ਹਰਿ ਪ੍ਰਭੁ ਚੀਤਿ ॥
ਜਨਮ ਮਰਨ ਤਾ ਕਾ ਦੂਖੁ ਨਿਵਾਰੈ ॥
ਦੁਲਭ ਦੇਹ ਤਤਕਾਲ ਉਧਾਰੈ ॥
ਨਿਰਮਲ ਸੋਭਾ ਅੰਮ੍ਰਿਤ ਤਾ ਕੀ ਬਾਨੀ ॥
ਏਕੁ ਨਾਮੁ ਮਨ ਮਾਹਿ ਸਮਾਨੀ ॥
ਦੂਖ ਰੋਗ ਬਿਨਸੇ ਭੈ ਭਰਮ ॥
ਸਾਧ ਨਾਮ ਨਿਰਮਲ ਤਾ ਕੇ ਕਰਮ ॥
ਸਭ ਤੇ ਊਚ ਤਾ ਕੀ ਸੋਭਾ ਬਨੀ ॥
ਨਾਨਕ ਇਹ ਗੁਣਿ ਨਾਮੁ ਸੁਖਮਨੀ ॥੮॥੨੪॥''';

  static const String kirtanSohila = '''ਕੀਰਤਨ ਸੋਹਿਲਾ

ਸੋਹਿਲਾ
ਰਾਗੁ ਗਉੜੀ ਦੀਪਕੀ ਮਹਲਾ ੧
ੴ ਸਤਿਗੁਰ ਪ੍ਰਸਾਦਿ ॥

ਜੈ ਘਰਿ ਕੀਰਤਿ ਆਖੀਐ ਕਰਤੇ ਕਾ ਹੋਇ ਬੀਚਾਰੋ ॥
ਤਿਤੁ ਘਰਿ ਗਾਵਹੁ ਸੋਹਿਲਾ ਸਿਵਰਿਹੁ ਸਿਰਜਣਹਾਰੋ ॥੧॥

ਤੁਮ ਗਾਵਹੁ ਮੇਰੇ ਨਿਰਭਉ ਕਾ ਸੋਹਿਲਾ ॥
ਹਉ ਵਾਰੀ ਜਿਤੁ ਸੋਹਿਲੈ ਸਦਾ ਸੁਖੁ ਹੋਇ ॥੧॥ ਰਹਾਉ ॥

ਨਿਤ ਨਿਤ ਜੀਅੜੇ ਸਮਾਲੀਅਨਿ ਦੇਖੈਗਾ ਦੇਵਣਹਾਰੁ ॥
ਤੇਰੇ ਦਾਨੈ ਕੀਮਤਿ ਨਾ ਪਵੈ ਤਿਸੁ ਦਾਤੇ ਕਵਣੁ ਸੁਮਾਰੁ ॥੨॥

ਸੰਬਤਿ ਸਾਹਾ ਲਿਖਿਆ ਮਿਲਿ ਕਰਿ ਪਾਵਹੁ ਤੇਲੁ ॥
ਦੇਹੁ ਸਜਣ ਅਸੀਸੜੀਆ ਜਿਉ ਹੋਵੈ ਸਾਹਿਬ ਸਿਉ ਮੇਲੁ ॥੩॥

ਘਰਿ ਘਰਿ ਏਹੋ ਪਾਹੁਚਾ ਸਦੜੇ ਨਿਤ ਪਵੰਨਿ ॥
ਸਦਣਹਾਰਾ ਸਿਮਰੀਐ ਨਾਨਕ ਸੇ ਦਿਹ ਆਵੰਨਿ ॥੪॥੧॥

ਰਾਗੁ ਆਸਾ ਮਹਲਾ ੧ ॥   
ਛਿਅ ਘਰ ਛਿਅ ਗੁਰ ਛਿਅ ਉਪਦੇਸ ॥
ਗੁਰੁ ਗੁਰੁ ਏਕੋ ਵੇਸ ਅਨੇਕ ॥੧॥
ਬਾਬਾ ਜੈ ਘਰਿ ਕਰਤੇ ਕੀਰਤਿ ਹੋਇ ॥
ਸੋ ਘਰੁ ਰਾਖੁ ਵਡਾਈ ਤੋਇ ॥੧॥ ਰਹਾਉ ॥
ਵਿਸੁਏ ਚਸਿਆ ਘੜੀਆ ਪਹਰਾ ਥਿਤੀ ਵਾਰੀ ਮਾਹੁ ਹੋਆ ॥
ਸੂਰਜੁ ਏਕੋ ਰੁਤਿ ਅਨੇਕ ॥
ਨਾਨਕ ਕਰਤੇ ਕੇ ਕੇਤੇ ਵੇਸ ॥੨॥੨॥

ਰਾਗੁ ਧਨਾਸਰੀ ਮਹਲਾ ੧ ॥
ਗਗਨ ਮੈ ਥਾਲੁ ਰਵਿ ਚੰਦੁ ਦੀਪਕ ਬਨੇ ਤਾਰਿਕਾ ਮੰਡਲ ਜਨਕ ਮੋਤੀ ॥
ਧੂਪੁ ਮਲਆਨਲੋ ਪਵਣੁ ਚਵਰੋ ਕਰੇ ਸਗਲ ਬਨਰਾਇ ਫੂਲੰਤ ਜੋਤੀ ॥੧॥

ਕੈਸੀ ਆਰਤੀ ਹੋਇ ॥
ਭਵ ਖੰਡਨਾ ਤੇਰੀ ਆਰਤੀ ॥
ਅਨਹਤਾ ਸਬਦ ਵਾਜੰਤ ਭੇਰੀ ॥੧॥ ਰਹਾਉ ॥

ਸਹਸ ਤਵ ਨੈਨ ਨਨ ਨੈਨ ਹਹਿ ਤੋਹਿ ਕਉ ਸਹਸ ਮੂਰਤਿ ਨਨਾ ਏਕ ਤੋੁਹੀ ॥
ਸਹਸ ਪਦ ਬਿਮਲ ਨਨ ਏਕ ਪਦ ਗੰਧ ਬਿਨੁ ਸਹਸ ਤਵ ਗੰਧ ਇਵ ਚਲਤ ਮੋਹੀ ॥੨॥

ਸਭ ਮਹਿ ਜੋਤਿ ਜੋਤਿ ਹੈ ਸੋਇ ॥
ਤਿਸ ਦੈ ਚਾਨਣਿ ਸਭ ਮਹਿ ਚਾਨਣੁ ਹੋਇ ॥
ਗੁਰ ਸਾਖੀ ਜੋਤਿ ਪਰਗਟੁ ਹੋਇ ॥
ਜੋ ਤਿਸੁ ਭਾਵੈ ਸੁ ਆਰਤੀ ਹੋਇ ॥੩॥
ਹਰਿ ਚਰਣ ਕਵਲ ਮਕਰੰਦ ਲੋਭਿਤ ਮਨੋ ਅਨਦਿਨਦ਼ ਮੋਹਿ ਆਹੀ ਪਿਆਸਾ ॥
ਕ੍ਰਿਪਾ ਜਲੁ ਦੇਹਿ ਨਾਨਕ ਸਾਰਿੰਗ ਕਉ ਹੋਇ ਜਾ ਤੇ ਤੇਰੈ ਨਾਇ ਵਾਸਾ ॥੪॥੩॥

ਰਾਗੁ ਗਉੜੀ ਪੂਰਬੀ ਮਹਲਾ ੪ ॥   
ਕਾਮਿ ਕਰੋਧਿ ਨਗਰੁ ਬਹੁ ਭਰਿਆ ਮਿਲਿ ਸਾਧੂ ਖੰਡਲ ਖੰਡਾ ਹੇ ॥
ਪੂਰਬਿ ਲਿਖਤ ਲਿਖੇ ਗੁਰੁ ਪਾਇਆ ਮਨਿ ਹਰਿ ਲਿਵ ਮੰਡਲ ਮੰਡਾ ਹੇ ॥੧॥

ਕਰਿ ਸਾਧੂ ਅੰਜੁਲੀ ਪੁਨੁ ਵਡਾ ਹੇ ॥
ਕਰਿ ਡੰਡਉਤ ਪੁਨੁ ਵਡਾ ਹੇ ॥੧॥ ਰਹਾਉ ॥

ਸਾਕਤ ਹਰਿ ਰਸ ਸਾਦੁ ਨ ਜਾਣਿਆ ਤਿਨ ਅੰਤਰਿ ਹਉਮੈ ਕੰਡਾ ਹੇ ॥
ਜਿਉ ਜਿਉ ਚਲਹਿ ਚੁਭੈ ਦੁਖੁ ਪਾਵਹਿ ਜਮਕਾਲੁ ਸਹਹਿ ਸਿਰਿ ਡੰਡਾ ਹੇ ॥੨॥

ਹਰਿ ਜਨ ਹਰਿ ਹਰਿ ਨਾਮਿ ਸਮਾਣੇ ਦੁਖੁ ਜਨਮ ਮਰਣ ਭਵ ਖੰਡਾ ਹੇ ॥
ਅਬਿਨਾਸੀ ਪੁਰਖੁ ਪਾਇਆ ਪਰਮੇਸਰੁ ਬਹੁ ਸੋਭ ਖੰਡ ਬ੍ਰਹਮੰਡਾ ਹੇ ॥੩॥

ਹਮ ਗਰੀਬ ਮਸਕੀਨ ਪ੍ਰਭ ਤੇਰੇ ਹਰਿ ਰਾਖੁ ਰਾਖੁ ਵਡ ਵਡਾ ਹੇ ॥
ਜਨ ਨਾਨਕ ਨਾਮੁ ਅਧਾਰੁ ਟੇਕ ਹੈ ਹਰਿ ਨਾਮੇ ਹੀ ਸੁਖੁ ਮੰਡਾ ਹੇ ॥੪॥੪॥

ਰਾਗੁ ਗਉੜੀ ਪੂਰਬੀ ਮਹਲਾ ੫ ॥    
ਕਰਉ ਬੇਨੰਤੀ ਸੁਣਹੁ ਮੇਰੇ ਮੀਤਾ ਸੰਤ ਟਹਲ ਕੀ ਬੇਲਾ ॥
ਈਹਾ ਖਾਟਿ ਚਲਹੁ ਹਰਿ ਲਾਹਾ ਆਗੈ ਬਸਨੁ ਸੁਹੇਲਾ ॥੧॥
ਅਉਧ ਘਟੈ ਦਿਨਸੁ ਰੈਣਾਰੇ ॥
ਮਨ ਗੁਰ ਮਿਲਿ ਕਾਜ ਸਵਾਰੇ ॥੧॥ ਰਹਾਉ ॥

ਇਹੁ ਸੰਸਾਰੁ ਬਿਕਾਰੁ ਸੰਸੇ ਮਹਿ ਤਰਿਓ ਬ੍ਰਹਮ ਗਿਆਨੀ ॥
ਜਿਸਹਿ ਜਗਾਇ ਪੀਆਵੈ ਇਹੁ ਰਸੁ ਅਕਥ ਕਥਾ ਤਿਨਿ ਜਾਨੀ ॥੨॥

ਜਾ ਕਉ ਆਏ ਸੋਈ ਬਿਹਾਝਹੁ ਹਰਿ ਗੁਰ ਤੇ ਮਨਹਿ ਬਸੇਰਾ ॥
ਨਿਜ ਘਰਿ ਮਹਲੁ ਪਾਵਹੁ ਸੁਖ ਸਹਜੇ ਬਹੁਰਿ ਨ ਹੋਇਗੋ ਫੇਰਾ ॥੩॥

ਅੰਤਰਜਾਮੀ ਪੁਰਖ ਬਿਧਾਤੇ ਸਰਧਾ ਮਨ ਕੀ ਪੂਰੇ ॥
ਨਾਨਕ ਦਾਸੁ ਇਹੈ ਸੁਖੁ ਮਾਗੈ ਮੋ ਕਉ ਕਰਿ ਸੰਤਨ ਕੀ ਧੂਰੇ ॥੪॥੫॥''';

  static const String tavParsadSavaiye = '''ੴ ਸਤਿਗੁਰ ਪ੍ਰਸਾਦਿ 
ਪਾਤਸਾਹੀ ॥੧੦॥
ਤ੍ਵਪ੍ਰਸਾਦਿ ॥ ਸ੍ਵੈਯੇ ॥

ਸ੍ਰਾਵਗ ਸੁਧ ਸਮੂਹ ਸਿਧਾਨ ਕੇ ਦੇਖਿ ਫਿਰਿਓ ਘਰਿ ਜੋਗਿ ਜਤੀ ਕੇ ॥
ਸੂਰ ਸੁਰਾਰਦਨ ਸੁਧ ਸੁਧਾਦਿਕ ਸੰਤ ਸਮੂਹ ਅਨੇਕ ਮਤੀ ਕੇ ॥
ਸਾਰੇ ਹੀ ਦੇਸ ਕੋ ਦੇਖਿ ਰਹਿਯੋ ਮਤ ਕੋਊ ਨ ਦੇਖੀਅਤ ਪ੍ਰਾਨ ਪਤੀ ਕੇ ॥
ਸ੍ਰੀ ਭਗਵਾਨ ਕੀ ਭਾਇ ਕ੍ਰਿਪਾ ਹੂੰ ਤੇ ਏਕ ਰਤੀ ਬਿਨੁ ਏਕ ਰਤੀ ਕੇ ॥੧॥੨੧॥

ਮਾਤੇ ਮਤੰਗ ਜਰੇ ਜਰ ਸੰਗਿ ਅਨੂਪ ਉਤੰਗ ਸੁਰੰਗ ਸਵਾਰੇ ॥
ਕੋਟਿ ਤੁਰੰਗ ਕੁਰੰਗ ਸੇ ਕੂਦਤ ਪਉਨ ਕੇ ਗਉਨ ਕੋ ਜਾਤ ਨਿਵਾਰੇ ॥
ਭਾਰੀ ਭੁਜਾਨ ਕੇ ਭੂਪ ਭਲੀ ਬਿਧਿ ਨਿਆਵਤ ਸੀਸ ਨ ਜਾਤ ਬਿਚਾਰੇ ॥
ਏਤੇ ਭਏ ਤੋ ਕਹਾ ਭਏ ਭੂਪਤਿ ਅੰਤ ਕੋ ਨਾਗੇ ਹੀ ਪਾਇ ਪਧਾਰੇ ॥੨॥੨੨॥

ਜੀਤ ਫਿਰੇ ਸਭ ਦੇਸ ਦਿਸਾਨ ਕੋ ਬਾਜਤ ਢੋਲ ਮ੍ਰਿਦੰਗ ਨਗਾਰੇ ॥
ਗੁੰਜਤ ਗੂੜ ਗਜਾਨ ਕੇ ਸੁੰਦਰ ਹਿੰਸਤ ਹੀ ਹਯ ਰਾਜ ਹਜਾਰੇ ॥
ਭੂਤ ਭਵਿਖ ਭਵਾਨ ਕੇ ਭੂਪਤਿ ਕਉਨ ਗਨੈ ਨਹੀ ਜਾਤ ਬਿਚਾਰੇ ॥
ਸ੍ਰੀਪਤਿ ਸ੍ਰੀ ਭਗਵਾਨ ਭਜੇ ਬਿਨੁ ਅੰਤ ਕੋ ਅੰਤ ਕੇ ਧਾਮ ਸਿਧਾਰੇ ॥੩॥੨੩॥

ਤੀਰਥ ਨ੍ਹਾਨ ਦਇਆ ਦਮ ਦਾਨ ਸੁ ਸੰਜਮ ਨੇਮ ਅਨੇਕ ਬਿਸੇਖੇ ॥
ਬੇਦ ਪੁਰਾਨ ਕਤੇਬ ਕੁਰਾਨ ਜਿਮੀਨ ਜਮਾਨ ਸਬਾਨ ਕੇ ਪੇਖੇ ॥
ਪਉਨ ਅਹਾਰ ਜਤੀ ਜਤ ਧਾਰਿ ਸਬੈ ਸੁ ਬਿਚਾਰ ਹਜਾਰਕ ਦੇਖੇ ॥
ਸ੍ਰੀ ਭਗਵਾਨ ਭਜੇ ਬਿਨੁ ਭੂਪਤਿ ਏਕ ਰਤੀ ਬਿਨੁ ਏਕ ਨ ਲੇਖੈ ॥੪॥੨੪॥

ਸੁਧ ਸਿਪਾਹ ਦੁਰੰਤ ਦੁਬਾਹ ਸੁ ਸਾਜਿ ਸਨਾਹ ਦੁਰਜਾਨ ਦਲੈਂਗੇ ॥
ਭਾਰੀ ਗੁਮਾਨ ਭਰੇ ਮਨ ਮੈ ਕਰਿ ਪਰਬਤ ਪੰਖ ਹਲੈ ਨ ਹਲੈਂਗੇ ॥
ਤੋਰਿ ਅਰੀਨ ਮਰੋਰਿ ਮਵਾਸਨ ਮਾਤੇ ਮਤੰਗਨ ਮਾਨ ਮਲੈਂਗੇ ॥
ਸ੍ਰੀਪਤਿ ਸ੍ਰੀ ਭਗਵਾਨ ਕ੍ਰਿਪਾ ਬਿਨੁ ਤਿਆਗਿ ਜਹਾਨੁ ਨਿਦਾਨ ਚਲੈਂਗੇ ॥੫॥੨੫॥

ਬੀਰ ਅਪਾਰ ਬਡੇ ਬਰਿਆਰ ਅਬਿਚਾਰਹਿ ਸਾਰ ਕੀ ਧਾਰ ਭਛਯਾ ॥
ਤੋਰਤ ਦੇਸ ਮਲਿੰਦ ਮਵਾਸਨ ਮਾਤੇ ਗਜਾਨ ਕੇ ਮਾਨ ਮਲਯਾ ॥
ਗਾੜੇ ਗੜਾਨ ਕੇ ਤੋੜਨਹਾਰ ਸੁ ਬਾਤਨ ਹੀ ਚਕ ਚਾਰ ਲਵਯਾ ॥
ਸਾਹਿਬੁ ਸ੍ਰੀ ਸਭ ਕੋ ਸਿਰਨਾਇਕ ਜਾਚਕ ਅਨੇਕ ਸੁ ਏਕ ਦਿਵਯਾ ॥੬॥੨੬॥

ਦਾਨਵ ਦੇਵ ਫਨਿੰਦ ਨਿਸਾਚਰ ਭੂਤ ਭਵਿਖ ਭਵਾਨ ਜਪੈਂਗੇ ॥
ਜੀਵ ਜਿਤੇ ਜਲ ਮੈ ਥਲ ਮੈ ਪਲ ਹੀ ਪਲ ਮੈ ਸਭ ਥਾਪ ਥਪੈਂਗੇ ॥
ਪੁੰਨ ਪ੍ਰਤਾਪਨ ਬਾਢਿ ਜੈਤ ਧੁਨਿ ਪਾਪਨ ਕੈ ਬਹੁ ਪੁੰਜ ਖਪੈਂਗੇ ॥
ਸਾਧ ਸਮੂਹ ਪ੍ਰਸੰਨ ਫਿਰੈ ਜਗਿ ਸਤ੍ਰ ਸਭੈ ਅਵਿਲੋਕਿ ਚਪੈਂਗੇ ॥੭॥੨੭॥

ਮਾਨਵ ਇੰਦ੍ਰ ਗਜਿੰਦ੍ਰ ਨਰਾਧਿਪ ਜੌਨ ਤ੍ਰਿਲੋਕ ਕੋ ਰਾਜੁ ਕਰੈਂਗੇ ॥
ਕੋਟਿ ਇਸਨਾਨ ਗਜਾਦਿਕ ਦਾਨਿ ਅਨੇਕ ਸੁਅੰਬਰ ਸਾਜਿ ਬਰੈਂਗੇ ॥
ਬ੍ਰਹਮ ਮਹੇਸੁਰ ਬਿਸਨੁ ਸਚੀਪਤਿ ਅੰਤਿ ਫਸੇ ਜਮ ਫਾਸਿ ਪਰੈਂਗੇ ॥
ਜੇ ਨਰ ਸ੍ਰੀਪਤਿ ਕੇ ਪ੍ਰਸ ਹੈਂ ਪਗ ਤੇ ਨਰ ਫੇਰਿ ਨ ਦੇਹ ਧਰੈਂਗੇ ॥੮॥੨੮॥

ਕਹਾ ਭਯੋ ਦੋਊ ਲੋਚਨ ਮੂੰਦ ਕੈ ਬੈਠਿ ਰਹਿਓ ਬਕ ਧ੍ਯਾਨ ਲਗਾਇਓ ॥
ਨ੍ਹਾਤ ਫਿਰਿਓ ਲੀਏ ਸਾਤ ਸਮੁੰਦ੍ਰਨ ਲੋਕ ਗਇਓ ਪਰਲੋਕ ਗਵਾਇਓ ॥
ਬਾਸੁ ਕੀਓ ਬਿਖਿਆਨ ਸੋ ਬੈਠ ਕੇ ਐਸੇ ਹੀ ਐਸ ਸੁ ਬੈਸ ਬਿਤਾਇਓ ॥
ਸਾਚੁ ਕਹੌ ਸੁਨ ਲੇਹੁ ਸਭੈ ਜਿਨ ਪ੍ਰੇਮ ਕੀਓ ਤਿਨ ਹੀ ਪ੍ਰਭੁ ਪਾਇਓ ॥੯॥੨੯॥

ਕਾਹੂੰ ਲੈ ਪਾਹਨ ਪੂਜ ਧਰਿਓ ਸਿਰਿ ਕਾਹੂੰ ਲੈ ਲਿੰਗੁ ਗਰੇ ਲਟਕਾਇਓ ॥
ਕਾਹੂੰ ਲਖਿਓ ਹਰਿ ਅਵਾਚੀ ਦਿਸਾ ਮਹਿ ਕਾਹੂੰ ਪਛਾਹ ਕੋ ਸੀਸ ਨਿਵਾਇਓ ॥
ਕੋਊ ਬੁਤਾਨ ਕੌ ਪੂਜਤ ਹੈ ਪਸੁ ਕੋਊ ਮ੍ਰਿਤਾਨ ਕੌ ਪੂਜਨ ਧਾਇਓ ॥
ਕੂਰ ਕ੍ਰਿਆ ਉਰਝਿਓ ਸਭ ਹੀ ਜਗੁ ਸ੍ਰੀ ਭਗਵਾਨ ਕੌ ਭੇਦੁ ਨ ਪਾਇਓ ॥੧੦॥੩੦॥''';

  static const String rehrasSahib = '''ਰਹਿਰਾਸ ਸਾਹਿਬ
ੴ ਸਤਿਗੁਰ ਪ੍ਰਸਾਦਿ
ਸਲੋਕੁ ਮਃ ੧ ॥

ਦੁਖੁ ਦਾਰੂ ਸੁਖੁ ਰੋਗੁ ਭਇਆ ਜਾ ਸੁਖੁ ਤਾਮਿ ਨ ਹੋਈ ॥
ਤੂੰ ਕਰਤਾ ਕਰਣਾ ਮੈ ਨਾਹੀ ਜਾ ਹਉ ਕਰੀ ਨ ਹੋਈ ॥੧॥

ਬਲਿਹਾਰੀ ਕੁਦਰਤਿ ਵਸਿਆ ॥
ਤੇਰਾ ਅੰਤੁ ਨ ਜਾਈ ਲਖਿਆ ॥੧॥ ਰਹਾਉ ॥

ਜਾਤਿ ਮਹਿ ਜੋਤਿ ਜੋਤਿ ਮਹਿ ਜਾਤਾ ਅਕਲ ਕਲਾ ਭਰਪੂਰਿ ਰਹਿਆ ॥
ਤੂੰ ਸਚਾ ਸਾਹਿਬੁ ਸਿਫਤਿ ਸੁਆਲ੍ਹ੍ਹਿਉ ਜਿਨਿ ਕੀਤੀ ਸੋ ਪਾਰਿ ਪਇਆ ॥
ਕਹੁ ਨਾਨਕ ਕਰਤੇ ਕੀਆ ਬਾਤਾ ਜੋ ਕਿਛੁ ਕਰਣਾ ਸੁ ਕਰਿ ਰਹਿਆ ॥੨॥

ਸੋ ਦਰੁ ਰਾਗੁ ਆਸਾ ਮਹਲਾ ੧
ੴ ਸਤਿਗੁਰ ਪ੍ਰਸਾਦਿ ॥ 
ਸੋ ਦਰੁ ਤੇਰਾ ਕੇਹਾ ਸੋ ਘਰੁ ਕੇਹਾ ਜਿਤੁ ਬਹਿ ਸਰਬ ਸਮਾਲੇ ॥
ਵਾਜੇ ਤੇਰੇ ਨਾਦ ਅਨੇਕ ਅਸੰਖਾ ਕੇਤੇ ਤੇਰੇ ਵਾਵਣਹਾਰੇ ॥
ਕੇਤੇ ਤੇਰੇ ਰਾਗ ਪਰੀ ਸਿਉ ਕਹੀਅਹਿ ਕੇਤੇ ਤੇਰੇ ਗਾਵਣਹਾਰੇ ॥
ਗਾਵਨਿ ਤੁਧਨੋ ਪਵਣੁ ਪਾਣੀ ਬੈਸੰਤਰੁ ਗਾਵੈ ਰਾਜਾ ਧਰਮੁ ਦੁਆਰੇ ॥
ਗਾਵਨਿ ਤੁਧਨੋ ਚਿਤੁ ਗੁਪਤੁ ਲਿਖਿ ਜਾਣਨਿ ਲਿਖਿ ਲਿਖਿ ਧਰਮੁ ਬੀਚਾਰੇ ॥

ਗਾਵਨਿ ਤੁਧਨੋ ਈਸਰੁ ਬ੍ਰਹਮਾ ਦੇਵੀ ਸੋਹਨਿ ਤੇਰੇ ਸਦਾ ਸਵਾਰੇ ॥
ਗਾਵਨਿ ਤੁਧਨੋ ਇੰਦ੍ਰ ਇੰਦ੍ਰਾਸਣਿ ਬੈਠੇ ਦੇਵਤਿਆ ਦਰਿ ਨਾਲੇ ॥
ਗਾਵਨਿ ਤੁਧਨੋ ਸਿਧ ਸਮਾਧੀ ਅੰਦਰਿ ਗਾਵਨਿ ਤੁਧਨੋ ਸਾਧ ਬੀਚਾਰੇ ॥
ਗਾਵਨਿ ਤੁਧਨੋ ਜਤੀ ਸਤੀ ਸੰਤੋਖੀ ਗਾਵਨਿ ਤੁਧਨੋ ਵੀਰ ਕਰਾਰੇ ॥
ਗਾਵਨਿ ਤੁਧਨੋ ਪੰਡਿਤ ਪੜਨਿ ਰਖੀਸੁਰ ਜੁਗੁ ਜੁਗੁ ਵੇਦਾ ਨਾਲੇ ॥

ਗਾਵਨਿ ਤੁਧਨੋ ਮੋਹਣੀਆ ਮਨੁ ਮੋਹਨਿ ਸੁਰਗੁ ਮਛੁ ਪਇਆਲੇ ॥
ਗਾਵਨਿ ਤੁਧਨੋ ਰਤਨ ਉਪਾਏ ਤੇਰੇ ਅਠਸਠਿ ਤੀਰਥ ਨਾਲੇ ॥
ਗਾਵਨਿ ਤੁਧਨੋ ਜੋਧ ਮਹਾਬਲ ਸੂਰਾ ਗਾਵਨਿ ਤੁਧਨੋ ਖਾਣੀ ਚਾਰੇ ॥
ਗਾਵਨਿ ਤੁਧਨੋ ਖੰਡ ਮੰਡਲ ਬ੍ਰਹਮੰਡਾ ਕਰਿ ਕਰਿ ਰਖੇ ਤੇਰੇ ਧਾਰੇ ॥

ਸੇਈ ਤੁਧਨੋ ਗਾਵਨਿ ਜੋ ਤੁਧੁ ਭਾਵਨਿ ਰਤੇ ਤੇਰੇ ਭਗਤ ਰਸਾਲੇ ॥
ਹੋਰਿ ਕੇਤੇ ਤੁਧਨੋ ਗਾਵਨਿ ਸੇ ਮੈ ਚਿਤਿ ਨ ਆਵਨਿ ਨਾਨਕੁ ਕਿਆ ਬੀਚਾਰੇ ॥
ਸੋਈ ਸੋਈ ਸਦਾ ਸਚੁ ਸਾਹਿਬੁ ਸਾਚਾ ਸਾਚੀ ਨਾਈ ॥
ਹੈ ਭੀ ਹੋਸੀ ਜਾਇ ਨ ਜਾਸੀ ਰਚਨਾ ਜਿਨਿ ਰਚਾਈ ॥

ਰੰਗੀ ਰੰਗੀ ਭਾਤੀ ਕਰਿ ਕਰਿ ਜਿਨਸੀ ਮਾਇਆ ਜਿਨਿ ਉਪਾਈ ॥
ਕਰਿ ਕਰਿ ਦੇਖੈ ਕੀਤਾ ਆਪਣਾ ਜਿਉ ਤਿਸ ਦੀ ਵਡਿਆਈ ॥
ਜੋ ਤਿਸੁ ਭਾਵੈ ਸੋਈ ਕਰਸੀ ਫਿਰਿ ਹੁਕਮੁ ਨ ਕਰਣਾ ਜਾਈ ॥
ਸੋ ਪਾਤਿਸਾਹੁ ਸਾਹਾ ਪਤਿਸਾਹਿਬੁ ਨਾਨਕ ਰਹਣੁ ਰਜਾਈ ॥੧॥

ਆਸਾ ਮਹਲਾ ੧ ॥
ਸੁਣਿ ਵਡਾ ਆਖੈ ਸਭੁ ਕੋਇ ॥
ਕੇਵਡੁ ਵਡਾ ਡੀਠਾ ਹੋਇ ॥
ਕੀਮਤਿ ਪਾਇ ਨ ਕਹਿਆ ਜਾਇ ॥
ਕਹਣੈ ਵਾਲੇ ਤੇਰੇ ਰਹੇ ਸਮਾਇ ॥੧॥

ਵਡੇ ਮੇਰੇ ਸਾਹਿਬਾ ਗਹਿਰ ਗੰਭੀਰਾ ਗੁਣੀ ਗਹੀਰਾ ॥
ਕੋਇ ਨ ਜਾਣੈ ਤੇਰਾ ਕੇਤਾ ਕੇਵਡੁ ਚੀਰਾ ॥੧॥ ਰਹਾਉ ॥

ਸਭਿ ਸੁਰਤੀ ਮਿਲਿ ਸੁਰਤਿ ਕਮਾਈ ॥
ਸਭ ਕੀਮਤਿ ਮਿਲਿ ਕੀਮਤਿ ਪਾਈ ॥
ਗਿਆਨੀ ਧਿਆਨੀ ਗੁਰ ਗੁਰਹਾਈ ॥
ਕਹਣੁ ਨ ਜਾਈ ਤੇਰੀ ਤਿਲੁ ਵਡਿਆਈ ॥੨॥

ਸਭਿ ਸਤ ਸਭਿ ਤਪ ਸਭਿ ਚੰਗਿਆਈਆ ॥
ਸਿਧਾ ਪੁਰਖਾ ਕੀਆ ਵਡਿਆਈਆ ॥
ਤੁਧੁ ਵਿਣੁ ਸਿਧੀ ਕਿਨੈ ਨ ਪਾਈਆ ॥
ਕਰਮਿ ਮਿਲੈ ਨਾਹੀ ਠਾਕਿ ਰਹਾਈਆ ॥੩॥

ਆਖਣ ਵਾਲਾ ਕਿਆ ਵੇਚਾਰਾ ॥
ਸਿਫਤੀ ਭਰੇ ਤੇਰੇ ਭੰਡਾਰਾ ॥
ਜਿਸੁ ਤੂ ਦੇਹਿ ਤਿਸੈ ਕਿਆ ਚਾਰਾ ॥
ਨਾਨਕ ਸਚੁ ਸਵਾਰਣਹਾਰਾ ॥੪॥੨॥

ਆਸਾ ਮਹਲਾ ੧ ॥
ਆਖਾ ਜੀਵਾ ਵਿਸਰੈ ਮਰਿ ਜਾਉ ॥
ਆਖਣਿ ਅਉਖਾ ਸਾਚਾ ਨਾਉ ॥
ਸਾਚੇ ਨਾਮ ਕੀ ਲਾਗੈ ਭੂਖ ॥
ਉਤੁ ਭੂਖੈ ਖਾਇ ਚਲੀਅਹਿ ਦੂਖ ॥੧॥

ਸੋ ਕਿਉ ਵਿਸਰੈ ਮੇਰੀ ਮਾਇ ॥
ਸਾਚਾ ਸਾਹਿਬੁ ਸਾਚੈ ਨਾਇ ॥੧॥ ਰਹਾਉ ॥

ਸਾਚੇ ਨਾਮ ਕੀ ਤਿਲੁ ਵਡਿਆਈ ॥
ਆਖਿ ਥਕੇ ਕੀਮਤਿ ਨਹੀ ਪਾਈ ॥
ਜੇ ਸਭਿ ਮਿਲਿ ਕੈ ਆਖਣ ਪਾਹਿ ॥
ਵਡਾ ਨ ਹੋਵੈ ਘਾਟਿ ਨ ਜਾਇ ॥੨॥

ਨਾ ਓਹੁ ਮਰੈ ਨ ਹੋਵੈ ਸੋਗੁ ॥
ਦੇਦਾ ਰਹੈ ਨ ਚੂਕੈ ਭੋਗੁ ॥
ਗੁਣੁ ਏਹੋ ਹੋਰੁ ਨਾਹੀ ਕੋਇ ॥
ਨਾ ਕੋ ਹੋਆ ਨਾ ਕੋ ਹੋਇ ॥੩॥

ਜੇਵਡੁ ਆਪਿ ਤੇਵਡ ਤੇਰੀ ਦਾਤਿ ॥
ਜਿਨਿ ਦਿਨੁ ਕਰਿ ਕੈ ਕੀਤੀ ਰਾਤਿ ॥
ਖਸਮੁ ਵਿਸਾਰਹਿ ਤੇ ਕਮਜਾਤਿ ॥
ਨਾਨਕ ਨਾਵੈ ਬਾਝੁ ਸਨਾਤਿ ॥੪॥੩॥

ਰਾਗੁ ਗੂਜਰੀ ਮਹਲਾ ੪ ॥
ਹਰਿ ਕੇ ਜਨ ਸਤਿਗੁਰ ਸਤਪੁਰਖਾ ਬਿਨਉ ਕਰਉ ਗੁਰ ਪਾਸਿ ॥
ਹਮ ਕੀਰੇ ਕਿਰਮ ਸਤਿਗੁਰ ਸਰਣਾਈ ਕਰਿ ਦਇਆ ਨਾਮੁ ਪਰਗਾਸਿ ॥੧॥

ਮੇਰੇ ਮੀਤ ਗੁਰਦੇਵ ਮੋ ਕਉ ਰਾਮ ਨਾਮੁ ਪਰਗਾਸਿ ॥
ਗੁਰਮਤਿ ਨਾਮੁ ਮੇਰਾ ਪ੍ਰਾਨ ਸਖਾਈ ਹਰਿ ਕੀਰਤਿ ਹਮਰੀ ਰਹਰਾਸਿ ॥੧॥ ਰਹਾਉ ॥

ਹਰਿ ਜਨ ਕੇ ਵਡ ਭਾਗ ਵਡੇਰੇ ਜਿਨ ਹਰਿ ਹਰਿ ਸਰਧਾ ਹਰਿ ਪਿਆਸ ॥
ਹਰਿ ਹਰਿ ਨਾਮੁ ਮਿਲੈ ਤ੍ਰਿਪਤਾਸਹਿ ਮਿਲਿ ਸੰਗਤਿ ਗੁਣ ਪਰਗਾਸਿ ॥੨॥

ਜਿਨ ਹਰਿ ਹਰਿ ਹਰਿ ਰਸੁ ਨਾਮੁ ਨ ਪਾਇਆ ਤੇ ਭਾਗਹੀਣ ਜਮ ਪਾਸਿ ॥
ਜੋ ਸਤਿਗੁਰ ਸਰਣਿ ਸੰਗਤਿ ਨਹੀ ਆਏ ਧ੍ਰਿਗੁ ਜੀਵੇ ਧ੍ਰਿਗੁ ਜੀਵਾਸਿ ॥੩॥

ਜਿਨ ਹਰਿ ਜਨ ਸਤਿਗੁਰ ਸੰਗਤਿ ਪਾਈ ਤਿਨ ਧੁਰਿ ਮਸਤਕਿ ਲਿਖਿਆ ਲਿਖਾਸਿ ॥
ਧਨੁ ਧੰਨੁ ਸਤਸੰਗਤਿ ਜਿਤੁ ਹਰਿ ਰਸੁ ਪਾਇਆ ਮਿਲਿ ਜਨ ਨਾਨਕ ਨਾਮੁ ਪਰਗਾਸਿ ॥੪॥੪॥

ਰਾਗੁ ਗੂਜਰੀ ਮਹਲਾ ੫ ॥
ਕਾਹੇ ਰੇ ਮਨ ਚਿਤਵਹਿ ਉਦਮੁ ਜਾ ਆਹਰਿ ਹਰਿ ਜੀਉ ਪਰਿਆ ॥
ਸੈਲ ਪਥਰ ਮਹਿ ਜੰਤ ਉਪਾਏ ਤਾ ਕਾ ਰਿਜਕੁ ਆਗੈ ਕਰਿ ਧਰਿਆ ॥੧॥

ਮੇਰੇ ਮਾਧਉ ਜੀ ਸਤਸੰਗਤਿ ਮਿਲੇ ਸੁ ਤਰਿਆ ॥
ਗੁਰ ਪਰਸਾਦਿ ਪਰਮ ਪਦੁ ਪਾਇਆ ਸੂਕੇ ਕਾਸਟ ਹਰਿਆ ॥੧॥ ਰਹਾਉ ॥

ਜਨਨਿ ਪਿਤਾ ਲੋਕ ਸੁਤ ਬਨਿਤਾ ਕੋਇ ਨ ਕਿਸ ਕੀ ਧਰਿਆ ॥
ਸਿਰਿ ਸਿਰਿ ਰਿਜਕੁ ਸੰਬਾਹੇ ਠਾਕੁਰੁ ਕਾਹੇ ਮਨ ਭਉ ਕਰਿਆ ॥੨॥

ਊਡੇ ਊਡਿ ਆਵੈ ਸੈ ਕੋਸਾ ਤਿਸੁ ਪਾਛੈ ਬਚਰੇ ਛਰਿਆ ॥
ਤਿਨ ਕਵਣੁ ਖਲਾਵੈ ਕਵਣੁ ਚੁਗਾਵੈ ਮਨ ਮਹਿ ਸਿਮਰਨੁ ਕਰਿਆ ॥੩॥

ਸਭਿ ਨਿਧਾਨ ਦਸ ਅਸਟ ਸਿਧਾਨ ਠਾਕੁਰ ਕਰ ਤਲ ਧਰਿਆ ॥
ਜਨ ਨਾਨਕ ਬਲਿ ਬਲਿ ਸਦ ਬਲਿ ਜਾਈਐ ਤੇਰਾ ਅੰਤੁ ਨ ਪਾਰਾਵਰਿਆ ॥੪॥੫॥

ਰਾਗੁ ਆਸਾ ਮਹਲਾ ੪ ਸੋ ਪੁਰਖੁ
ੴ ਸਤਿਗੁਰ ਪ੍ਰਸਾਦਿ ॥
ਸੋ ਪੁਰਖੁ ਨਿਰੰਜਨੁ ਹਰਿ ਪੁਰਖੁ ਨਿਰੰਜਨੁ ਹਰਿ ਅਗਮਾ ਅਗਮ ਅਪਾਰਾ ॥
ਸਭਿ ਧਿਆਵਹਿ ਸਭਿ ਧਿਆਵਹਿ ਤੁਧੁ ਜੀ ਹਰਿ ਸਚੇ ਸਿਰਜਣਹਾਰਾ ॥
ਸਭਿ ਜੀਅ ਤੁਮਾਰੇ ਜੀ ਤੂੰ ਜੀਆ ਕਾ ਦਾਤਾਰਾ ॥
ਹਰਿ ਧਿਆਵਹੁ ਸੰਤਹੁ ਜੀ ਸਭਿ ਦੂਖ ਵਿਸਾਰਣਹਾਰਾ ॥
ਹਰਿ ਆਪੇ ਠਾਕੁਰੁ ਹਰਿ ਆਪੇ ਸੇਵਕੁ ਜੀ ਕਿਆ ਨਾਨਕ ਜੰਤ ਵਿਚਾਰਾ ॥੧॥

ਤੂੰ ਘਟ ਘਟ ਅੰਤਰਿ ਸਰਬ ਨਿਰੰਤਰਿ ਜੀ ਹਰਿ ਏਕੋ ਪੁਰਖੁ ਸਮਾਣਾ ॥
ਇਕਿ ਦਾਤੇ ਇਕਿ ਭੇਖਾਰੀ ਜੀ ਸਭਿ ਤੇਰੇ ਚੋਜ ਵਿਡਾਣਾ ॥
ਤੂੰ ਆਪੇ ਦਾਤਾ ਆਪੇ ਭੁਗਤਾ ਜੀ ਹਉ ਤੁਧੁ ਬਿਨੁ ਅਵਰੁ ਨ ਜਾਣਾ ॥
ਤੂੰ ਪਾਰਬ੍ਰਹਮੁ ਬੇਅੰਤੁ ਬੇਅੰਤੁ ਜੀ ਤੇਰੇ ਕਿਆ ਗੁਣ ਆਖਿ ਵਖਾਣਾ ॥
ਜੋ ਸੇਵਹਿ ਜੋ ਸੇਵਹਿ ਤੁਧੁ ਜੀ ਜਨੁ ਨਾਨਕੁ ਤਿਨ ਕੁਰਬਾਣਾ ॥੨॥

ਹਰਿ ਧਿਆਵਹਿ ਹਰਿ ਧਿਆਵਹਿ ਤੁਧੁ ਜੀ ਸੇ ਜਨ ਜੁਗ ਮਹਿ ਸੁਖਵਾਸੀ ॥
ਸੇ ਮੁਕਤੁ ਸੇ ਮੁਕਤੁ ਭਏ ਜਿਨ ਹਰਿ ਧਿਆਇਆ ਜੀ ਤਿਨ ਤੂਟੀ ਜਮ ਕੀ ਫਾਸੀ ॥
ਜਿਨ ਨਿਰਭਉ ਜਿਨ ਹਰਿ ਨਿਰਭਉ ਧਿਆਇਆ ਜੀ ਤਿਨ ਕਾ ਭਉ ਸਭੁ ਗਵਾਸੀ ॥
ਜਿਨ ਸੇਵਿਆ ਜਿਨ ਸੇਵਿਆ ਮੇਰਾ ਹਰਿ ਜੀ ਤੇ ਹਰਿ ਹਰਿ ਰੂਪਿ ਸਮਾਸੀ ॥
ਸੇ ਧੰਨੁ ਸੇ ਧੰਨੁ ਜਿਨ ਹਰਿ ਧਿਆਇਆ ਜੀ ਜਨੁ ਨਾਨਕੁ ਤਿਨ ਬਲਿ ਜਾਸੀ ॥੩॥

ਤੇਰੀ ਭਗਤਿ ਤੇਰੀ ਭਗਤਿ ਭੰਡਾਰ ਜੀ ਭਰੇ ਬਿਅੰਤ ਬੇਅੰਤਾ ॥
ਤੇਰੇ ਭਗਤ ਤੇਰੇ ਭਗਤ ਸਲਾਹਨਿ ਤੁਧੁ ਜੀ ਹਰਿ ਅਨਿਕ ਅਨੇਕ ਅਨੰਤਾ ॥
ਤੇਰੀ ਅਨਿਕ ਤੇਰੀ ਅਨਿਕ ਕਰਹਿ ਹਰਿ ਪੂਜਾ ਜੀ ਤਪੁ ਤਾਪਹਿ ਜਪਹਿ ਬੇਅੰਤਾ ॥
ਤੇਰੇ ਅਨੇਕ ਤੇਰੇ ਅਨੇਕ ਪੜਹਿ ਬਹੁ ਸਿਮ੍ਰਿਤਿ ਸਾਸਤ ਜੀ ਕਰਿ ਕਿਰਿਆ ਖਟੁ ਕਰਮ ਕਰੰਤਾ ॥
ਸੇ ਭਗਤ ਸੇ ਭਗਤ ਭਲੇ ਜਨ ਨਾਨਕ ਜੀ ਜੋ ਭਾਵਹਿ ਮੇਰੇ ਹਰਿ ਭਗਵੰਤਾ ॥੪॥

ਤੂੰ ਆਦਿ ਪੁਰਖੁ ਅਪਰੰਪਰੁ ਕਰਤਾ ਜੀ ਤੁਧੁ ਜੇਵਡੁ ਅਵਰੁ ਨ ਕੋਈ ॥
ਤੂੰ ਜੁਗੁ ਜੁਗੁ ਏਕੋ ਸਦਾ ਸਦਾ ਤੂੰ ਏਕੋ ਜੀ ਤੂੰ ਨਿਹਚਲੁ ਕਰਤਾ ਸੋਈ ॥
ਤੁਧੁ ਆਪੇ ਭਾਵੈ ਸੋਈ ਵਰਤੈ ਜੀ ਤੂੰ ਆਪੇ ਕਰਹਿ ਸੁ ਹੋਈ ॥
ਤੁਧੁ ਆਪੇ ਸ੍ਰਿਸਟਿ ਸਭ ਉਪਾਈ ਜੀ ਤੁਧੁ ਆਪੇ ਸਿਰਜਿ ਸਭ ਗੋਈ ॥
ਜਨੁ ਨਾਨਕੁ ਗੁਣ ਗਾਵੈ ਕਰਤੇ ਕੇ ਜੀ ਜੋ ਸਭਸੈ ਕਾ ਜਾਣੋਈ ॥੫॥੧॥

ਆਸਾ ਮਹਲਾ ੪ ॥
ਤੂੰ ਕਰਤਾ ਸਚਿਆਰੁ ਮੈਡਾ ਸਾਂਈ ॥
ਜੋ ਤਉ ਭਾਵੈ ਸੋਈ ਥੀਸੀ ਜੋ ਤੂੰ ਦੇਹਿ ਸੋਈ ਹਉ ਪਾਈ ॥੧॥ ਰਹਾਉ ॥

ਸਭ ਤੇਰੀ ਤੂੰ ਸਭਨੀ ਧਿਆਇਆ ॥
ਜਿਸ ਨੋ ਕ੍ਰਿਪਾ ਕਰਹਿ ਤਿਨਿ ਨਾਮ ਰਤਨੁ ਪਾਇਆ ॥
ਗੁਰਮੁਖਿ ਲਾਧਾ ਮਨਮੁਖਿ ਗਵਾਇਆ ॥
ਤੁਧੁ ਆਪਿ ਵਿਛੋੜਿਆ ਆਪਿ ਮਿਲਾਇਆ ॥੧॥

ਤੂੰ ਦਰੀਆਉ ਸਭ ਤੁਝ ਹੀ ਮਾਹਿ ॥
ਤੁਝ ਬਿਨੁ ਦੂਜਾ ਕੋਈ ਨਾਹਿ ॥
ਜੀਅ ਜੰਤ ਸਭਿ ਤੇਰਾ ਖੇਲੁ ॥
ਵਿਜੋਗਿ ਮਿਲਿ ਵਿਛੁੜਿਆ ਸੰਜੋਗੀ ਮੇਲੁ ॥੨॥

ਜਿਸ ਨੋ ਤੂ ਜਾਣਾਇਹਿ ਸੋਈ ਜਨੁ ਜਾਣੈ ॥
ਹਰਿ ਗੁਣ ਸਦ ਹੀ ਆਖਿ ਵਖਾਣੈ ॥
ਜਿਨਿ ਹਰਿ ਸੇਵਿਆ ਤਿਨਿ ਸੁਖੁ ਪਾਇਆ ॥
ਸਹਜੇ ਹੀ ਹਰਿ ਨਾਮਿ ਸਮਾਇਆ ॥੩॥

ਤੂ ਆਪੇ ਕਰਤਾ ਤੇਰਾ ਕੀਆ ਸਭੁ ਹੋਇ ॥
ਤੁਧੁ ਬਿਨੁ ਦੂਜਾ ਅਵਰੁ ਨ ਕੋਇ ॥
ਤੂ ਕਰਿ ਕਰਿ ਵੇਖਹਿ ਜਾਣਹਿ ਸੋਇ ॥
ਜਨ ਨਾਨਕ ਗੁਰਮੁਖਿ ਪਰਗਟੁ ਹੋਇ ॥੪॥੨॥

ਆਸਾ ਮਹਲਾ ੧ ॥
ਤਿਤੁ ਸਰਵਰੜੈ ਭਈਲੇ ਨਿਵਾਸਾ ਪਾਣੀ ਪਾਵਕੁ ਤਿਨਹਿ ਕੀਆ ॥
ਪੰਕਜੁ ਮੋਹ ਪਗੁ ਨਹੀ ਚਾਲੈ ਹਮ ਦੇਖਾ ਤਹ ਡੂਬੀਅਲੇ ॥੧॥

ਮਨ ਏਕੁ ਨ ਚੇਤਸਿ ਮੂੜ ਮਨਾ ॥
ਹਰਿ ਬਿਸਰਤ ਤੇਰੇ ਗੁਣ ਗਲਿਆ ॥੧॥ ਰਹਾਉ ॥

ਨਾ ਹਉ ਜਤੀ ਸਤੀ ਨਹੀ ਪੜਿਆ ਮੂਰਖ ਮੁਗਧਾ ਜਨਮੁ ਭਇਆ ॥
ਪ੍ਰਣਵਤਿ ਨਾਨਕ ਤਿਨ ਕੀ ਸਰਣਾ ਜਿਨ ਤੂ ਨਾਹੀ ਵੀਸਰਿਆ ॥੨॥੩॥

ਆਸਾ ਮਹਲਾ ੫ ॥
ਭਈ ਪਰਾਪਤਿ ਮਾਨੁਖ ਦੇਹੁਰੀਆ ॥
ਗੋਬਿੰਦ ਮਿਲਣ ਕੀ ਇਹ ਤੇਰੀ ਬਰੀਆ ॥
ਅਵਰਿ ਕਾਜ ਤੇਰੈ ਕਿਤੈ ਨ ਕਾਮ ॥
ਮਿਲੁ ਸਾਧਸੰਗਤਿ ਭਜੁ ਕੇਵਲ ਨਾਮ ॥੧॥

ਸਰੰਜਾਮਿ ਲਾਗੁ ਭਵਜਲ ਤਰਨ ਕੈ ॥
ਜਨਮੁ ਬ੍ਰਿਥਾ ਜਾਤ ਰੰਗਿ ਮਾਇਆ ਕੈ ॥੧॥ ਰਹਾਉ ॥

ਜਪੁ ਤਪੁ ਸੰਜਮੁ ਧਰਮੁ ਨ ਕਮਾਇਆ ॥
ਸੇਵਾ ਸਾਧ ਨ ਜਾਨਿਆ ਹਰਿ ਰਾਇਆ ॥
ਕਹੁ ਨਾਨਕ ਹਮ ਨੀਚ ਕਰੰਮਾ ॥
ਸਰਣਿ ਪਰੇ ਕੀ ਰਾਖਹੁ ਸਰਮਾ ॥੨॥੪॥

ਕਬ੍ਯੋ ਬਾਚ ਬੇਨਤੀ ॥
ਚੌਪਈ ॥
ਹਮਰੀ ਕਰੋ ਹਾਥ ਦੈ ਰਛਾ ॥
ਪੂਰਨ ਹੋਇ ਚਿਤ ਕੀ ਇਛਾ ॥
ਤਵ ਚਰਨਨ ਮਨ ਰਹੈ ਹਮਾਰਾ ॥
ਅਪਨਾ ਜਾਨ ਕਰੋ ਪ੍ਰਤਿਪਾਰਾ ॥੧॥

ਹਮਰੇ ਦੁਸਟ ਸਭੈ ਤੁਮ ਘਾਵਹੁ ॥
ਆਪੁ ਹਾਥ ਦੈ ਮੋਹਿ ਬਚਾਵਹੁ ॥
ਸੁਖੀ ਬਸੈ ਮੋਰੋ ਪਰਿਵਾਰਾ ॥
ਸੇਵਕ ਸਿਖ੍ਯ ਸਭੈ ਕਰਤਾਰਾ ॥੨॥

ਮੋ ਰਛਾ ਨਿਜੁ ਕਰ ਦੈ ਕਰਿਯੈ ॥
ਸਭ ਬੈਰਿਨ ਕੌ ਆਜ ਸੰਘਰਿਯੈ ॥
ਪੂਰਨ ਹੋਇ ਹਮਾਰੀ ਆਸਾ ॥
ਤੋਰਿ ਭਜਨ ਕੀ ਰਹੈ ਪਿਯਾਸਾ ॥੩॥

ਤੁਮਹਿ ਛਾਡਿ ਕੋਈ ਅਵਰ ਨ ਧ੍ਯਾਊ ॥
ਜੋ ਬਰ ਚਾਹੌ ਸੁ ਤੁਮ ਤੇ ਪਾਊ ॥
ਸੇਵਕ ਸਿੱਖ੍ਯ ਹਮਾਰੇ ਤਾਰਿਯਹਿ ॥
ਚੁਨ ਚੁਨ ਸਤ੍ਰੁ ਹਮਾਰੇ ਮਾਰਿਯਹਿ ॥੪॥

ਆਪੁ ਹਾਥ ਦੈ ਮੁਝੈ ਉਬਰਿਯੈ ॥
ਮਰਨ ਕਾਲ ਕਾ ਤ੍ਰਾਸ ਨਿਵਰਿਯੈ ॥
ਹੂਜੋ ਸਦਾ ਹਮਾਰੇ ਪਛਾ ॥
ਸ੍ਰੀ ਅਸਿਧੁਜ ਜੂ ਕਰਿਯਹੁ ਰਛਾ ॥੫॥

ਰਾਖਿ ਲੇਹੁ ਮੁਹਿ ਰਾਖਨਹਾਰੇ ॥
ਸਾਹਿਬ ਸੰਤ ਸਹਾਇ ਪਿਯਾਰੇ ॥
ਦੀਨਬੰਧੁ ਦੁਸਟਨ ਕੇ ਹੰਤਾ ॥
ਤੁਮ ਹੋ ਪੁਰੀ ਚਤੁਰਦਸ ਕੰਤਾ ॥੬॥

ਕਾਲ ਪਾਇ ਬ੍ਰਹਮਾ ਬਪੁ ਧਰਾ ॥
ਕਾਲ ਪਾਇ ਸਿਵ ਜੂ ਅਵਤਰਾ ॥
ਕਾਲ ਪਾਇ ਕਰਿ ਬਿਸਨ ਪ੍ਰਕਾਸਾ ॥
ਸਕਲ ਕਾਲ ਕਾ ਕੀਯਾ ਤਮਾਸਾ ॥੭॥

ਜਵਨ ਕਾਲ ਜੋਗੀ ਸਿਵ ਕੀਯੋ ॥
ਬੇਦ ਰਾਜ ਬ੍ਰਹਮਾ ਜੂ ਥੀਯੋ ॥
ਜਵਨ ਕਾਲ ਸਭ ਲੋਕ ਸਵਾਰਾ ॥
ਨਮਸਕਾਰ ਹੈ ਤਾਹਿ ਹਮਾਰਾ ॥੮॥

ਜਵਨ ਕਾਲ ਸਭ ਜਗਤ ਬਨਾਯੋ ॥
ਦੇਵ ਦੈਤ ਜਛਨ ਉਪਜਾਯੋ ॥
ਆਦਿ ਅੰਤਿ ਏਕੈ ਅਵਤਾਰਾ ॥
ਸੋਈ ਗੁਰੂ ਸਮਝਿਯਹੁ ਹਮਾਰਾ ॥੯॥

ਨਮਸਕਾਰ ਤਿਸ ਹੀ ਕੋ ਹਮਾਰੀ ॥
ਸਕਲ ਪ੍ਰਜਾ ਜਿਨ ਆਪ ਸਵਾਰੀ ॥
ਸਿਵਕਨ ਕੋ ਸਿਵਗੁਨ ਸੁਖ ਦੀਯੋ ॥
ਸਤ੍ਰੁਨ ਕੋ ਪਲ ਮੋ ਬਧ ਕੀਯੋ ॥੧੦॥

ਘਟ ਘਟ ਕੇ ਅੰਤਰ ਕੀ ਜਾਨਤ ॥
ਭਲੇ ਬੁਰੇ ਕੀ ਪੀਰ ਪਛਾਨਤ ॥
ਚੀਟੀ ਤੇ ਕੁੰਚਰ ਅਸਥੂਲਾ ॥
ਸਭ ਪਰ ਕ੍ਰਿਪਾ ਦ੍ਰਿਸਟਿ ਕਰਿ ਫੂਲਾ ॥੧੧॥

ਸੰਤਨ ਦੁਖ ਪਾਏ ਤੇ ਦੁਖੀ ॥
ਸੁਖ ਪਾਏ ਸਾਧਨ ਕੇ ਸੁਖੀ ॥
ਏਕ ਏਕ ਕੀ ਪੀਰ ਪਛਾਨੈ ॥
ਘਟ ਘਟ ਕੇ ਪਟ ਪਟ ਕੀ ਜਾਨੈ ॥੧੨॥

ਜਬ ਉਦਕਰਖ ਕਰਾ ਕਰਤਾਰਾ ॥
ਪ੍ਰਜਾ ਧਰਤ ਤਬ ਦੇਹ ਅਪਾਰਾ ॥
ਜਬ ਆਕਰਖ ਕਰਤ ਹੋ ਕਬਹੂੰ ॥
ਤੁਮ ਮੈ ਮਿਲਤ ਦੇਹ ਧਰ ਸਭਹੂੰ ॥੧੩॥

ਜੇਤੇ ਬਦਨ ਸ੍ਰਿਸਟਿ ਸਭ ਧਾਰੈ ॥
ਆਪੁ ਆਪੁਨੀ ਬੂਝਿ ਉਚਾਰੈ ॥
ਤੁਮ ਸਭ ਹੀ ਤੇ ਰਹਤ ਨਿਰਾਲਮ ॥
ਜਾਨਤ ਬੇਦ ਭੇਦ ਅਰੁ ਆਲਮ ॥੧੪॥

ਨਿਰੰਕਾਰ ਨ੍ਰਿਬਿਕਾਰ ਨ੍ਰਿਲੰਭ ॥
ਆਦਿ ਅਨੀਲ ਅਨਾਦਿ ਅਸੰਭ ॥
ਤਾ ਕਾ ਮੂੜ ਉਚਾਰਤ ਭੇਦਾ ॥
ਜਾ ਕੋ ਭੇਵ ਨ ਪਾਵਤ ਬੇਦਾ ॥੧੫॥

ਤਾ ਕੌ ਕਰਿ ਪਾਹਨ ਅਨੁਮਾਨਤ ॥
ਮਹਾ ਮੂੜ ਕਛੁ ਭੇਦ ਨ ਜਾਨਤ ॥
ਮਹਾਦੇਵ ਕੌ ਕਹਤ ਸਦਾ ਸਿਵ ॥
ਨਿਰੰਕਾਰ ਕਾ ਚੀਨਤ ਨਹਿ ਭਿਵ ॥੧੬॥

ਆਪੁ ਆਪੁਨੀ ਬੁਧਿ ਹੈ ਜੇਤੀ ॥
ਬਰਨਤ ਭਿੰਨ ਭਿੰਨ ਤੁਹਿ ਤੇਤੀ ॥
ਤੁਮਰਾ ਲਖਾ ਨ ਜਾਇ ਪਸਾਰਾ ॥
ਕਿਹ ਬਿਧਿ ਸਜਾ ਪ੍ਰਥਮ ਸੰਸਾਰਾ ॥੧੭॥

ਏਕੈ ਰੂਪ ਅਨੂਪ ਸਰੂਪਾ ॥
ਰੰਕ ਭਯੋ ਰਾਵ ਕਹੀ ਭੂਪਾ ॥
ਅੰਡਜ ਜੇਰਜ ਸੇਤਜ ਕੀਨੀ ॥
ਉਤਭੁਜ ਖਾਨਿ ਬਹੁਰਿ ਰਚਿ ਦੀਨੀ ॥੧੮॥

ਕਹੂੰ ਫੂਲਿ ਰਾਜਾ ਹ੍ਵੈ ਬੈਠਾ ॥
ਕਹੂੰ ਸਿਮਟਿ ਭਯੋ ਸੰਕਰ ਇਕੈਠਾ ॥
ਸਗਰੀ ਸ੍ਰਿਸਟਿ ਦਿਖਾਇ ਅਚੰਭਵ ॥
ਆਦਿ ਜੁਗਾਦਿ ਸਰੂਪ ਸੁਯੰਭਵ ॥੧੯॥

ਅਬ ਰਛਾ ਮੇਰੀ ਤੁਮ ਕਰੋ ॥
ਸਿਖ੍ਯ ਉਬਾਰਿ ਅਸਿਖ੍ਯ ਸੰਘਰੋ ॥
ਦੁਸਟ ਜਿਤੇ ਉਠਵਤ ਉਤਪਾਤਾ ॥
ਸਕਲ ਮਲੇਛ ਕਰੋ ਰਣ ਘਾਤਾ ॥੨੦॥

ਜੇ ਅਸਿਧੁਜ ਤਵ ਸਰਨੀ ਪਰੇ ॥
ਤਿਨ ਕੇ ਦੁਸਟ ਦੁਖਿਤ ਹ੍ਵੈ ਮਰੇ ॥
ਪੁਰਖ ਜਵਨ ਪਗੁ ਪਰੇ ਤਿਹਾਰੇ ॥
ਤਿਨ ਕੇ ਤੁਮ ਸੰਕਟ ਸਭ ਟਾਰੇ ॥੨੧॥

ਜੋ ਕਲਿ ਕੌ ਇਕ ਬਾਰ ਧਿਐਹੈ ॥
ਤਾ ਕੇ ਕਾਲ ਨਿਕਟਿ ਨਹਿ ਐਹੈ ॥
ਰਛਾ ਹੋਇ ਤਾਹਿ ਸਭ ਕਾਲਾ ॥
ਦੁਸਟ ਅਰਿਸਟ ਟਰੈਂ ਤਤਕਾਲਾ ॥੨੨॥

ਕ੍ਰਿਪਾ ਦ੍ਰਿਸਟਿ ਤਨ ਜਾਹਿ ਨਿਹਰਿਹੋ ॥
ਤਾ ਕੇ ਤਾਪ ਤਨਕ ਮਹਿ ਹਰਿਹੋ ॥
ਰਿਧਿ ਸਿਧਿ ਘਰ ਮੋ ਸਭ ਹੋਈ ॥
ਦੁਸਟ ਛਾਹ ਛ੍ਵੈ ਸਕੈ ਨ ਕੋਈ ॥੨੩॥

ਏਕ ਬਾਰ ਜਿਨ ਤੁਮੈ ਸੰਭਾਰਾ ॥
ਕਾਲ ਫਾਸ ਤੇ ਤਾਹਿ ਉਬਾਰਾ ॥
ਜਿਨ ਨਰ ਨਾਮ ਤਿਹਾਰੋ ਕਹਾ ॥
ਦਾਰਿਦ ਦੁਸਟ ਦੋਖ ਤੇ ਰਹਾ ॥੨੪॥

ਖੜਗਕੇਤੁ ਮੈ ਸਰਨਿ ਤਿਹਾਰੀ ॥
ਆਪੁ ਹਾਥ ਦੈ ਲੇਹੁ ਉਬਾਰੀ ॥
ਸਰਬ ਠੌਰ ਮੋ ਹੋਹੁ ਸਹਾਈ ॥
ਦੁਸਟ ਦੋਖ ਤੇ ਲੇਹੁ ਬਚਾਈ ॥੨੫॥

ਸੂੈਯਾ ॥
ਪਾਂਇ ਗਹੇ ਜਬ ਤੇ ਤੁਮਰੇ ਤਬ ਤੇ ਕੋਊ ਆਂਖ ਤਰੇ ਨਹੀ ਆਨਯੋ ॥
ਰਾਮ ਰਹੀਮ ਪੁਰਾਨ ਕੁਰਾਨ ਅਨੇਕ ਕਹੈਂ ਮਤ ਏਕ ਨ ਮਾਨਯੋ ॥
ਸਿੰਮ੍ਰਿਤਿ ਸਾਸਤ੍ਰ ਬੇਦ ਸਭੈ ਬਹੁ ਭੇਦ ਕਹੈ ਹਮ ਏਕ ਨ ਜਾਨਯੋ ॥
ਸ੍ਰੀ ਅਸਿਪਾਨ ਕ੍ਰਿਪਾ ਤੁਮਰੀ ਕਰਿ ਮੈ ਨ ਕਹਯੋ ਸਭ ਤੋਹਿ ਬਖਾਨਯੋ ॥੧॥

ਦੋਹਰਾ ॥
ਸਗਲ ਦੁਆਰ ਕਉ ਛਾਡਿ ਕੈ ਗਹਯੋ ਤੁਹਾਰੋ ਦੁਆਰ ॥
ਬਾਂਹਿ ਗਹੇ ਕੀ ਲਾਜ ਅਸਿ ਗੋਬਿੰਦ ਦਾਸ ਤੁਹਾਰ ॥੨॥

ਰਾਮਕਲੀ ਮਹਲਾ ੩ ਅਨੰਦੁ
ੴ ਸਤਿਗੁਰ ਪ੍ਰਸਾਦਿ ॥
ਅਨੰਦੁ ਭਇਆ ਮੇਰੀ ਮਾਏ ਸਤਿਗੁਰੂ ਮੈ ਪਾਇਆ ॥
ਸਤਿਗੁਰੁ ਤ ਪਾਇਆ ਸਹਜ ਸੇਤੀ ਮਨਿ ਵਜੀਆ ਵਾਧਾਈਆ ॥
ਰਾਗ ਰਤਨ ਪਰਵਾਰ ਪਰੀਆ ਸਬਦ ਗਾਵਣ ਆਈਆ ॥
ਸਬਦੋ ਤ ਗਾਵਹੁ ਹਰੀ ਕੇਰਾ ਮਨਿ ਜਿਨੀ ਵਸਾਇਆ ॥
ਕਹੈ ਨਾਨਕੁ ਅਨੰਦੁ ਹੋਆ ਸਤਿਗੁਰੂ ਮੈ ਪਾਇਆ ॥੧॥

ਏ ਮਨ ਮੇਰਿਆ ਤੂ ਸਦਾ ਰਹੁ ਹਰਿ ਨਾਲੇ ॥
ਹਰਿ ਨਾਲਿ ਰਹੁ ਤੂ ਮੰਨ ਮੇਰੇ ਦੂਖ ਸਭਿ ਵਿਸਾਰਣਾ ॥
ਅੰਗੀਕਾਰੁ ਓਹੁ ਕਰੇ ਤੇਰਾ ਕਾਰਜ ਸਭਿ ਸਵਾਰਣਾ ॥
ਸਭਨਾ ਗਲਾ ਸਮਰਥੁ ਸੁਆਮੀ ਸੋ ਕਿਉ ਮਨਹੁ ਵਿਸਾਰੇ ॥
ਕਹੈ ਨਾਨਕੁ ਮੰਨ ਮੇਰੇ ਸਦਾ ਰਹੁ ਹਰਿ ਨਾਲੇ ॥੨॥

ਸਾਚੇ ਸਾਹਿਬਾ ਕਿਆ ਨਾਹੀ ਘਰਿ ਤੇਰੈ ॥
ਘਰਿ ਤ ਤੇਰੈ ਸਭੁ ਕਿਛੁ ਹੈ ਜਿਸੁ ਦੇਹਿ ਸੁ ਪਾਵਏ ॥
ਸਦਾ ਸਿਫਤਿ ਸਲਾਹ ਤੇਰੀ ਨਾਮੁ ਮਨਿ ਵਸਾਵਏ ॥
ਨਾਮੁ ਜਿਨ ਕੈ ਮਨਿ ਵਸਿਆ ਵਾਜੇ ਸਬਦ ਘਨੇਰੇ ॥
ਕਹੈ ਨਾਨਕੁ ਸਚੇ ਸਾਹਿਬ ਕਿਆ ਨਾਹੀ ਘਰਿ ਤੇਰੈ ॥੩॥

ਸਾਚਾ ਨਾਮੁ ਮੇਰਾ ਆਧਾਰੋ ॥
ਸਾਚੁ ਨਾਮੁ ਅਧਾਰੁ ਮੇਰਾ ਜਿਨਿ ਭੁਖਾ ਸਭਿ ਗਵਾਈਆ ॥
ਕਰਿ ਸਾਂਤਿ ਸੁਖ ਮਨਿ ਆਇ ਵਸਿਆ ਜਿਨਿ ਇਛਾ ਸਭਿ ਪੁਜਾਈਆ ॥
ਸਦਾ ਕੁਰਬਾਣੁ ਕੀਤਾ ਗੁਰੂ ਵਿਟਹੁ ਜਿਸ ਦੀਆ ਏਹਿ ਵਡਿਆਈਆ ॥
ਕਹੈ ਨਾਨਕੁ ਸੁਣਹੁ ਸੰਤਹੁ ਸਬਦਿ ਧਰਹੁ ਪਿਆਰੋ ॥
ਸਾਚਾ ਨਾਮੁ ਮੇਰਾ ਆਧਾਰੋ ॥੪॥

ਵਾਜੇ ਪੰਚ ਸਬਦ ਤਿਤੁ ਘਰਿ ਸਭਾਗੈ ॥
ਘਰਿ ਸਭਾਗੈ ਸਬਦ ਵਾਜੇ ਕਲਾ ਜਿਤੁ ਘਰਿ ਧਾਰੀਆ ॥
ਪੰਚ ਦੂਤ ਤੁਧੁ ਵਸਿ ਕੀਤੇ ਕਾਲੁ ਕੰਟਕੁ ਮਾਰਿਆ ॥
ਧੁਰਿ ਕਰਮਿ ਪਾਇਆ ਤੁਧੁ ਜਿਨ ਕਉ ਸਿ ਨਾਮਿ ਹਰਿ ਕੈ ਲਾਗੇ ॥
ਕਹੈ ਨਾਨਕੁ ਤਹ ਸੁਖੁ ਹੋਆ ਤਿਤੁ ਘਰਿ ਅਨਹਦ ਵਾਜੇ ॥੫॥

ਅਨਦੁ ਸੁਣਹੁ ਵਡਭਾਗੀਹੋ ਸਗਲ ਮਨੋਰਥ ਪੂਰੇ ॥
ਪਾਰਬ੍ਰਹਮੁ ਪ੍ਰਭੁ ਪਾਇਆ ਉਤਰੇ ਸਗਲ ਵਿਸੂਰੇ ॥
ਦੂਖ ਰੋਗ ਸੰਤਾਪ ਉਤਰੇ ਸੁਣੀ ਸਚੀ ਬਾਣੀ ॥
ਸੰਤ ਸਾਜਨ ਭਏ ਸਰਸੇ ਪੂਰੇ ਗੁਰ ਤੇ ਜਾਣੀ ॥
ਸੁਣਤੇ ਪੁਨੀਤ ਕਹਤੇ ਪਵਿਤੁ ਸਤਿਗੁਰੁ ਰਹਿਆ ਭਰਪੂਰੇ ॥
ਬਿਨਵੰਤਿ ਨਾਨਕੁ ਗੁਰ ਚਰਣ ਲਾਗੇ ਵਾਜੇ ਅਨਹਦ ਤੂਰੇ ॥੪੦॥੧॥

ਮੁੰਦਾਵਣੀ ਮਹਲਾ ੫ ॥
ਥਾਲ ਵਿਚਿ ਤਿੰਨਿ ਵਸਤੂ ਪਈਓ ਸਤੁ ਸੰਤੋਖੁ ਵੀਚਾਰੋ ॥
ਅੰਮ੍ਰਿਤ ਨਾਮੁ ਠਾਕੁਰ ਕਾ ਪਇਓ ਜਿਸ ਕਾ ਸਭਸੁ ਅਧਾਰੋ ॥
ਜੇ ਕੋ ਖਾਵੈ ਜੇ ਕੋ ਭੁੰਚੈ ਤਿਸ ਕਾ ਹੋਇ ਉਧਾਰੋ ॥
ਏਹ ਵਸਤੁ ਤਜੀ ਨਹ ਜਾਈ ਨਿਤ ਨਿਤ ਰਖੁ ਉਰਿ ਧਾਰੋ ॥
ਤਮ ਸੰਸਾਰੁ ਚਰਨ ਲਗਿ ਤਰੀਐ ਸਭੁ ਨਾਨਕ ਬ੍ਰਹਮ ਪਸਾਰੋ ॥੧॥

ਸਲੋਕ ਮਹਲਾ ੫ ॥
ਤੇਰਾ ਕੀਤਾ ਜਾਤੋ ਨਾਹੀ ਮੈਨੋ ਜੋਗੁ ਕੀਤੋਈ ॥
ਮੈ ਨਿਰਗੁਣਿਆਰੇ ਕੋ ਗੁਣੁ ਨਾਹੀ ਆਪੇ ਤਰਸੁ ਪਇਓਈ ॥
ਤਰਸੁ ਪਇਆ ਮਿਹਰਾਮਤਿ ਹੋਈ ਸਤਿਗੁਰੁ ਸਜਣੁ ਮਿਲਿਆ ॥
ਨਾਨਕ ਨਾਮੁ ਮਿਲੈ ਤਾਂ ਜੀਵਾਂ ਤਨੁ ਮਨੁ ਥੀਵੈ ਹਰਿਆ ॥੧॥

ਪਉੜੀ ॥
ਤਿਥੈ ਤੂ ਸਮਰਥੁ ਜਿਥੈ ਕੋਇ ਨਾਹਿ ॥
ਓਥੈ ਤੇਰੀ ਰਖ ਅਗਨੀ ਉਦਰ ਮਾਹਿ ॥
ਸੁਣਿ ਕੈ ਜਮ ਕੇ ਦੂਤ ਨਾਇ ਤੇਰੈ ਛਡਿ ਜਾਹਿ ॥
ਭਉਜਲੁ ਬਿਖਮੁ ਅਸਗਾਹੁ ਗੁਰ ਸਬਦੀ ਪਾਰਿ ਪਾਹਿ ॥
ਜਿਨ ਕਉ ਲਗੀ ਪਿਆਸ ਅੰਮ੍ਰਿਤੁ ਸੇਇ ਖਾਹਿ ॥
ਕਲਿ ਮਹਿ ਏਹੋ ਪੁੰਨੁ ਗੁਣ ਗੋਵਿੰਦ ਗਾਹਿ ॥
ਸਭਸੈ ਨੋ ਕਿਰਪਾਲੁ ਸਮ੍ਹ੍ਹਾਲੇ ਸਾਹਿ ਸਾਹਿ ॥
ਬਿਰਥਾ ਕੋਇ ਨ ਜਾਇ ਜਿ ਆਵੈ ਤੁਧੁ ਆਹਿ ॥੯॥

ਸਲੋਕੁ ਮਃ ੫ ॥
ਅੰਤਰਿ ਗੁਰੁ ਆਰਾਧਣਾ ਜਿਹਵਾ ਜਪਿ ਗੁਰ ਨਾਉ ॥
ਨੇਤ੍ਰੀ ਸਤਿਗੁਰੁ ਪੇਖਣਾ ਸ੍ਰਵਣੀ ਸੁਨਣਾ ਗੁਰ ਨਾਉ ॥
ਸਤਿਗੁਰ ਸੇਤੀ ਰਤਿਆ ਦਰਗਹ ਪਾਈਐ ਠਾਉ ॥
ਕਹੁ ਨਾਨਕ ਕਿਰਪਾ ਕਰੇ ਜਿਸ ਨੋ ਏਹ ਵਥੁ ਦੇਇ ॥
ਜਗ ਮਹਿ ਉਤਮ ਕਾਢੀਅਹਿ ਵਿਰਲੇ ਕੇਈ ਕੇਇ ॥੧॥

ਮਃ ੫ ॥
ਰਖੇ ਰਖਣਹਾਰਿ ਆਪਿ ਉਬਾਰਿਅਨੁ ॥
ਗੁਰ ਕੀ ਪੈਰੀ ਪਾਇ ਕਾਜ ਸਵਾਰਿਅਨੁ ॥
ਹੋਆ ਆਪਿ ਦਇਆਲੁ ਮਨਹੁ ਨ ਵਿਸਾਰਿਅਨੁ ॥
ਸਾਧ ਜਨਾ ਕੈ ਸੰਗਿ ਭਵਜਲੁ ਤਾਰਿਅਨੁ ॥
ਸਾਕਤ ਨਿੰਦਕ ਦੁਸਟ ਖਿਨ ਮਾਹਿ ਬਿਦਾਰਿਅਨੁ ॥
ਤਿਸੁ ਸਾਹਿਬ ਕੀ ਟੇਕ ਨਾਨਕ ਮਨੈ ਮਾਹਿ ॥
ਜਿਸੁ ਸਿਮਰਤ ਸੁਖੁ ਹੋਇ ਸਗਲੇ ਦੂਖ ਜਾਹਿ ॥੨॥''';

  static const String anandSahib = '''ਅਨੰਦੁ ਸਾਹਿਬ 

ਰਾਮਕਲੀ ਮਹਲਾ ੩ ਅਨੰਦੁ
ੴ ਸਤਿਗੁਰ ਪ੍ਰਸਾਦਿ ॥

ਅਨੰਦੁ ਭਇਆ ਮੇਰੀ ਮਾਏ ਸਤਿਗੁਰੂ ਮੈ ਪਾਇਆ ॥
ਸਤਿਗੁਰੁ ਤ ਪਾਇਆ ਸਹਜ ਸੇਤੀ ਮਨਿ ਵਜੀਆ ਵਾਧਾਈਆ ॥
ਰਾਗ ਰਤਨ ਪਰਵਾਰ ਪਰੀਆ ਸਬਦ ਗਾਵਣ ਆਈਆ ॥
ਸਬਦੋ ਤ ਗਾਵਹੁ ਹਰੀ ਕੇਰਾ ਮਨਿ ਜਿਨੀ ਵਸਾਇਆ ॥
ਕਹੈ ਨਾਨਕੁ ਅਨੰਦੁ ਹੋਆ ਸਤਿਗੁਰੂ ਮੈ ਪਾਇਆ ॥੧॥

ਏ ਮਨ ਮੇਰਿਆ ਤੂ ਸਦਾ ਰਹੁ ਹਰਿ ਨਾਲੇ ॥
ਹਰਿ ਨਾਲਿ ਰਹੁ ਤੂ ਮੰਨ ਮੇਰੇ ਦੂਖ ਸਭਿ ਵਿਸਾਰਣਾ ॥
ਅੰਗੀਕਾਰੁ ਓਹੁ ਕਰੇ ਤੇਰਾ ਕਾਰਜ ਸਭਿ ਸਵਾਰਣਾ ॥
ਸਭਨਾ ਗਲਾ ਸਮਰਥੁ ਸੁਆਮੀ ਸੋ ਕਿਉ ਮਨਹੁ ਵਿਸਾਰੇ ॥
ਕਹੈ ਨਾਨਕੁ ਮੰਨ ਮੇਰੇ ਸਦਾ ਰਹੁ ਹਰਿ ਨਾਲੇ ॥੨॥

ਸਾਚੇ ਸਾਹਿਬਾ ਕਿਆ ਨਾਹੀ ਘਰਿ ਤੇਰੈ ॥
ਘਰਿ ਤ ਤੇਰੈ ਸਭੁ ਕਿਛੁ ਹੈ ਜਿਸੁ ਦੇਹਿ ਸੁ ਪਾਵਏ ॥
ਸਦਾ ਸਿਫਤਿ ਸਲਾਹ ਤੇਰੀ ਨਾਮੁ ਮਨਿ ਵਸਾਵਏ ॥
ਨਾਮੁ ਜਿਨ ਕੈ ਮਨਿ ਵਸਿਆ ਵਾਜੇ ਸਬਦ ਘਨੇਰੇ ॥
ਕਹੈ ਨਾਨਕੁ ਸਚੇ ਸਾਹਿਬ ਕਿਆ ਨਾਹੀ ਘਰਿ ਤੇਰੈ ॥੩॥

ਸਾਚਾ ਨਾਮੁ ਮੇਰਾ ਆਧਾਰੋ ॥
ਸਾਚੁ ਨਾਮੁ ਅਧਾਰੁ ਮੇਰਾ ਜਿਨਿ ਭੁਖਾ ਸਭਿ ਗਵਾਈਆ ॥
ਕਰਿ ਸਾਂਤਿ ਸੁਖ ਮਨਿ ਆਇ ਵਸਿਆ ਜਿਨਿ ਇਛਾ ਸਭਿ ਪੁਜਾਈਆ ॥
ਸਦਾ ਕੁਰਬਾਣੁ ਕੀਤਾ ਗੁਰੂ ਵਿਟਹੁ ਜਿਸ ਦੀਆ ਏਹਿ ਵਡਿਆਈਆ ॥
ਕਹੈ ਨਾਨਕੁ ਸੁਣਹੁ ਸੰਤਹੁ ਸਬਦਿ ਧਰਹੁ ਪਿਆਰੋ ॥
ਸਾਚਾ ਨਾਮੁ ਮੇਰਾ ਆਧਾਰੋ ॥੪॥

ਵਾਜੇ ਪੰਚ ਸਬਦ ਤਿਤੁ ਘਰਿ ਸਭਾਗੈ ॥
ਘਰਿ ਸਭਾਗੈ ਸਬਦ ਵਾਜੇ ਕਲਾ ਜਿਤੁ ਘਰਿ ਧਾਰੀਆ ॥
ਪੰਚ ਦੂਤ ਤੁਧੁ ਵਸਿ ਕੀਤੇ ਕਾਲੁ ਕੰਟਕੁ ਮਾਰਿਆ ॥
ਧੁਰਿ ਕਰਮਿ ਪਾਇਆ ਤੁਧੁ ਜਿਨ ਕਉ ਸਿ ਨਾਮਿ ਹਰਿ ਕੈ ਲਾਗੇ ॥
ਕਹੈ ਨਾਨਕੁ ਤਹ ਸੁਖੁ ਹੋਆ ਤਿਤੁ ਘਰਿ ਅਨਹਦ ਵਾਜੇ ॥੫॥

ਸਾਚੀ ਲਿਵੈ ਬਿਨੁ ਦੇਹ ਨਿਮਾਣੀ ॥
ਦੇਹ ਨਿਮਾਣੀ ਲਿਵੈ ਬਾਝਹੁ ਕਿਆ ਕਰੇ ਵੇਚਾਰੀਆ ॥
ਤੁਧੁ ਬਾਝੁ ਸਮਰਥ ਕੋਇ ਨਾਹੀ ਕ੍ਰਿਪਾ ਕਰਿ ਬਨਵਾਰੀਆ ॥
ਏਸ ਨਉ ਹੋਰੁ ਥਾਉ ਨਾਹੀ ਸਬਦਿ ਲਾਗਿ ਸਵਾਰੀਆ ॥
ਕਹੈ ਨਾਨਕੁ ਲਿਵੈ ਬਾਝਹੁ ਕਿਆ ਕਰੇ ਵੇਚਾਰੀਆ ॥੬॥

ਆਨੰਦੁ ਆਨੰਦੁ ਸਭੁ ਕੋ ਕਹੈ ਆਨੰਦੁ ਗੁਰੂ ਤੇ ਜਾਣਿਆ ॥
ਜਾਣਿਆ ਆਨੰਦੁ ਸਦਾ ਗੁਰ ਤੇ ਕ੍ਰਿਪਾ ਕਰੇ ਪਿਆਰਿਆ ॥
ਕਰਿ ਕਿਰਪਾ ਕਿਲਵਿਖ ਕਟੇ ਗਿਆਨ ਅੰਜਨੁ ਸਾਰਿਆ ॥
ਅੰਦਰਹੁ ਜਿਨ ਕਾ ਮੋਹੁ ਤੁਟਾ ਤਿਨ ਕਾ ਸਬਦੁ ਸਚੈ ਸਵਾਰਿਆ ॥
ਕਹੈ ਨਾਨਕੁ ਏਹੁ ਅਨੰਦੁ ਹੈ ਆਨੰਦੁ ਗੁਰ ਤੇ ਜਾਣਿਆ ॥੭॥

ਬਾਬਾ ਜਿਸੁ ਤੂ ਦੇਹਿ ਸੋਈ ਜਨੁ ਪਾਵੈ ॥
ਪਾਵੈ ਤ ਸੋ ਜਨੁ ਦੇਹਿ ਜਿਸ ਨੋ ਹੋਰਿ ਕਿਆ ਕਰਹਿ ਵੇਚਾਰਿਆ ॥
ਇਕਿ ਭਰਮਿ ਭੂਲੇ ਫਿਰਹਿ ਦਹ ਦਿਸਿ ਇਕਿ ਨਾਮਿ ਲਾਗਿ ਸਵਾਰਿਆ ॥
ਗੁਰ ਪਰਸਾਦੀ ਮਨੁ ਭਇਆ ਨਿਰਮਲੁ ਜਿਨਾ ਭਾਣਾ ਭਾਵਏ ॥
ਕਹੈ ਨਾਨਕੁ ਜਿਸੁ ਦੇਹਿ ਪਿਆਰੇ ਸੋਈ ਜਨੁ ਪਾਵਏ ॥੮॥

ਆਵਹੁ ਸੰਤ ਪਿਆਰਿਹੋ ਅਕਥ ਕੀ ਕਰਹ ਕਹਾਣੀ ॥
ਕਰਹ ਕਹਾਣੀ ਅਕਥ ਕੇਰੀ ਕਿਤੁ ਦੁਆਰੈ ਪਾਈਐ ॥
ਤਨੁ ਮਨੁ ਧਨੁ ਸਭੁ ਸਉਪਿ ਗੁਰ ਕਉ ਹੁਕਮਿ ਮੰਨਿਐ ਪਾਈਐ ॥
ਹੁਕਮੁ ਮੰਨਿਹੁ ਗੁਰੂ ਕੇਰਾ ਗਾਵਹੁ ਸਚੀ ਬਾਣੀ ॥
ਕਹੈ ਨਾਨਕੁ ਸੁਣਹੁ ਸੰਤਹੁ ਕਥਿਹੁ ਅਕਥ ਕਹਾਣੀ ॥੯॥

ਏ ਮਨ ਚੰਚਲਾ ਚਤੁਰਾਈ ਕਿਨੈ ਨ ਪਾਇਆ ॥
ਚਤੁਰਾਈ ਨ ਪਾਇਆ ਕਿਨੈ ਤੂ ਸੁਣਿ ਮੰਨ ਮੇਰਿਆ ॥
ਏਹ ਮਾਇਆ ਮੋਹਣੀ ਜਿਨਿ ਏਤੁ ਭਰਮਿ ਭੁਲਾਇਆ ॥
ਮਾਇਆ ਤ ਮੋਹਣੀ ਤਿਨੈ ਕੀਤੀ ਜਿਨਿ ਠਗਉਲੀ ਪਾਈਆ ॥
ਕੁਰਬਾਣੁ ਕੀਤਾ ਤਿਸੈ ਵਿਟਹੁ ਜਿਨਿ ਮੋਹੁ ਮੀਠਾ ਲਾਇਆ ॥
ਕਹੈ ਨਾਨਕੁ ਮਨ ਚੰਚਲ ਚਤੁਰਾਈ ਕਿਨੈ ਨ ਪਾਇਆ ॥੧੦॥

ਏ ਮਨ ਪਿਆਰਿਆ ਤੂ ਸਦਾ ਸਚੁ ਸਮਾਲੇ ॥
ਏਹੁ ਕੁਟੰਬੁ ਤੂ ਜਿ ਦੇਖਦਾ ਚਲੈ ਨਾਹੀ ਤੇਰੈ ਨਾਲੇ ॥
ਸਾਥਿ ਤੇਰੈ ਚਲੈ ਨਾਹੀ ਤਿਸੁ ਨਾਲਿ ਕਿਉ ਚਿਤੁ ਲਾਈਐ ॥
ਐਸਾ ਕੰਮੁ ਮੂਲੇ ਨ ਕੀਚੈ ਜਿਤੁ ਅੰਤਿ ਪਛੋਤਾਈਐ ॥
ਸਤਿਗੁਰੂ ਕਾ ਉਪਦੇਸੁ ਸੁਣਿ ਤੂ ਹੋਵੈ ਤੇਰੈ ਨਾਲੇ ॥
ਕਹੈ ਨਾਨਕੁ ਮਨ ਪਿਆਰੇ ਤੂ ਸਦਾ ਸਚੁ ਸਮਾਲੇ ॥੧੧॥

ਅਗਮ ਅਗੋਚਰਾ ਤੇਰਾ ਅੰਤੁ ਨ ਪਾਇਆ ॥
ਅੰਤੋ ਨ ਪਾਇਆ ਕਿਨੈ ਤੇਰਾ ਆਪਣਾ ਆਪੁ ਤੂ ਜਾਣਹੇ ॥
ਜੀਅ ਜੰਤ ਸਭਿ ਖੇਲੁ ਤੇਰਾ ਕਿਆ ਕੋ ਆਖਿ ਵਖਾਣਏ ॥
ਆਖਹਿ ਤ ਵੇਖਹਿ ਸਭੁ ਤੂਹੈ ਜਿਨਿ ਜਗਤੁ ਉਪਾਇਆ ॥
ਕਹੈ ਨਾਨਕੁ ਤੂ ਸਦਾ ਅਗੰਮੁ ਹੈ ਤੇਰਾ ਅੰਤੁ ਨ ਪਾਇਆ ॥੧੨॥

ਸੁਰਿ ਨਰ ਮੁਨਿ ਜਨ ਅੰਮ੍ਰਿਤੁ ਖੋਜਦੇ ਸੁ ਅੰਮ੍ਰਿਤੁ ਗੁਰ ਤੇ ਪਾਇਆ ॥
ਪਾਇਆ ਅੰਮ੍ਰਿਤੁ ਗੁਰਿ ਕ੍ਰਿਪਾ ਕੀਨੀ ਸਚਾ ਮਨਿ ਵਸਾਇਆ ॥
ਜੀਅ ਜੰਤ ਸਭਿ ਤੁਧੁ ਉਪਾਏ ਇਕਿ ਵੇਖਿ ਪਰਸਣਿ ਆਇਆ ॥
ਲਬੁ ਲੋਭੁ ਅਹੰਕਾਰੁ ਚੂਕਾ ਸਤਿਗੁਰੂ ਭਲਾ ਭਾਇਆ ॥
ਕਹੈ ਨਾਨਕੁ ਜਿਸ ਨੋ ਆਪਿ ਤੁਠਾ ਤਿਨਿ ਅੰਮ੍ਰਿਤੁ ਗੁਰ ਤੇ ਪਾਇਆ ॥੧੩॥

ਭਗਤਾ ਕੀ ਚਾਲ ਨਿਰਾਲੀ ॥
ਚਾਲਾ ਨਿਰਾਲੀ ਭਗਤਾਹ ਕੇਰੀ ਬਿਖਮ ਮਾਰਗਿ ਚਲਣਾ ॥
ਲਬੁ ਲੋਭੁ ਅਹੰਕਾਰੁ ਤਜਿ ਤ੍ਰਿਸਨਾ ਬਹੁਤੁ ਨਾਹੀ ਬੋਲਣਾ ॥
ਖੰਨਿਅਹੁ ਤਿਖੀ ਵਾਲਹੁ ਨਿਕੀ ਏਤੁ ਮਾਰਗਿ ਜਾਣਾ ॥
ਗੁਰ ਪਰਸਾਦੀ ਜਿਨੀ ਆਪੁ ਤਜਿਆ ਹਰਿ ਵਾਸਨਾ ਸਮਾਣੀ ॥
ਕਹੈ ਨਾਨਕੁ ਚਾਲ ਭਗਤਾ ਜੁਗਹੁ ਜੁਗੁ ਨਿਰਾਲੀ ॥੧੪॥

ਜਿਉ ਤੂ ਚਲਾਇਹਿ ਤਿਵ ਚਲਹ ਸੁਆਮੀ ਹੋਰੁ ਕਿਆ ਜਾਣਾ ਗੁਣ ਤੇਰੇ ॥
ਜਿਵ ਤੂ ਚਲਾਇਹਿ ਤਿਵੈ ਚਲਹ ਜਿਨਾ ਮਾਰਗਿ ਪਾਵਹੇ ॥
ਕਰਿ ਕਿਰਪਾ ਜਿਨ ਨਾਮਿ ਲਾਇਹਿ ਸਿ ਹਰਿ ਹਰਿ ਸਦਾ ਧਿਆਵਹੇ ॥
ਜਿਸ ਨੋ ਕਥਾ ਸੁਣਾਇਹਿ ਆਪਣੀ ਸਿ ਗੁਰਦੁਆਰੈ ਸੁਖੁ ਪਾਵਹੇ ॥
ਕਹੈ ਨਾਨਕੁ ਸਚੇ ਸਾਹਿਬ ਜਿਉ ਭਾਵੈ ਤਿਵੈ ਚਲਾਵਹੇ ॥੧੫॥

ਏਹੁ ਸੋਹਿਲਾ ਸਬਦੁ ਸੁਹਾਵਾ ॥
ਸਬਦੋ ਸੁਹਾਵਾ ਸਦਾ ਸੋਹਿਲਾ ਸਤਿਗੁਰੂ ਸੁਣਾਇਆ ॥
ਏਹੁ ਤਿਨ ਕੈ ਮੰਨਿ ਵਸਿਆ ਜਿਨ ਧੁਰਹੁ ਲਿਖਿਆ ਆਇਆ ॥
ਇਕਿ ਫਿਰਹਿ ਘਨੇਰੇ ਕਰਹਿ ਗਲਾ ਗਲੀ ਕਿਨੈ ਨ ਪਾਇਆ ॥
ਕਹੈ ਨਾਨਕੁ ਸਬਦੁ ਸੋਹਿਲਾ ਸਤਿਗੁਰੂ ਸੁਣਾਇਆ ॥੧੬॥

ਪਵਿਤੁ ਹੋਏ ਸੇ ਜਨਾ ਜਿਨੀ ਹਰਿ ਧਿਆਇਆ ॥
ਹਰਿ ਧਿਆਇਆ ਪਵਿਤੁ ਹੋਏ ਗੁਰਮੁਖਿ ਜਿਨੀ ਧਿਆਇਆ ॥
ਪਵਿਤੁ ਮਾਤਾ ਪਿਤਾ ਕੁਟੰਬ ਸਹਿਤ ਸਿਉ ਪਵਿਤੁ ਸੰਗਤਿ ਸਬਾਈਆ ॥
ਕਹਦੇ ਪਵਿਤੁ ਸੁਣਦੇ ਪਵਿਤੁ ਸੇ ਪਵਿਤੁ ਜਿਨੀ ਮੰਨਿ ਵਸਾਇਆ ॥
ਕਹੈ ਨਾਨਕੁ ਸੇ ਪਵਿਤੁ ਜਿਨੀ ਗੁਰਮੁਖਿ ਹਰਿ ਹਰਿ ਧਿਆਇਆ ॥੧੭॥

ਕਰਮੀ ਸਹਜੁ ਨ ਊਪਜੈ ਵਿਣੁ ਸਹਜੈ ਸਹਸਾ ਨ ਜਾਇ ॥
ਨਹ ਜਾਇ ਸਹਸਾ ਕਿਤੈ ਸੰਜਮਿ ਰਹੇ ਕਰਮ ਕਮਾਏ ॥
ਸਹਸੈ ਜੀਉ ਮਲੀਣੁ ਹੈ ਕਿਤੁ ਸੰਜਮਿ ਧੋਤਾ ਜਾਏ ॥
ਮੰਨੁ ਧੋਵਹੁ ਸਬਦਿ ਲਾਗਹੁ ਹਰਿ ਸਿਉ ਰਹਹੁ ਚਿਤੁ ਲਾਇ ॥
ਕਹੈ ਨਾਨਕੁ ਗੁਰ ਪਰਸਾਦੀ ਸਹਜੁ ਉਪਜੈ ਇਹੁ ਸਹਸਾ ਇਵ ਜਾਇ ॥੧੮॥

ਜੀਅਹੁ ਮੈਲੇ ਬਾਹਰਹੁ ਨਿਰਮਲ ॥
ਬਾਹਰਹੁ ਨਿਰਮਲ ਜੀਅਹੁ ਤ ਮੈਲੇ ਤਿਨੀ ਜਨਮੁ ਜੂਐ ਹਾਰਿਆ ॥
ਏਹ ਤਿਸਨਾ ਵਡਾ ਰੋਗੁ ਲਗਾ ਮਰਣੁ ਮਨਹੁ ਵਿਸਾਰਿਆ ॥
ਵੇਦਾ ਮਹਿ ਨਾਮੁ ਉਤਮੁ ਸੋ ਸੁਣਹਿ ਨਾਹੀ ਫਿਰਹਿ ਜਿਉ ਬੇਤਾਲਿਆ ॥
ਕਹੈ ਨਾਨਕੁ ਜਿਨ ਸਚੁ ਤਜਿਆ ਕੂੜੇ ਲਾਗੇ ਤਿਨੀ ਜਨਮੁ ਜੂਐ ਹਾਰਿਆ ॥੧੯॥

ਜੀਅਹੁ ਨਿਰਮਲ ਬਾਹਰਹੁ ਨਿਰਮਲ ॥
ਬਾਹਰਹੁ ਤ ਨਿਰਮਲ ਜੀਅਹੁ ਨਿਰਮਲ ਸਤਿਗੁਰ ਤੇ ਕਰਣੀ ਕਮਾਣੀ ॥
ਕੂੜ ਕੀ ਸੋਇ ਪਹੁਚੈ ਨਾਹੀ ਮਨਸਾ ਸਚਿ ਸਮਾਣੀ ॥
ਜਨਮੁ ਰਤਨੁ ਜਿਨੀ ਖਟਿਆ ਭਲੇ ਸੇ ਵਣਜਾਰੇ ॥
ਕਹੈ ਨਾਨਕੁ ਜਿਨ ਮੰਨੁ ਨਿਰਮਲੁ ਸਦਾ ਰਹਹਿ ਗੁਰ ਨਾਲੇ ॥੨੦॥

ਜੇ ਕੋ ਸਿਖੁ ਗੁਰੂ ਸੇਤੀ ਸਨਮੁਖੁ ਹੋਵੈ ॥
ਹੋਵੈ ਤ ਸਨਮੁਖੁ ਸਿਖੁ ਕੋਈ ਜੀਅਹੁ ਰਹੈ ਗੁਰ ਨਾਲੇ ॥
ਗੁਰ ਕੇ ਚਰਨ ਹਿਰਦੈ ਧਿਆਏ ਅੰਤਰ ਆਤਮੈ ਸਮਾਲੇ ॥
ਆਪੁ ਛਡਿ ਸਦਾ ਰਹੈ ਪਰਣੈ ਗੁਰ ਬਿਨੁ ਅਵਰੁ ਨ ਜਾਣੈ ਕੋਏ ॥
ਕਹੈ ਨਾਨਕੁ ਸੁਣਹੁ ਸੰਤਹੁ ਸੋ ਸਿਖੁ ਸਨਮੁਖੁ ਹੋਏ ॥੨੧॥

ਜੇ ਕੋ ਗੁਰ ਤੇ ਵੇਮੁਖੁ ਹੋਵੈ ਬਿਨੁ ਸਤਿਗੁਰ ਮੁਕਤਿ ਨ ਪਾਵੈ ॥
ਪਾਵੈ ਮੁਕਤਿ ਨ ਹੋਰ ਥੈ ਕੋਈ ਪੁਛਹੁ ਬਿਬੇਕੀਆ ਜਾਏ ॥
ਅਨੇਕ ਜੂਨੀ ਭਰਮਿ ਆਵੈ ਵਿਣੁ ਸਤਿਗੁਰ ਮੁਕਤਿ ਨ ਪਾਏ ॥
ਫਿਰਿ ਮੁਕਤਿ ਪਾਏ ਲਾਗਿ ਚਰਣੀ ਸਤਿਗੁਰੂ ਸਬਦੁ ਸੁਣਾਏ ॥
ਕਹੈ ਨਾਨਕੁ ਵੀਚਾਰਿ ਦੇਖਹੁ ਵਿਣੁ ਸਤਿਗੁਰ ਮੁਕਤਿ ਨ ਪਾਏ ॥੨੨॥

ਆਵਹੁ ਸਿਖ ਸਤਿਗੁਰੂ ਕੇ ਪਿਆਰਿਹੋ ਗਾਵਹੁ ਸਚੀ ਬਾਣੀ ॥
ਬਾਣੀ ਤ ਗਾਵਹੁ ਗੁਰੂ ਕੇਰੀ ਬਾਣੀਆ ਸਿਰਿ ਬਾਣੀ ॥
ਜਿਨ ਕਉ ਨਦਰਿ ਕਰਮੁ ਹੋਵੈ ਹਿਰਦੈ ਤਿਨਾ ਸਮਾਣੀ ॥
ਪੀਵਹੁ ਅੰਮ੍ਰਿਤੁ ਸਦਾ ਰਹਹੁ ਹਰਿ ਰੰਗਿ ਜਪਿਹੁ ਸਾਰਿਗਪਾਣੀ ॥
ਕਹੈ ਨਾਨਕੁ ਸਦਾ ਗਾਵਹੁ ਏਹ ਸਚੀ ਬਾਣੀ ॥੨੩॥

ਸਤਿਗੁਰੂ ਬਿਨਾ ਹੋਰ ਕਚੀ ਹੈ ਬਾਣੀ ॥
ਬਾਣੀ ਤ ਕਚੀ ਸਤਿਗੁਰੂ ਬਾਝਹੁ ਹੋਰ ਕਚੀ ਬਾਣੀ ॥
ਕਹਦੇ ਕਚੇ ਸੁਣਦੇ ਕਚੇ ਕਚੀ ਆਖਿ ਵਖਾਣੀ ॥
ਹਰਿ ਹਰਿ ਨਿਤ ਕਰਹਿ ਰਸਨਾ ਕਹਿਆ ਕਛੂ ਨ ਜਾਣੀ ॥
ਚਿਤੁ ਜਿਨ ਕਾ ਹਿਰਿ ਲਇਆ ਮਾਇਆ ਬੋਲਨਿ ਪਏ ਰਵਾਣੀ ॥
ਕਹੈ ਨਾਨਕੁ ਸਤਿਗੁਰੂ ਬਾਝਹੁ ਹੋਰ ਕਚੀ ਬਾਣੀ ॥੨੪॥

ਗੁਰ ਕਾ ਸਬਦੁ ਰਤੰਨੁ ਹੈ ਹੀਰੇ ਜਿਤੁ ਜੜਾਉ ॥
ਸਬਦੁ ਰਤਨੁ ਜਿਤੁ ਮੰਨੁ ਲਾਗਾ ਏਹੁ ਹੋਆ ਸਮਾਉ ॥
ਸਬਦ ਸੇਤੀ ਮਨੁ ਮਿਲਿਆ ਸਚੈ ਲਾਇਆ ਭਾਉ ॥
ਆਪੇ ਹੀਰਾ ਰਤਨੁ ਆਪੇ ਜਿਸ ਨੋ ਦੇਇ ਬੁਝਾਇ ॥
ਕਹੈ ਨਾਨਕੁ ਸਬਦੁ ਰਤਨੁ ਹੈ ਹੀਰਾ ਜਿਤੁ ਜੜਾਉ ॥੨੫॥

ਸਿਵ ਸਕਤਿ ਆਪਿ ਉਪਾਇ ਕੈ ਕਰਤਾ ਆਪੇ ਹੁਕਮੁ ਵਰਤਾਏ ॥
ਹੁਕਮੁ ਵਰਤਾਏ ਆਪਿ ਵੇਖੈ ਗੁਰਮੁਖਿ ਕਿਸੈ ਬੁਝਾਏ ॥
ਤੋੜੇ ਬੰਧਨ ਹੋਵੈ ਮੁਕਤੁ ਸਬਦੁ ਮੰਨਿ ਵਸਾਏ ॥
ਗੁਰਮੁਖਿ ਜਿਸ ਨੋ ਆਪਿ ਕਰੇ ਸੁ ਹੋਵੈ ਏਕਸ ਸਿਉ ਲਿਵ ਲਾਏ ॥
ਕਹੈ ਨਾਨਕੁ ਆਪਿ ਕਰਤਾ ਆਪੇ ਹੁਕਮੁ ਬੁਝਾਏ ॥੨੬॥

ਸਿਮ੍ਰਿਤਿ ਸਾਸਤ੍ਰ ਪੁੰਨ ਪਾਪ ਬੀਚਾਰਦੇ ਤਤੈ ਸਾਰ ਨ ਜਾਣੀ ॥
ਤਤੈ ਸਾਰ ਨ ਜਾਣੀ ਗੁਰੂ ਬਾਝਹੁ ਤਤੈ ਸਾਰ ਨ ਜਾਣੀ ॥
ਤਿਹੀ ਗੁਣੀ ਸੰਸਾਰੁ ਭ੍ਰਮਿ ਸੁਤਾ ਸੁਤਿਆ ਰੈਣਿ ਵਿਹਾਣੀ ॥
ਗੁਰ ਕਿਰਪਾ ਤੇ ਸੇ ਜਨ ਜਾਗੇ ਜਿਨਾ ਹਰਿ ਮਨਿ ਵਸਿਆ ਬੋਲਹਿ ਅੰਮ੍ਰਿਤ ਬਾਣੀ ॥
ਕਹੈ ਨਾਨਕੁ ਸੋ ਤਤੁ ਪਾਏ ਜਿਸ ਨੋ ਅਨਦਿਨੁ ਹਰਿ ਲਿਵ ਲਾਗੈ ਜਾਗਤ ਰੈਣਿ ਵਿਹਾਣੀ ॥੨੭॥

ਮਾਤਾ ਕੇ ਉਦਰ ਮਹਿ ਪ੍ਰਤਿਪਾਲ ਕਰੇ ਸੋ ਕਿਉ ਮਨਹੁ ਵਿਸਾਰੀਐ ॥
ਮਨਹੁ ਕਿਉ ਵਿਸਾਰੀਐ ਏਵਡੁ ਦਾਤਾ ਜਿ ਅਗਨਿ ਮਹਿ ਆਹਾਰੁ ਪਹੁਚਾਵਏ ॥
ਓਸ ਨੋ ਕਿਹੁ ਪੋਹਿ ਨ ਸਕੀ ਜਿਸ ਨਉ ਆਪਣੀ ਲਿਵ ਲਾਵਏ ॥
ਆਪਣੀ ਲਿਵ ਆਪੇ ਲਾਏ ਗੁਰਮੁਖਿ ਸਦਾ ਸਮਾਲੀਐ ॥
ਕਹੈ ਨਾਨਕੁ ਏਵਡੁ ਦਾਤਾ ਸੋ ਕਿਉ ਮਨਹੁ ਵਿਸਾਰੀਐ ॥੨੮॥

ਜੈਸੀ ਅਗਨਿ ਉਦਰ ਮਹਿ ਤੈਸੀ ਬਾਹਰਿ ਮਾਇਆ ॥
ਮਾਇਆ ਅਗਨਿ ਸਭ ਇਕੋ ਜੇਹੀ ਕਰਤੈ ਖੇਲੁ ਰਚਾਇਆ ॥
ਜਾ ਤਿਸੁ ਭਾਣਾ ਤਾ ਜੰਮਿਆ ਪਰਵਾਰਿ ਭਲਾ ਭਾਇਆ ॥
ਲਿਵ ਛੁੜਕੀ ਲਗੀ ਤ੍ਰਿਸਨਾ ਮਾਇਆ ਅਮਰੁ ਵਰਤਾਇਆ ॥
ਏਹ ਮਾਇਆ ਜਿਤੁ ਹਰਿ ਵਿਸਰੈ ਮੋਹੁ ਉਪਜੈ ਭਾਉ ਦੂਜਾ ਲਾਇਆ ॥
ਕਹੈ ਨਾਨਕੁ ਗੁਰ ਪਰਸਾਦੀ ਜਿਨਾ ਲਿਵ ਲਾਗੀ ਤਿਨੀ ਵਿਚੇ ਮਾਇਆ ਪਾਇਆ ॥੨੯॥

ਹਰਿ ਆਪਿ ਅਮੁਲਕੁ ਹੈ ਮੁਲਿ ਨ ਪਾਇਆ ਜਾਇ ॥
ਮੁਲਿ ਨ ਪਾਇਆ ਜਾਇ ਕਿਸੈ ਵਿਟਹੁ ਰਹੇ ਲੋਕ ਵਿਲਲਾਇ ॥
ਐਸਾ ਸਤਿਗੁਰੁ ਜੇ ਮਿਲੈ ਤਿਸ ਨੋ ਸਿਰੁ ਸਉਪੀਐ ਵਿਚਹੁ ਆਪੁ ਜਾਇ ॥
ਜਿਸ ਦਾ ਜੀਉ ਤਿਸੁ ਮਿਲਿ ਰਹੈ ਹਰਿ ਵਸੈ ਮਨਿ ਆਇ ॥
ਹਰਿ ਆਪਿ ਅਮੁਲਕੁ ਹੈ ਭਾਗ ਤਿਨਾ ਕੇ ਨਾਨਕਾ ਜਿਨ ਹਰਿ ਪਲੈ ਪਾਇ ॥੩੦॥

ਹਰਿ ਰਾਸਿ ਮੇਰੀ ਮਨੁ ਵਣਜਾਰਾ ॥
ਹਰਿ ਰਾਸਿ ਮੇਰੀ ਮਨੁ ਵਣਜਾਰਾ ਸਤਿਗੁਰ ਤੇ ਰਾਸਿ ਜਾਣੀ ॥
ਹਰਿ ਹਰਿ ਨਿਤ ਜਪਿਹੁ ਜੀਅਹੁ ਲਾਹਾ ਖਟਿਹੁ ਦਿਹਾੜੀ ॥
ਏਹੁ ਧਨੁ ਤਿਨਾ ਮਿਲਿਆ ਜਿਨ ਹਰਿ ਆਪੇ ਭਾਣਾ ॥
ਕਹੈ ਨਾਨਕੁ ਹਰਿ ਰਾਸਿ ਮੇਰੀ ਮਨੁ ਹੋਆ ਵਣਜਾਰਾ ॥੩੧॥

ਏ ਰਸਨਾ ਤੂ ਅਨ ਰਸਿ ਰਾਚਿ ਰਹੀ ਤੇਰੀ ਪਿਆਸ ਨ ਜਾਇ ॥
ਪਿਆਸ ਨ ਜਾਇ ਹੋਰਤੁ ਕਿਤੈ ਜਿਚਰੁ ਹਰਿ ਰਸੁ ਪਲੈ ਨ ਪਾਇ ॥
ਹਰਿ ਰਸੁ ਪਾਇ ਪਲੈ ਪੀਐ ਹਰਿ ਰਸੁ ਬਹੁੜਿ ਨ ਤ੍ਰਿਸਨਾ ਲਾਗੈ ਆਇ ॥
ਏਹੁ ਹਰਿ ਰਸੁ ਕਰਮੀ ਪਾਈਐ ਸਤਿਗੁਰੁ ਮਿਲੈ ਜਿਸੁ ਆਇ ॥
ਕਹੈ ਨਾਨਕੁ ਹੋਰਿ ਅਨ ਰਸ ਸਭਿ ਵੀਸਰੇ ਜਾ ਹਰਿ ਵਸੈ ਮਨਿ ਆਇ ॥੩੨॥

ਏ ਸਰੀਰਾ ਮੇਰਿਆ ਹਰਿ ਤੁਮ ਮਹਿ ਜੋਤਿ ਰਖੀ ਤਾ ਤੂ ਜਗ ਮਹਿ ਆਇਆ ॥
ਹਰਿ ਜੋਤਿ ਰਖੀ ਤੁਧੁ ਵਿਚਿ ਤਾ ਤੂ ਜਗ ਮਹਿ ਆਇਆ ॥
ਹਰਿ ਆਪੇ ਮਾਤਾ ਆਪੇ ਪਿਤਾ ਜਿਨਿ ਜੀਉ ਉਪਾਇ ਜਗਤੁ ਦਿਖਾਇਆ ॥
ਗੁਰ ਪਰਸਾਦੀ ਬੁਝਿਆ ਤਾ ਚਲਤੁ ਹੋਆ ਚਲਤੁ ਨਦਰੀ ਆਇਆ ॥
ਕਹੈ ਨਾਨਕੁ ਸ੍ਰਿਸਟਿ ਕਾ ਮੂਲੁ ਰਚਿਆ ਜੋਤਿ ਰਾਖੀ ਤਾ ਤੂ ਜਗ ਮਹਿ ਆਇਆ ॥੩੩॥

ਮਨਿ ਚਾਉ ਭਇਆ ਪ੍ਰਭ ਆਗਮੁ ਸੁਣਿਆ ॥
ਹਰਿ ਮੰਗਲੁ ਗਾਉ ਸਖੀ ਗ੍ਰਿਹੁ ਮੰਦਰੁ ਬਣਿਆ ॥
ਹਰਿ ਗਾਉ ਮੰਗਲੁ ਨਿਤ ਸਖੀਏ ਸੋਗੁ ਦੂਖੁ ਨ ਵਿਆਪਏ ॥
ਗੁਰ ਚਰਨ ਲਾਗੇ ਦਿਨ ਸਭਾਗੇ ਆਪਣਾ ਪਿਰੁ ਜਾਪਏ ॥
ਅਨਹਤ ਬਾਣੀ ਗੁਰ ਸਬਦਿ ਜਾਣੀ ਹਰਿ ਨਾਮੁ ਹਰਿ ਰਸੁ ਭੋਗੋ ॥
ਕਹੈ ਨਾਨਕੁ ਪ੍ਰਭੁ ਆਪਿ ਮਿਲਿਆ ਕਰਣ ਕਾਰਣ ਜੋਗੋ ॥੩੪॥

ਏ ਸਰੀਰਾ ਮੇਰਿਆ ਇਸੁ ਜਗ ਮਹਿ ਆਇ ਕੈ ਕਿਆ ਤੁਧੁ ਕਰਮ ਕਮਾਇਆ ॥
ਕਿ ਕਰਮ ਕਮਾਇਆ ਤੁਧੁ ਸਰੀਰਾ ਜਾ ਤੂ ਜਗ ਮਹਿ ਆਇਆ ॥
ਜਿਨਿ ਹਰਿ ਤੇਰਾ ਰਚਨੁ ਰਚਿਆ ਸੋ ਹਰਿ ਮਨਿ ਨ ਵਸਾਇਆ ॥
ਗੁਰ ਪਰਸਾਦੀ ਹਰਿ ਮੰਨਿ ਵਸਿਆ ਪੂਰਬਿ ਲਿਖਿਆ ਪਾਇਆ ॥
ਕਹੈ ਨਾਨਕੁ ਏਹੁ ਸਰੀਰੁ ਪਰਵਾਣੁ ਹੋਆ ਜਿਨਿ ਸਤਿਗੁਰ ਸਿਉ ਚਿਤੁ ਲਾਇਆ ॥੩੫॥

ਏ ਨੇਤ੍ਰਹੁ ਮੇਰਿਹੋ ਹਰਿ ਤੁਮ ਮਹਿ ਜੋਤਿ ਧਰੀ ਹਰਿ ਬਿਨੁ ਅਵਰੁ ਨ ਦੇਖਹੁ ਕੋਈ ॥
ਹਰਿ ਬਿਨੁ ਅਵਰੁ ਨ ਦੇਖਹੁ ਕੋਈ ਨਦਰੀ ਹਰਿ ਨਿਹਾਲਿਆ ॥
ਏਹੁ ਵਿਸੁ ਸੰਸਾਰੁ ਤੁਮ ਦੇਖਦੇ ਏਹੁ ਹਰਿ ਕਾ ਰੂਪੁ ਹੈ ਹਰਿ ਰੂਪੁ ਨਦਰੀ ਆਇਆ ॥
ਗੁਰ ਪਰਸਾਦੀ ਬੁਝਿਆ ਜਾ ਵੇਖਾ ਹਰਿ ਇਕੁ ਹੈ ਹਰਿ ਬਿਨੁ ਅਵਰੁ ਨ ਕੋਈ ॥
ਕਹੈ ਨਾਨਕੁ ਏਹਿ ਨੇਤ੍ਰ ਅੰਧ ਸੇ ਸਤਿਗੁਰਿ ਮਿਲਿਐ ਦਿਬ ਦ੍ਰਿਸਟਿ ਹੋਈ ॥੩੬॥

ਏ ਸ੍ਰਵਣਹੁ ਮੇਰਿਹੋ ਸਾਚੈ ਸੁਨਣੈ ਨੋ ਪਠਾਏ ॥
ਸਾਚੈ ਸੁਨਣੈ ਨੋ ਪਠਾਏ ਸਰੀਰਿ ਲਾਏ ਸੁਣਹੁ ਸਤਿ ਬਾਣੀ ॥
ਜਿਤੁ ਸੁਣੀ ਮਨੁ ਤਨੁ ਹਰਿਆ ਹੋਆ ਰਸਨਾ ਰਸਿ ਸਮਾਣੀ ॥
ਸਚੁ ਅਲਖ ਵਿਡਾਣੀ ਤਾ ਕੀ ਗਤਿ ਕਹੀ ਨ ਜਾਏ ॥
ਕਹੈ ਨਾਨਕੁ ਅੰਮ੍ਰਿਤ ਨਾਮੁ ਸੁਣਹੁ ਪਵਿਤ੍ਰ ਹੋਵਹੁ ਸਾਚੈ ਸੁਨਣੈ ਨੋ ਪਠਾਏ ॥੩੭॥

ਹਰਿ ਜੀਉ ਗੁਫਾ ਅੰਦਰਿ ਰਖਿ ਕੈ ਵਾਜਾ ਪਵਣੁ ਵਜਾਇਆ ॥
ਵਜਾਇਆ ਵਾਜਾ ਪਉਣ ਨਉ ਦੁਆਰੇ ਪਰਗਟੁ ਕੀਏ ਦਸਵਾ ਗੁਪਤੁ ਰਖਾਇਆ ॥
ਗੁਰਦੁਆਰੈ ਲਾਇ ਭਾਵਨੀ ਇਕਨਾ ਦਸਵਾ ਦੁਆਰੁ ਦਿਖਾਇਆ ॥
ਤਹ ਅਨੇਕ ਰੂਪ ਨਾਉ ਨਵ ਨਿਧਿ ਤਿਸ ਦਾ ਅੰਤੁ ਨ ਜਾਈ ਪਾਇਆ ॥
ਕਹੈ ਨਾਨਕੁ ਹਰਿ ਪਿਆਰੈ ਜੀਉ ਗੁਫਾ ਅੰਦਰਿ ਰਖਿ ਕੈ ਵਾਜਾ ਪਵਣੁ ਵਜਾਇਆ ॥੩੮॥

ਏਹੁ ਸਾਚਾ ਸੋਹਿਲਾ ਸਾਚੈ ਘਰਿ ਗਾਵਹੁ ॥
ਗਾਵਹੁ ਤ ਸੋਹਿਲਾ ਘਰਿ ਸਾਚੈ ਜਿਥੈ ਸਦਾ ਸਚੁ ਧਿਆਵਹੇ ॥
ਸਚੋ ਧਿਆਵਹਿ ਜਾ ਤੁਧੁ ਭਾਵਹਿ ਗੁਰਮੁਖਿ ਜਿਨਾ ਬੁਝਾਵਹੇ ॥
ਇਹੁ ਸਚੁ ਸਭਨਾ ਕਾ ਖਸਮੁ ਹੈ ਜਿਸੁ ਬਖਸੇ ਸੋ ਜਨੁ ਪਾਵਹੇ ॥
ਕਹੈ ਨਾਨਕੁ ਸਚੁ ਸੋਹਿਲਾ ਸਚੈ ਘਰਿ ਗਾਵਹੇ ॥੩੯॥

ਅਨਦੁ ਸੁਣਹੁ ਵਡਭਾਗੀਹੋ ਸਗਲ ਮਨੋਰਥ ਪੂਰੇ ॥
ਪਾਰਬ੍ਰਹਮੁ ਪ੍ਰਭੁ ਪਾਇਆ ਉਤਰੇ ਸਗਲ ਵਿਸੂਰੇ ॥
ਦੂਖ ਰੋਗ ਸੰਤਾਪ ਉਤਰੇ ਸੁਣੀ ਸਚੀ ਬਾਣੀ ॥
ਸੰਤ ਸਾਜਨ ਭਏ ਸਰਸੇ ਪੂਰੇ ਗੁਰ ਤੇ ਜਾਣੀ ॥
ਸੁਣਤੇ ਪੁਨੀਤ ਕਹਤੇ ਪਵਿਤੁ ਸਤਿਗੁਰੁ ਰਹਿਆ ਭਰਪੂਰੇ ॥
ਬਿਨਵੰਤਿ ਨਾਨਕੁ ਗੁਰ ਚਰਣ ਲਾਗੇ ਵਾਜੇ ਅਨਹਦ ਤੂਰੇ ॥੪੦॥੧॥''';

  static const String chaupaiSahib = '''ੴ 
ਸ੍ਰੀ ਵਾਹਿਗੁਰੂ ਜੀ ਕੀ ਫਤਹਿ ਪਾਤਸਾਹੀ ॥੧੦॥
ਕਬ੍ਯੋ ਬਾਚ ਬੇਨਤੀ ॥

ਚੌਪਈ ॥

ਹਮਰੀ ਕਰੋ ਹਾਥ ਦੈ ਰਛਾ ॥
ਪੂਰਨ ਹੋਇ ਚਿਤ ਕੀ ਇਛਾ ॥
ਤਵ ਚਰਨਨ ਮਨ ਰਹੈ ਹਮਾਰਾ ॥
ਅਪਨਾ ਜਾਨ ਕਰੋ ਪ੍ਰਤਿਪਾਰਾ ॥੧॥

ਹਮਰੇ ਦੁਸਟ ਸਭੈ ਤੁਮ ਘਾਵਹੁ ॥
ਆਪੁ ਹਾਥ ਦੈ ਮੋਹਿ ਬਚਾਵਹੁ ॥
ਸੁਖੀ ਬਸੈ ਮੋਰੋ ਪਰਿਵਾਰਾ ॥
ਸੇਵਕ ਸਿਖ੍ਯ ਸਭੈ ਕਰਤਾਰਾ ॥੨॥

ਮੋ ਰਛਾ ਨਿਜੁ ਕਰ ਦੈ ਕਰਿਯੈ ॥
ਸਭ ਬੈਰਿਨ ਕੌ ਆਜ ਸੰਘਰਿਯੈ ॥
ਪੂਰਨ ਹੋਇ ਹਮਾਰੀ ਆਸਾ ॥
ਤੋਰਿ ਭਜਨ ਕੀ ਰਹੈ ਪਿਯਾਸਾ ॥੩॥

ਤੁਮਹਿ ਛਾਡਿ ਕੋਈ ਅਵਰ ਨ ਧ੍ਯਾਊ ॥
ਜੋ ਬਰ ਚਾਹੌ ਸੁ ਤੁਮ ਤੇ ਪਾਊ ॥
ਸੇਵਕ ਸਿੱਖ੍ਯ ਹਮਾਰੇ ਤਾਰਿਯਹਿ ॥
ਚੁਨ ਚੁਨ ਸਤ੍ਰੁ ਹਮਾਰੇ ਮਾਰਿਯਹਿ ॥੪॥

ਆਪੁ ਹਾਥ ਦੈ ਮੁਝੈ ਉਬਰਿਯੈ ॥
ਮਰਨ ਕਾਲ ਕਾ ਤ੍ਰਾਸ ਨਿਵਰਿਯੈ ॥
ਹੂਜੋ ਸਦਾ ਹਮਾਰੇ ਪਛਾ ॥
ਸ੍ਰੀ ਅਸਿਧੁਜ ਜੂ ਕਰਿਯਹੁ ਰਛਾ ॥੫॥

ਰਾਖਿ ਲੇਹੁ ਮੁਹਿ ਰਾਖਨਹਾਰੇ ॥
ਸਾਹਿਬ ਸੰਤ ਸਹਾਇ ਪਿਯਾਰੇ ॥
ਦੀਨਬੰਧੁ ਦੁਸਟਨ ਕੇ ਹੰਤਾ ॥
ਤੁਮ ਹੋ ਪੁਰੀ ਚਤੁਰਦਸ ਕੰਤਾ ॥੬॥

ਕਾਲ ਪਾਇ ਬ੍ਰਹਮਾ ਬਪੁ ਧਰਾ ॥
ਕਾਲ ਪਾਇ ਸਿਵ ਜੂ ਅਵਤਰਾ ॥
ਕਾਲ ਪਾਇ ਕਰਿ ਬਿਸਨ ਪ੍ਰਕਾਸਾ ॥
ਸਕਲ ਕਾਲ ਕਾ ਕੀਯਾ ਤਮਾਸਾ ॥੭॥

ਜਵਨ ਕਾਲ ਜੋਗੀ ਸਿਵ ਕੀਯੋ ॥
ਬੇਦ ਰਾਜ ਬ੍ਰਹਮਾ ਜੂ ਥੀਯੋ ॥
ਜਵਨ ਕਾਲ ਸਭ ਲੋਕ ਸਵਾਰਾ ॥
ਨਮਸਕਾਰ ਹੈ ਤਾਹਿ ਹਮਾਰਾ ॥੮॥

ਜਵਨ ਕਾਲ ਸਭ ਜਗਤ ਬਨਾਯੋ ॥
ਦੇਵ ਦੈਤ ਜਛਨ ਉਪਜਾਯੋ ॥
ਆਦਿ ਅੰਤਿ ਏਕੈ ਅਵਤਾਰਾ ॥
ਸੋਈ ਗੁਰੂ ਸਮਝਿਯਹੁ ਹਮਾਰਾ ॥੯॥

ਨਮਸਕਾਰ ਤਿਸ ਹੀ ਕੋ ਹਮਾਰੀ ॥
ਸਕਲ ਪ੍ਰਜਾ ਜਿਨ ਆਪ ਸਵਾਰੀ ॥
ਸਿਵਕਨ ਕੋ ਸਿਵਗੁਨ ਸੁਖ ਦੀਯੋ ॥
ਸਤ੍ਰੁਨ ਕੋ ਪਲ ਮੋ ਬਧ ਕੀਯੋ ॥੧੦॥

ਘਟ ਘਟ ਕੇ ਅੰਤਰ ਕੀ ਜਾਨਤ ॥
ਭਲੇ ਬੁਰੇ ਕੀ ਪੀਰ ਪਛਾਨਤ ॥
ਚੀਟੀ ਤੇ ਕੁੰਚਰ ਅਸਥੂਲਾ ॥
ਸਭ ਪਰ ਕ੍ਰਿਪਾ ਦ੍ਰਿਸਟਿ ਕਰਿ ਫੂਲਾ ॥੧੧॥

ਸੰਤਨ ਦੁਖ ਪਾਏ ਤੇ ਦੁਖੀ ॥
ਸੁਖ ਪਾਏ ਸਾਧਨ ਕੇ ਸੁਖੀ ॥
ਏਕ ਏਕ ਕੀ ਪੀਰ ਪਛਾਨੈ ॥
ਘਟ ਘਟ ਕੇ ਪਟ ਪਟ ਕੀ ਜਾਨੈ ॥੧੨॥

ਜਬ ਉਦਕਰਖ ਕਰਾ ਕਰਤਾਰਾ ॥
ਪ੍ਰਜਾ ਧਰਤ ਤਬ ਦੇਹ ਅਪਾਰਾ ॥
ਜਬ ਆਕਰਖ ਕਰਤ ਹੋ ਕਬਹੂੰ ॥
ਤੁਮ ਮੈ ਮਿਲਤ ਦੇਹ ਧਰ ਸਭਹੂੰ ॥੧੩॥

ਜੇਤੇ ਬਦਨ ਸ੍ਰਿਸਟਿ ਸਭ ਧਾਰੈ ॥
ਆਪੁ ਆਪੁਨੀ ਬੂਝਿ ਉਚਾਰੈ ॥
ਤੁਮ ਸਭ ਹੀ ਤੇ ਰਹਤ ਨਿਰਾਲਮ ॥
ਜਾਨਤ ਬੇਦ ਭੇਦ ਅਰੁ ਆਲਮ ॥੧੪॥

ਨਿਰੰਕਾਰ ਨ੍ਰਿਬਿਕਾਰ ਨ੍ਰਿਲੰਭ ॥
ਆਦਿ ਅਨੀਲ ਅਨਾਦਿ ਅਸੰਭ ॥
ਤਾ ਕਾ ਮੂੜ ਉਚਾਰਤ ਭੇਦਾ ॥
ਜਾ ਕੋ ਭੇਵ ਨ ਪਾਵਤ ਬੇਦਾ ॥੧੫॥

ਤਾ ਕੌ ਕਰਿ ਪਾਹਨ ਅਨੁਮਾਨਤ ॥
ਮਹਾ ਮੂੜ ਕਛੁ ਭੇਦ ਨ ਜਾਨਤ ॥
ਮਹਾਦੇਵ ਕੌ ਕਹਤ ਸਦਾ ਸਿਵ ॥
ਨਿਰੰਕਾਰ ਕਾ ਚੀਨਤ ਨਹਿ ਭਿਵ ॥੧੬॥

ਆਪੁ ਆਪੁਨੀ ਬੁਧਿ ਹੈ ਜੇਤੀ ॥
ਬਰਨਤ ਭਿੰਨ ਭਿੰਨ ਤੁਹਿ ਤੇਤੀ ॥
ਤੁਮਰਾ ਲਖਾ ਨ ਜਾਇ ਪਸਾਰਾ ॥
ਕਿਹ ਬਿਧਿ ਸਜਾ ਪ੍ਰਥਮ ਸੰਸਾਰਾ ॥੧੭॥

ਏਕੈ ਰੂਪ ਅਨੂਪ ਸਰੂਪਾ ॥
ਰੰਕ ਭਯੋ ਰਾਵ ਕਹੀ ਭੂਪਾ ॥
ਅੰਡਜ ਜੇਰਜ ਸੇਤਜ ਕੀਨੀ ॥
ਉਤਭੁਜ ਖਾਨਿ ਬਹੁਰਿ ਰਚਿ ਦੀਨੀ ॥੧੮॥

ਕਹੂੰ ਫੂਲਿ ਰਾਜਾ ਹ੍ਵੈ ਬੈਠਾ ॥
ਕਹੂੰ ਸਿਮਟਿ ਭਯੋ ਸੰਕਰ ਇਕੈਠਾ ॥
ਸਗਰੀ ਸ੍ਰਿਸਟਿ ਦਿਖਾਇ ਅਚੰਭਵ ॥
ਆਦਿ ਜੁਗਾਦਿ ਸਰੂਪ ਸੁਯੰਭਵ ॥੧੯॥

ਅਬ ਰਛਾ ਮੇਰੀ ਤੁਮ ਕਰੋ ॥
ਸਿਖ੍ਯ ਉਬਾਰਿ ਅਸਿਖ੍ਯ ਸੰਘਰੋ ॥
ਦੁਸਟ ਜਿਤੇ ਉਠਵਤ ਉਤਪਾਤਾ ॥
ਸਕਲ ਮਲੇਛ ਕਰੋ ਰਣ ਘਾਤਾ ॥੨੦॥

ਜੇ ਅਸਿਧੁਜ ਤਵ ਸਰਨੀ ਪਰੇ ॥
ਤਿਨ ਕੇ ਦੁਸਟ ਦੁਖਿਤ ਹ੍ਵੈ ਮਰੇ ॥
ਪੁਰਖ ਜਵਨ ਪਗੁ ਪਰੇ ਤਿਹਾਰੇ ॥
ਤਿਨ ਕੇ ਤੁਮ ਸੰਕਟ ਸਭ ਟਾਰੇ ॥੨੧॥

ਜੋ ਕਲਿ ਕੌ ਇਕ ਬਾਰ ਧਿਐਹੈ ॥
ਤਾ ਕੇ ਕਾਲ ਨਿਕਟਿ ਨਹਿ ਐਹੈ ॥
ਰਛਾ ਹੋਇ ਤਾਹਿ ਸਭ ਕਾਲਾ ॥
ਦੁਸਟ ਅਰਿਸਟ ਟਰੈਂ ਤਤਕਾਲਾ ॥੨੨॥

ਕ੍ਰਿਪਾ ਦ੍ਰਿਸਟਿ ਤਨ ਜਾਹਿ ਨਿਹਰਿਹੋ ॥
ਤਾ ਕੇ ਤਾਪ ਤਨਕ ਮਹਿ ਹਰਿਹੋ ॥
ਰਿਧਿ ਸਿਧਿ ਘਰ ਮੋ ਸਭ ਹੋਈ ॥
ਦੁਸਟ ਛਾਹ ਛ੍ਵੈ ਸਕੈ ਨ ਕੋਈ ॥੨੩॥

ਏਕ ਬਾਰ ਜਿਨ ਤੁਮੈ ਸੰਭਾਰਾ ॥
ਕਾਲ ਫਾਸ ਤੇ ਤਾਹਿ ਉਬਾਰਾ ॥
ਜਿਨ ਨਰ ਨਾਮ ਤਿਹਾਰੋ ਕਹਾ ॥
ਦਾਰਿਦ ਦੁਸਟ ਦੋਖ ਤੇ ਰਹਾ ॥੨੪॥

ਖੜਗਕੇਤੁ ਮੈ ਸਰਨਿ ਤਿਹਾਰੀ ॥
ਆਪੁ ਹਾਥ ਦੈ ਲੇਹੁ ਉਬਾਰੀ ॥
ਸਰਬ ਠੌਰ ਮੋ ਹੋਹੁ ਸਹਾਈ ॥
ਦੁਸਟ ਦੋਖ ਤੇ ਲੇਹੁ ਬਚਾਈ ॥੨੫॥

ਕ੍ਰਿਪਾ ਕਰੀ ਹਮ ਪਰ ਜਗਮਾਤਾ ॥
ਗ੍ਰੰਥ ਕਰਾ ਪੂਰਨ ਸੁਭਰਾਤਾ ॥
ਕਿਲਬਿਖ ਸਕਲ ਦੇਖ ਕੋ ਹਰਤਾ ॥
ਦੁਸਟ ਦੋਖਿਯਨ ਕੋ ਛੈ ਕਰਤਾ ॥੨੬॥

ਸ੍ਰੀ ਅਸਿਧੁਜ ਜਬ ਭਏ ਦਯਾਲਾ ॥
ਪੂਰਨ ਕਰਾ ਗ੍ਰੰਥ ਤਤਕਾਲਾ ॥
ਮਨ ਬਾਛਤ ਫਲ ਪਾਵੈ ਸੋਈ ॥
ਦੂਖ ਨ ਤਿਸੈ ਬਿਆਪਤ ਕੋਈ ॥੨੭॥

ਅੜਿਲ ॥
ਸੁਨੈ ਗੁੰਗ ਜੋ ਯਾਹਿ ਸੁ ਰਸਨਾ ਪਾਵਈ ॥
ਸੁਨੈ ਮੂੜ ਚਿਤ ਲਾਇ ਚਤੁਰਤਾ ਆਵਈ ॥
ਦੂਖ ਦਰਦ ਭੌ ਨਿਕਟ ਨ ਤਿਨ ਨਰ ਕੇ ਰਹੈ ॥
ਹੋ ਜੋ ਯਾ ਕੀ ਏਕ ਬਾਰ ਚੌਪਈ ਕੋ ਕਹੈ ॥੨੮॥

ਚੌਪਈ ॥
ਸੰਬਤ ਸਤ੍ਰਹ ਸਹਸ ਭਣਿਜੈ ॥
ਅਰਧ ਸਹਸ ਫੁਨਿ ਤੀਨਿ ਕਹਿਜੈ ॥
ਭਾਦ੍ਰਵ ਸੁਦੀ ਅਸਟਮੀ ਰਵਿ ਵਾਰਾ ॥
ਤੀਰ ਸਤੁਦ੍ਰਵ ਗ੍ਰੰਥ ਸੁਧਾਰਾ ॥੨੯॥

ਸੂੈਯਾ ॥
ਪਾਂਇ ਗਹੇ ਜਬ ਤੇ ਤੁਮਰੇ ਤਬ ਤੇ ਕੋਊ ਆਂਖ ਤਰੇ ਨਹੀ ਆਨਯੋ ॥
ਰਾਮ ਰਹੀਮ ਪੁਰਾਨ ਕੁਰਾਨ ਅਨੇਕ ਕਹੈਂ ਮਤ ਏਕ ਨ ਮਾਨਯੋ ॥
ਸਿੰਮ੍ਰਿਤਿ ਸਾਸਤ੍ਰ ਬੇਦ ਸਭੈ ਬਹੁ ਭੇਦ ਕਹੈ ਹਮ ਏਕ ਨ ਜਾਨਯੋ ॥
ਸ੍ਰੀ ਅਸਿਪਾਨ ਕ੍ਰਿਪਾ ਤੁਮਰੀ ਕਰਿ ਮੈ ਨ ਕਹਯੋ ਸਭ ਤੋਹਿ ਬਖਾਨਯੋ ॥੧॥

ਦੋਹਰਾ ॥
ਸਗਲ ਦੁਆਰ ਕਉ ਛਾਡਿ ਕੈ ਗਹਯੋ ਤੁਹਾਰੋ ਦੁਆਰ ॥
ਬਾਂਹਿ ਗਹੇ ਕੀ ਲਾਜ ਅਸਿ ਗੋਬਿੰਦ ਦਾਸ ਤੁਹਾਰ ॥੨॥''';

  static const String japjiSahib = '''ਜਪੁਜੀ ਸਾਹਿਬ
ੴ 
ਸਤਿ ਨਾਮੁ ਕਰਤਾ ਪੁਰਖੁ ਨਿਰਭਉ ਨਿਰਵੈਰੁ
ਅਕਾਲ ਮੂਰਤਿ ਅਜੂਨੀ ਸੈਭੰ ਗੁਰ ਪ੍ਰਸਾਦਿ ॥

॥ ਜਪੁ ॥

ਆਦਿ ਸਚੁ ਜੁਗਾਦਿ ਸਚੁ ॥
ਹੈ ਭੀ ਸਚੁ ਨਾਨਕ ਹੋਸੀ ਭੀ ਸਚੁ ॥੧॥

ਸੋਚੈ ਸੋਚਿ ਨ ਹੋਵਈ ਜੇ ਸੋਚੀ ਲਖ ਵਾਰ ॥
ਚੁਪੈ ਚੁਪ ਨ ਹੋਵਈ ਜੇ ਲਾਇ ਰਹਾ ਲਿਵ ਤਾਰ ॥
ਭੁਖਿਆ ਭੁਖ ਨ ਉਤਰੀ ਜੇ ਬੰਨਾ ਪੁਰੀਆ ਭਾਰ ॥
ਸਹਸ ਸਿਆਣਪਾ ਲਖ ਹੋਹਿ ਤ ਇਕ ਨ ਚਲੈ ਨਾਲਿ ॥
ਕਿਵ ਸਚਿਆਰਾ ਹੋਈਐ ਕਿਵ ਕੂੜੈ ਤੁਟੈ ਪਾਲਿ ॥
ਹੁਕਮਿ ਰਜਾਈ ਚਲਣਾ ਨਾਨਕ ਲਿਖਿਆ ਨਾਲਿ ॥੧॥

ਹੁਕਮੀ ਹੋਵਨਿ ਆਕਾਰ ਹੁਕਮੁ ਨ ਕਹਿਆ ਜਾਈ ॥
ਹੁਕਮੀ ਹੋਵਨਿ ਜੀਅ ਹੁਕਮਿ ਮਿਲੈ ਵਡਿਆਈ ॥
ਹੁਕਮੀ ਉਤਮੁ ਨੀਚੁ ਹੁਕਮਿ ਲਿਖਿ ਦੁਖ ਸੁਖ ਪਾਈਅਹਿ ॥
ਇਕਨਾ ਹੁਕਮੀ ਬਖਸੀਸ ਇਕਿ ਹੁਕਮੀ ਸਦਾ ਭਵਾਈਅਹਿ ॥
ਹੁਕਮੈ ਅੰਦਰਿ ਸਭੁ ਕੋ ਬਾਹਰਿ ਹੁਕਮ ਨ ਕੋਇ ॥
ਨਾਨਕ ਹੁਕਮੈ ਜੇ ਬੁਝੈ ਤ ਹਉਮੈ ਕਹੈ ਨ ਕੋਇ ॥੨॥

ਗਾਵੈ ਕੋ ਤਾਣੁ ਹੋਵੈ ਕਿਸੈ ਤਾਣੁ ॥
ਗਾਵੈ ਕੋ ਦਾਤਿ ਜਾਣੈ ਨੀਸਾਣੁ ॥
ਗਾਵੈ ਕੋ ਗੁਣ ਵਡਿਆਈਆ ਚਾਰ ॥
ਗਾਵੈ ਕੋ ਵਿਦਿਆ ਵਿਖਮੁ ਵੀਚਾਰੁ ॥
ਗਾਵੈ ਕੋ ਸਾਜਿ ਕਰੇ ਤਨੁ ਖੇਹ ॥
ਗਾਵੈ ਕੋ ਜੀਅ ਲੈ ਫਿਰਿ ਦੇਹ॥
ਗਾਵੈ ਕੋ ਜਾਪੈ ਦਿਸੈ ਦੂਰਿ ॥
ਗਾਵੈ ਕੋ ਵੇਖੈ ਹਾਦਰਾ ਹਦੂਰਿ ॥
ਕਥਨਾ ਕਥੀ ਨ ਆਵੈ ਤੋਟਿ ॥
ਕਥਿ ਕਥਿ ਕਥੀ ਕੋਟੀ ਕੋਟਿ ਕੋਟਿ ॥
ਦੇਦਾ ਦੇ ਲੈਦੇ ਥਕਿ ਪਾਹਿ॥
ਜੁਗਾ ਜੁਗੰਤਰਿ ਖਾਹੀ ਖਾਹਿ ॥
ਹੁਕਮੀ ਹੁਕਮੁ ਚਲਾਏ ਰਾਹੁ ॥
ਨਾਨਕ ਵਿਗਸੈ ਵੇਪਰਵਾਹੁ ॥੩॥

ਸਾਚਾ ਸਾਹਿਬੁ ਸਾਚੁ ਨਾਇ ਭਾਖਿਆ ਭਾਉ ਅਪਾਰੁ ॥
ਆਖਹਿ ਮੰਗਹਿ ਦੇਹਿ ਦੇਹਿ ਦਾਤਿ ਕਰੇ ਦਾਤਾਰੁ ॥
ਫੇਰਿ ਕਿ ਅਗੈ ਰਖੀਐ ਜਿਤੁ ਦਿਸੈ ਦਰਬਾਰੁ ॥
ਮੁਹੌ ਕਿ ਬੋਲਣੁ ਬੋਲੀਐ ਜਿਤੁ ਸੁਣਿ ਧਰੇ ਪਿਆਰੁ ॥
ਅੰਮ੍ਰਿਤ ਵੇਲਾ ਸਚੁ ਨਾਉ ਵਡਿਆਈ ਵੀਚਾਰੁ ॥
ਕਰਮੀ ਆਵੈ ਕਪੜਾ ਨਦਰੀ ਮੋਖੁ ਦੁਆਰੁ ॥
ਨਾਨਕ ਏਵੈ ਜਾਣੀਐ ਸਭੁ ਆਪੇ ਸਚਿਆਰੁ ॥੪॥

ਥਾਪਿਆ ਨ ਜਾਇ ਕੀਤਾ ਨ ਹੋਇ ॥
ਆਪੇ ਆਪਿ ਨਿਰੰਜਨੁ ਸੋਇ ॥
ਜਿਨਿ ਸੇਵਿਆ ਤਿਨਿ ਪਾਇਆ ਮਾਨੁ ॥
ਨਾਨਕ ਗਾਵੀਐ ਗੁਣੀ ਨਿਧਾਨੁ ॥
ਗਾਵੀਐ ਸੁਣੀਐ ਮਨਿ ਰਖੀਐ ਭਾਉ ॥
ਦੁਖੁ ਪਰਹਰਿ ਸੁਖੁ ਘਰਿ ਲੈ ਜਾਇ ॥
ਗੁਰਮੁਖਿ ਨਾਦੰ ਗੁਰਮੁਖਿ ਵੇਦੰ ਗੁਰਮੁਖਿ ਰਹਿਆ ਸਮਾਈ ॥
ਗੁਰੁ ਈਸਰੁ ਗੁਰੁ ਗੋਰਖੁ ਬਰਮਾ ਗੁਰੁ ਪਾਰਬਤੀ ਮਾਈ ॥
ਜੇ ਹਉ ਜਾਣਾ ਆਖਾ ਨਾਹੀ ਕਹਣਾ ਕਥਨੁ ਨ ਜਾਈ ॥
ਗੁਰਾ ਇਕ ਦੇਹਿ ਬੁਝਾਈ ॥
ਸਭਨਾ ਜੀਆ ਕਾ ਇਕੁ ਦਾਤਾ ਸੋ ਮੈ ਵਿਸਰਿ ਨ ਜਾਈ ॥੫॥

ਤੀਰਥਿ ਨਾਵਾ ਜੇ ਤਿਸੁ ਭਾਵਾ ਵਿਣੁ ਭਾਣੇ ਕਿ ਨਾਇ ਕਰੀ ॥
ਜੇਤੀ ਸਿਰਠਿ ਉਪਾਈ ਵੇਖਾ ਵਿਣੁ ਕਰਮਾ ਕਿ ਮਿਲੈ ਲਈ ॥
ਮਤਿ ਵਿਚਿ ਰਤਨ ਜਵਾਹਰ ਮਾਣਿਕ ਜੇ ਇਕ ਗੁਰ ਕੀ ਸਿਖ ਸੁਣੀ ॥
ਗੁਰਾ ਇਕ ਦੇਹਿ ਬੁਝਾਈ ॥
ਸਭਨਾ ਜੀਆ ਕਾ ਇਕੁ ਦਾਤਾ ਸੋ ਮੈ ਵਿਸਰਿ ਨ ਜਾਈ ॥੬॥

ਜੇ ਜੁਗ ਚਾਰੇ ਆਰਜਾ ਹੋਰ ਦਸੂਣੀ ਹੋਇ ॥
ਨਵਾ ਖੰਡਾ ਵਿਚਿ ਜਾਣੀਐ ਨਾਲਿ ਚਲੈ ਸਭੁ ਕੋਇ ॥
ਚੰਗਾ ਨਾਉ ਰਖਾਇ ਕੈ ਜਸੁ ਕੀਰਤਿ ਜਗਿ ਲੇਇ ॥
ਜੇ ਤਿਸੁ ਨਦਰਿ ਨ ਆਵਈ ਤ ਵਾਤ ਨ ਪੁਛੈ ਕੇ ॥
ਕੀਟਾ ਅੰਦਰਿ ਕੀਟੁ ਕਰਿ ਦੋਸੀ ਦੋਸੁ ਧਰੇ ॥
ਨਾਨਕ ਨਿਰਗੁਣਿ ਗੁਣੁ ਕਰੇ ਗੁਣਵੰਤਿਆ ਗੁਣੁ ਦੇ ॥
ਤੇਹਾ ਕੋਇ ਨ ਸੁਝਈ ਜਿ ਤਿਸੁ ਗੁਣੁ ਕੋਇ ਕਰੇ ॥੭॥

ਸੁਣਿਐ ਸਿਧ ਪੀਰ ਸੁਰਿ ਨਾਥ ॥
ਸੁਣਿਐ ਧਰਤਿ ਧਵਲ ਆਕਾਸ ॥
ਸੁਣਿਐ ਦੀਪ ਲੋਅ ਪਾਤਾਲ ॥
ਸੁਣਿਐ ਪੋਹਿ ਨ ਸਕੈ ਕਾਲੁ ॥
ਨਾਨਕ ਭਗਤਾ ਸਦਾ ਵਿਗਾਸੁ ॥
ਸੁਣਿਐ ਦੂਖ ਪਾਪ ਕਾ ਨਾਸੁ ॥੮॥

ਸੁਣਿਐ ਈਸਰੁ ਬਰਮਾ ਇੰਦੁ ॥
ਸੁਣਿਐ ਮੁਖਿ ਸਾਲਾਹਣ ਮੰਦੁ ॥
ਸੁਣਿਐ ਜੋਗ ਜੁਗਤਿ ਤਨਿ ਭੇਦ ॥
ਸੁਣਿਐ ਸਾਸਤ ਸਿਮ੍ਰਿਤਿ ਵੇਦ ॥
ਨਾਨਕ ਭਗਤਾ ਸਦਾ ਵਿਗਾਸੁ ॥
ਸੁਣਿਐ ਦੂਖ ਪਾਪ ਕਾ ਨਾਸੁ ॥੯॥

ਸੁਣਿਐ ਸਤੁ ਸੰਤੋਖੁ ਗਿਆਨੁ ॥
ਸੁਣਿਐ ਅਠਸਠਿ ਕਾ ਇਸਨਾਨੁ ॥
ਸੁਣਿਐ ਪੜਿ ਪੜਿ ਪਾਵਹਿ ਮਾਨੁ ॥
ਸੁਣਿਐ ਲਾਗੈ ਸਹਜਿ ਧਿਆਨੁ ॥
ਨਾਨਕ ਭਗਤਾ ਸਦਾ ਵਿਗਾਸੁ ॥
ਸੁਣਿਐ ਦੂਖ ਪਾਪ ਕਾ ਨਾਸੁ ॥੧੦॥

ਸੁਣਿਐ ਸਰਾ ਗੁਣਾ ਕੇ ਗਾਹ ॥
ਸੁਣਿਐ ਸੇਖ ਪੀਰ ਪਾਤਿਸਾਹ ॥
ਸੁਣਿਐ ਅੰਧੇ ਪਾਵਹਿ ਰਾਹੁ ॥
ਸੁਣਿਐ ਹਾਥ ਹੋਵੈ ਅਸਗਾਹੁ ॥
ਨਾਨਕ ਭਗਤਾ ਸਦਾ ਵਿਗਾਸੁ ॥
ਸੁਣਿਐ ਦੂਖ ਪਾਪ ਕਾ ਨਾਸੁ ॥੧੧॥

ਮੰਨੇ ਕੀ ਗਤਿ ਕਹੀ ਨ ਜਾਇ ॥
ਜੇ ਕੋ ਕਹੈ ਪਿਛੈ ਪਛੁਤਾਇ ॥
ਕਾਗਦਿ ਕਲਮ ਨ ਲਿਖਣਹਾਰੁ ॥
ਮੰਨੇ ਕਾ ਬਹਿ ਕਰਨਿ ਵੀਚਾਰੁ ॥
ਐਸਾ ਨਾਮੁ ਨਿਰੰਜਨੁ ਹੋਇ ॥
ਜੇ ਕੋ ਮੰਨਿ ਜਾਣੈ ਮਨਿ ਕੋਇ ॥੧੨॥

ਮੰਨੈ ਸੁਰਤਿ ਹੋਵੈ ਮਨਿ ਬੁਧਿ ॥
ਮੰਨੈ ਸਗਲ ਭਵਣ ਕੀ ਸੁਧਿ ॥
ਮੰਨੈ ਮੁਹਿ ਚੋਟਾ ਨਾ ਖਾਇ ॥
ਮੰਨੈ ਜਮ ਕੈ ਸਾਥਿ ਨ ਜਾਇ ॥
ਐਸਾ ਨਾਮੁ ਨਿਰੰਜਨੁ ਹੋਇ ॥
ਜੇ ਕੋ ਮੰਨਿ ਜਾਣੈ ਮਨਿ ਕੋਇ ॥੧੩॥

ਮੰਨੈ ਮਾਰਗਿ ਠਾਕ ਨ ਪਾਇ ॥
ਮੰਨੈ ਪਤਿ ਸਿਉ ਪਰਗਟੁ ਜਾਇ ॥
ਮੰਨੈ ਮਗੁ ਨ ਚਲੈ ਪੰਥੁ ॥
ਮੰਨੈ ਧਰਮ ਸੇਤੀ ਸਨਬੰਧੁ ॥
ਐਸਾ ਨਾਮੁ ਨਿਰੰਜਨੁ ਹੋਇ ॥
ਜੇ ਕੋ ਮੰਨਿ ਜਾਣੈ ਮਨਿ ਕੋਇ ॥੧੪॥

ਮੰਨੈ ਪਾਵਹਿ ਮੋਖੁ ਦੁਆਰੁ ॥
ਮੰਨੈ ਪਰਵਾਰੈ ਸਾਧਾਰੁ ॥
ਮੰਨੈ ਤਰੈ ਤਾਰੇ ਗੁਰੁ ਸਿਖ ॥
ਮੰਨੈ ਨਾਨਕ ਭਵਹਿ ਨ ਭਿਖ ॥
ਐਸਾ ਨਾਮੁ ਨਿਰੰਜਨੁ ਹੋਇ ॥
ਜੇ ਕੋ ਮੰਨਿ ਜਾਣੈ ਮਨਿ ਕੋਇ ॥੧੫॥

ਪੰਚ ਪਰਵਾਣ ਪੰਚ ਪਰਧਾਨੁ ॥
ਪੰਚੇ ਪਾਵਹਿ ਦਰਗਹਿ ਮਾਨੁ ॥
ਪੰਚੇ ਸੋਹਹਿ ਦਰਿ ਰਾਜਾਨੁ ॥
ਪੰਚਾ ਕਾ ਗੁਰੁ ਏਕੁ ਧਿਆਨੁ ॥
ਜੇ ਕੋ ਕਹੈ ਕਰੈ ਵੀਚਾਰੁ ॥
ਕਰਤੇ ਕੈ ਕਰਣੈ ਨਾਹੀ ਸੁਮਾਰੁ ॥
ਧੌਲੁ ਧਰਮੁ ਦਇਆ ਕਾ ਪੂਤੁ ॥
ਸੰਤੋਖੁ ਥਾਪਿ ਰਖਿਆ ਜਿਨਿ ਸੂਤਿ ॥
ਜੇ ਕੋ ਬੁਝੈ ਹੋਵੈ ਸਚਿਆਰੁ ॥
ਧਵਲੈ ਉਪਰਿ ਕੇਤਾ ਭਾਰੁ ॥
ਧਰਤੀ ਹੋਰੁ ਪਰੈ ਹੋਰੁ ਹੋਰੁ ॥
ਤਿਸ ਤੇ ਭਾਰੁ ਤਲੈ ਕਵਣੁ ਜੋਰੁ ॥
ਜੀਅ ਜਾਤਿ ਰੰਗਾ ਕੇ ਨਾਵ ॥
ਸਭਨਾ ਲਿਖਿਆ ਵੁੜੀ ਕਲਾਮ ॥
ਏਹੁ ਲੇਖਾ ਲਿਖਿ ਜਾਣੈ ਕੋਇ ॥
ਲੇਖਾ ਲਿਖਿਆ ਕੇਤਾ ਹੋਇ ॥
ਕੇਤਾ ਤਾਣੁ ਸੁਆਲਿਹੁ ਰੂਪੁ ॥
ਕੇਤੀ ਦਾਤਿ ਜਾਣੈ ਕੌਣੁ ਕੂਤੁ ॥
ਕੀਤਾ ਪਸਾਉ ਏਕੋ ਕਵਾਉ ॥
ਤਿਸ ਤੇ ਹੋਏ ਲਖ ਦਰੀਆਉ ॥
ਕੁਦਰਤਿ ਕਵਣ ਕਹਾ ਵੀਚਾਰੁ ॥
ਵਾਰਿਆ ਨ ਜਾਵਾ ਏਕ ਵਾਰ ॥
ਜੋ ਤੁਧੁ ਭਾਵੈ ਸਾਈ ਭਲੀ ਕਾਰ ॥
ਤੂ ਸਦਾ ਸਲਾਮਤਿ ਨਿਰੰਕਾਰ ॥੧੬॥

ਅਸੰਖ ਜਪ ਅਸੰਖ ਭਾਉ ॥
ਅਸੰਖ ਪੂਜਾ ਅਸੰਖ ਤਪ ਤਾਉ ॥
ਅਸੰਖ ਗਰੰਥ ਮੁਖਿ ਵੇਦ ਪਾਠ ॥
ਅਸੰਖ ਜੋਗ ਮਨਿ ਰਹਹਿ ਉਦਾਸ ॥
ਅਸੰਖ ਭਗਤ ਗੁਣ ਗਿਆਨ ਵੀਚਾਰ ॥
ਅਸੰਖ ਸਤੀ ਅਸੰਖ ਦਾਤਾਰ ॥
ਅਸੰਖ ਸੂਰ ਮੁਹ ਭਖ ਸਾਰ ॥
ਅਸੰਖ ਮੋਨਿ ਲਿਵ ਲਾਇ ਤਾਰ ॥
ਕੁਦਰਤਿ ਕਵਣ ਕਹਾ ਵੀਚਾਰੁ ॥
ਵਾਰਿਆ ਨ ਜਾਵਾ ਏਕ ਵਾਰ ॥
ਜੋ ਤੁਧੁ ਭਾਵੈ ਸਾਈ ਭਲੀ ਕਾਰ ॥
ਤੂ ਸਦਾ ਸਲਾਮਤਿ ਨਿਰੰਕਾਰ ॥੧੭॥

ਅਸੰਖ ਮੂਰਖ ਅੰਧ ਘੋਰ ॥
ਅਸੰਖ ਚੋਰ ਹਰਾਮਖੋਰ ॥
ਅਸੰਖ ਅਮਰ ਕਰਿ ਜਾਹਿ ਜੋਰ ॥
ਅਸੰਖ ਗਲਵਢ ਹਤਿਆ ਕਮਾਹਿ ॥
ਅਸੰਖ ਪਾਪੀ ਪਾਪੁ ਕਰਿ ਜਾਹਿ ॥
ਅਸੰਖ ਕੂੜਿਆਰ ਕੂੜੇ ਫਿਰਾਹਿ ॥
ਅਸੰਖ ਮਲੇਛ ਮਲੁ ਭਖਿ ਖਾਹਿ ॥
ਅਸੰਖ ਨਿੰਦਕ ਸਿਰਿ ਕਰਹਿ ਭਾਰੁ ॥
ਨਾਨਕੁ ਨੀਚੁ ਕਹੈ ਵੀਚਾਰੁ ॥
ਵਾਰਿਆ ਨ ਜਾਵਾ ਏਕ ਵਾਰ ॥
ਜੋ ਤੁਧੁ ਭਾਵੈ ਸਾਈ ਭਲੀ ਕਾਰ ॥
ਤੂ ਸਦਾ ਸਲਾਮਤਿ ਨਿਰੰਕਾਰ ॥੧੮॥

ਅਸੰਖ ਨਾਵ ਅਸੰਖ ਥਾਵ ॥
ਅਗੰਮ ਅਗੰਮ ਅਸੰਖ ਲੋਅ ॥
ਅਸੰਖ ਕਹਹਿ ਸਿਰਿ ਭਾਰੁ ਹੋਇ ॥
ਅਖਰੀ ਨਾਮੁ ਅਖਰੀ ਸਾਲਾਹ ॥
ਅਖਰੀ ਗਿਆਨੁ ਗੀਤ ਗੁਣ ਗਾਹ ॥
ਅਖਰੀ ਲਿਖਣੁ ਬੋਲਣੁ ਬਾਣਿ ॥
ਅਖਰਾ ਸਿਰਿ ਸੰਜੋਗੁ ਵਖਾਣਿ ॥
ਜਿਨਿ ਏਹਿ ਲਿਖੇ ਤਿਸੁ ਸਿਰਿ ਨਾਹਿ ॥
ਜਿਵ ਫੁਰਮਾਏ ਤਿਵ ਤਿਵ ਪਾਹਿ ॥
ਜੇਤਾ ਕੀਤਾ ਤੇਤਾ ਨਾਉ ॥
ਵਿਣੁ ਨਾਵੈ ਨਾਹੀ ਕੋ ਥਾਉ ॥
ਕੁਦਰਤਿ ਕਵਣ ਕਹਾ ਵੀਚਾਰੁ ॥
ਵਾਰਿਆ ਨ ਜਾਵਾ ਏਕ ਵਾਰ ॥
ਜੋ ਤੁਧੁ ਭਾਵੈ ਸਾਈ ਭਲੀ ਕਾਰ ॥
ਤੂ ਸਦਾ ਸਲਾਮਤਿ ਨਿਰੰਕਾਰ ॥੧੯॥

ਭਰੀਐ ਹਥੁ ਪੈਰੁ ਤਨੁ ਦੇਹ ॥
ਪਾਣੀ ਧੋਤੈ ਉਤਰਸੁ ਖੇਹ ॥
ਮੂਤ ਪਲੀਤੀ ਕਪੜੁ ਹੋਇ ॥
ਦੇ ਸਾਬੂਣੁ ਲਈਐ ਓਹੁ ਧੋਇ ॥
ਭਰੀਐ ਮਤਿ ਪਾਪਾ ਕੈ ਸੰਗਿ ॥
ਓਹੁ ਧੋਪੈ ਨਾਵੈ ਕੈ ਰੰਗਿ ॥
ਪੁੰਨੀ ਪਾਪੀ ਆਖਣੁ ਨਾਹਿ ॥
ਕਰਿ ਕਰਿ ਕਰਣਾ ਲਿਖਿ ਲੈ ਜਾਹੁ ॥
ਆਪੇ ਬੀਜਿ ਆਪੇ ਹੀ ਖਾਹੁ ॥
ਨਾਨਕ ਹੁਕਮੀ ਆਵਹੁ ਜਾਹੁ ॥੨੦॥

ਤੀਰਥੁ ਤਪੁ ਦਇਆ ਦਤੁ ਦਾਨੁ ॥
ਜੇ ਕੋ ਪਾਵੈ ਤਿਲ ਕਾ ਮਾਨੁ ॥
ਸੁਣਿਆ ਮੰਨਿਆ ਮਨਿ ਕੀਤਾ ਭਾਉ ॥
ਅੰਤਰਗਤਿ ਤੀਰਥਿ ਮਲਿ ਨਾਉ ॥
ਸਭਿ ਗੁਣ ਤੇਰੇ ਮੈ ਨਾਹੀ ਕੋਇ ॥
ਵਿਣੁ ਗੁਣ ਕੀਤੇ ਭਗਤਿ ਨ ਹੋਇ ॥
ਸੁਅਸਤਿ ਆਥਿ ਬਾਣੀ ਬਰਮਾਉ ॥
ਸਤਿ ਸੁਹਾਣੁ ਸਦਾ ਮਨਿ ਚਾਉ ॥
ਕਵਣੁ ਸੁ ਵੇਲਾ ਵਖਤੁ ਕਵਣੁ ਕਵਣ ਥਿਤਿ ਕਵਣੁ ਵਾਰੁ ॥
ਕਵਣਿ ਸਿ ਰੁਤੀ ਮਾਹੁ ਕਵਣੁ ਜਿਤੁ ਹੋਆ ਆਕਾਰੁ ॥
ਵੇਲ ਨ ਪਾਈਆ ਪੰਡਤੀ ਜਿ ਹੋਵੈ ਲੇਖੁ ਪੁਰਾਣੁ ॥
ਵਖਤੁ ਨ ਪਾਇਓ ਕਾਦੀਆ ਜਿ ਲਿਖਨਿ ਲੇਖੁ ਕੁਰਾਣੁ ॥
ਥਿਤਿ ਵਾਰੁ ਨਾ ਜੋਗੀ ਜਾਣੈ ਰੁਤਿ ਮਾਹੁ ਨਾ ਕੋਈ ॥
ਜਾ ਕਰਤਾ ਸਿਰਠੀ ਕਉ ਸਾਜੇ ਆਪੇ ਜਾਣੈ ਸੋਈ ॥
ਕਿਵ ਕਰਿ ਆਖਾ ਕਿਵ ਸਾਲਾਹੀ ਕਿਉ ਵਰਨੀ ਕਿਵ ਜਾਣਾ ॥
ਨਾਨਕ ਆਖਣਿ ਸਭੁ ਕੋ ਆਖੈ ਇਕ ਦੂ ਇਕੁ ਸਿਆਣਾ ॥
ਵਡਾ ਸਾਹਿਬੁ ਵਡੀ ਨਾਈ ਕੀਤਾ ਜਾ ਕਾ ਹੋਵੈ ॥
ਨਾਨਕ ਜੇ ਕੋ ਆਪੌ ਜਾਣੈ ਅਗੈ ਗਇਆ ਨ ਸੋਹੈ ॥੨੧॥

ਪਾਤਾਲਾ ਪਾਤਾਲ ਲਖ ਆਗਾਸਾ ਆਗਾਸ ॥
ਓੜਕ ਓੜਕ ਭਾਲਿ ਥਕੇ ਵੇਦ ਕਹਨਿ ਇਕ ਵਾਤ ॥
ਸਹਸ ਅਠਾਰਹ ਕਹਨਿ ਕਤੇਬਾ ਅਸੁਲੂ ਇਕੁ ਧਾਤੁ ॥
ਲੇਖਾ ਹੋਇ ਤ ਲਿਖੀਐ ਲੇਖੈ ਹੋਇ ਵਿਣਾਸੁ ॥
ਨਾਨਕ ਵਡਾ ਆਖੀਐ ਆਪੇ ਜਾਣੈ ਆਪੁ ॥੨੨॥

ਸਾਲਾਹੀ ਸਾਲਾਹਿ ਏਤੀ ਸੁਰਤਿ ਨ ਪਾਈਆ ॥
ਨਦੀਆ ਅਤੈ ਵਾਹ ਪਵਹਿ ਸਮੁੰਦਿ ਨ ਜਾਣੀਅਹਿ ॥
ਸਮੁੰਦ ਸਾਹ ਸੁਲਤਾਨ ਗਿਰਹਾ ਸੇਤੀ ਮਾਲੁ ਧਨੁ ॥
ਕੀੜੀ ਤੁਲਿ ਨ ਹੋਵਨੀ ਜੇ ਤਿਸੁ ਮਨਹੁ ਨ ਵੀਸਰਹਿ ॥੨੩॥

ਅੰਤੁ ਨ ਸਿਫਤੀ ਕਹਣਿ ਨ ਅੰਤੁ ॥
ਅੰਤੁ ਨ ਕਰਣੈ ਦੇਣਿ ਨ ਅੰਤੁ ॥
ਅੰਤੁ ਨ ਵੇਖਣਿ ਸੁਣਣਿ ਨ ਅੰਤੁ ॥
ਅੰਤੁ ਨ ਜਾਪੈ ਕਿਆ ਮਨਿ ਮੰਤੁ ॥
ਅੰਤੁ ਨ ਜਾਪੈ ਕੀਤਾ ਆਕਾਰੁ ॥
ਅੰਤੁ ਨ ਜਾਪੈ ਪਾਰਾਵਾਰੁ ॥
ਅੰਤ ਕਾਰਣਿ ਕੇਤੇ ਬਿਲਲਾਹਿ ॥
ਤਾ ਕੇ ਅੰਤ ਨ ਪਾਏ ਜਾਹਿ ॥
ਏਹੁ ਅੰਤੁ ਨ ਜਾਣੈ ਕੋਇ ॥
ਬਹੁਤਾ ਕਹੀਐ ਬਹੁਤਾ ਹੋਇ ॥
ਵਡਾ ਸਾਹਿਬੁ ਊਚਾ ਥਾਉ ॥
ਊਚੇ ਉਪਰਿ ਊਚਾ ਨਾਉ ॥
ਏਵਡੁ ਊਚਾ ਹੋਵੈ ਕੋਇ ॥
ਤਿਸੁ ਊਚੇ ਕਉ ਜਾਣੈ ਸੋਇ ॥
ਜੇਵਡੁ ਆਪਿ ਜਾਣੈ ਆਪਿ ਆਪਿ ॥
ਨਾਨਕ ਨਦਰੀ ਕਰਮੀ ਦਾਤਿ ॥੨੪॥

ਬਹੁਤਾ ਕਰਮੁ ਲਿਖਿਆ ਨਾ ਜਾਇ ॥
ਵਡਾ ਦਾਤਾ ਤਿਲੁ ਨ ਤਮਾਇ ॥
ਕੇਤੇ ਮੰਗਹਿ ਜੋਧ ਅਪਾਰ ॥
ਕੇਤਿਆ ਗਣਤ ਨਹੀ ਵੀਚਾਰੁ ॥
ਕੇਤੇ ਖਪਿ ਤੁਟਹਿ ਵੇਕਾਰ ॥
ਕੇਤੇ ਲੈ ਲੈ ਮੁਕਰੁ ਪਾਹਿ ॥
ਕੇਤੇ ਮੂਰਖ ਖਾਹੀ ਖਾਹਿ ॥
ਕੇਤਿਆ ਦੂਖ ਭੂਖ ਸਦ ਮਾਰ ॥
ਏਹਿ ਭਿ ਦਾਤਿ ਤੇਰੀ ਦਾਤਾਰ ॥
ਬੰਦਿ ਖਲਾਸੀ ਭਾਣੈ ਹੋਇ ॥
ਹੋਰੁ ਆਖਿ ਨ ਸਕੈ ਕੋਇ ॥
ਜੇ ਕੋ ਖਾਇਕੁ ਆਖਣਿ ਪਾਇ ॥
ਓਹੁ ਜਾਣੈ ਜੇਤੀਆ ਮੁਹਿ ਖਾਇ ॥
ਆਪੇ ਜਾਣੈ ਆਪੇ ਦੇਇ ॥
ਆਖਹਿ ਸਿ ਭਿ ਕੇਈ ਕੇਇ ॥
ਜਿਸ ਨੋ ਬਖਸੇ ਸਿਫਤਿ ਸਾਲਾਹ ॥
ਨਾਨਕ ਪਾਤਿਸਾਹੀ ਪਾਤਿਸਾਹੁ ॥੨੫॥

ਅਮੁਲ ਗੁਣ ਅਮੁਲ ਵਾਪਾਰ ॥
ਅਮੁਲ ਵਾਪਾਰੀਏ ਅਮੁਲ ਭੰਡਾਰ ॥
ਅਮੁਲ ਆਵਹਿ ਅਮੁਲ ਲੈ ਜਾਹਿ ॥
ਅਮੁਲ ਭਾਇ ਅਮੁਲਾ ਸਮਾਹਿ ॥
ਅਮੁਲੁ ਧਰਮੁ ਅਮੁਲੁ ਦੀਬਾਣੁ ॥
ਅਮੁਲੁ ਤੁਲੁ ਅਮੁਲੁ ਪਰਵਾਣੁ ॥
ਅਮੁਲੁ ਬਖਸੀਸ ਅਮੁਲੁ ਨੀਸਾਣੁ ॥
ਅਮੁਲੁ ਕਰਮੁ ਅਮੁਲੁ ਫੁਰਮਾਣੁ ॥
ਅਮੁਲੋ ਅਮੁਲੁ ਆਖਿਆ ਨ ਜਾਇ ॥
ਆਖਿ ਆਖਿ ਰਹੇ ਲਿਵ ਲਾਇ ॥
ਆਖਹਿ ਵੇਦ ਪਾਠ ਪੁਰਾਣ ॥
ਆਖਹਿ ਪੜੇ ਕਰਹਿ ਵਖਿਆਣ ॥
ਆਖਹਿ ਬਰਮੇ ਆਖਹਿ ਇੰਦ ॥
ਆਖਹਿ ਗੋਪੀ ਤੈ ਗੋਵਿੰਦ ॥
ਆਖਹਿ ਈਸਰ ਆਖਹਿ ਸਿਧ ॥
ਆਖਹਿ ਕੇਤੇ ਕੀਤੇ ਬੁਧ ॥
ਆਖਹਿ ਦਾਨਵ ਆਖਹਿ ਦੇਵ ॥
ਆਖਹਿ ਸੁਰਿ ਨਰ ਮੁਨਿ ਜਨ ਸੇਵ ॥
ਕੇਤੇ ਆਖਹਿ ਆਖਣਿ ਪਾਹਿ ॥
ਕੇਤੇ ਕਹਿ ਕਹਿ ਉਠਿ ਉਠਿ ਜਾਹਿ ॥
ਏਤੇ ਕੀਤੇ ਹੋਰਿ ਕਰੇਹਿ ॥
ਤਾ ਆਖਿ ਨ ਸਕਹਿ ਕੇਈ ਕੇਇ ॥
ਜੇਵਡੁ ਭਾਵੈ ਤੇਵਡੁ ਹੋਇ ॥
ਨਾਨਕ ਜਾਣੈ ਸਾਚਾ ਸੋਇ ॥
ਜੇ ਕੋ ਆਖੈ ਬੋਲੁਵਿਗਾੜੁ ॥
ਤਾ ਲਿਖੀਐ ਸਿਰਿ ਗਾਵਾਰਾ ਗਾਵਾਰੁ ॥੨੬॥

ਸੋ ਦਰੁ ਕੇਹਾ ਸੋ ਘਰੁ ਕੇਹਾ ਜਿਤੁ ਬਹਿ ਸਰਬ ਸਮਾਲੇ ॥
ਵਾਜੇ ਨਾਦ ਅਨੇਕ ਅਸੰਖਾ ਕੇਤੇ ਵਾਵਣਹਾਰੇ ॥
ਕੇਤੇ ਰਾਗ ਪਰੀ ਸਿਉ ਕਹੀਅਨਿ ਕੇਤੇ ਗਾਵਣਹਾਰੇ ॥
ਗਾਵਹਿ ਤੁਹਨੋ ਪਉਣੁ ਪਾਣੀ ਬੈਸੰਤਰੁ ਗਾਵੈ ਰਾਜਾ ਧਰਮੁ ਦੁਆਰੇ ॥
ਗਾਵਹਿ ਚਿਤੁ ਗੁਪਤੁ ਲਿਖਿ ਜਾਣਹਿ ਲਿਖਿ ਲਿਖਿ ਧਰਮੁ ਵੀਚਾਰੇ ॥
ਗਾਵਹਿ ਈਸਰੁ ਬਰਮਾ ਦੇਵੀ ਸੋਹਨਿ ਸਦਾ ਸਵਾਰੇ ॥
ਗਾਵਹਿ ਇੰਦ ਇਦਾਸਣਿ ਬੈਠੇ ਦੇਵਤਿਆ ਦਰਿ ਨਾਲੇ ॥
ਗਾਵਹਿ ਸਿਧ ਸਮਾਧੀ ਅੰਦਰਿ ਗਾਵਨਿ ਸਾਧ ਵਿਚਾਰੇ ॥
ਗਾਵਨਿ ਜਤੀ ਸਤੀ ਸੰਤੋਖੀ ਗਾਵਹਿ ਵੀਰ ਕਰਾਰੇ ॥
ਗਾਵਨਿ ਪੰਡਿਤ ਪੜਨਿ ਰਖੀਸਰ ਜੁਗੁ ਜੁਗੁ ਵੇਦਾ ਨਾਲੇ ॥
ਗਾਵਹਿ ਮੋਹਣੀਆ ਮਨੁ ਮੋਹਨਿ ਸੁਰਗਾ ਮਛ ਪਇਆਲੇ ॥
ਗਾਵਨਿ ਰਤਨ ਉਪਾਏ ਤੇਰੇ ਅਠਸਠਿ ਤੀਰਥ ਨਾਲੇ ॥
ਗਾਵਹਿ ਜੋਧ ਮਹਾਬਲ ਸੂਰਾ ਗਾਵਹਿ ਖਾਣੀ ਚਾਰੇ ॥
ਗਾਵਹਿ ਖੰਡ ਮੰਡਲ ਵਰਭੰਡਾ ਕਰਿ ਕਰਿ ਰਖੇ ਧਾਰੇ ॥
ਸੇਈ ਤੁਧੁਨੋ ਗਾਵਹਿ ਜੋ ਤੁਧੁ ਭਾਵਨਿ ਰਤੇ ਤੇਰੇ ਭਗਤ ਰਸਾਲੇ ॥
ਹੋਰਿ ਕੇਤੇ ਗਾਵਨਿ ਸੇ ਮੈ ਚਿਤਿ ਨ ਆਵਨਿ ਨਾਨਕੁ ਕਿਆ ਵੀਚਾਰੇ ॥
ਸੋਈ ਸੋਈ ਸਦਾ ਸਚੁ ਸਾਹਿਬੁ ਸਾਚਾ ਸਾਚੀ ਨਾਈ ॥
ਹੈ ਭੀ ਹੋਸੀ ਜਾਇ ਨ ਜਾਸੀ ਰਚਨਾ ਜਿਨਿ ਰਚਾਈ ॥
ਰੰਗੀ ਰੰਗੀ ਭਾਤੀ ਕਰਿ ਕਰਿ ਜਿਨਸੀ ਮਾਇਆ ਜਿਨਿ ਉਪਾਈ ॥
ਕਰਿ ਕਰਿ ਵੇਖੈ ਕੀਤਾ ਆਪਣਾ ਜਿਵ ਤਿਸ ਦੀ ਵਡਿਆਈ ॥
ਜੋ ਤਿਸੁ ਭਾਵੈ ਸੋਈ ਕਰਸੀ ਹੁਕਮੁ ਨ ਕਰਣਾ ਜਾਈ ॥
ਸੋ ਪਾਤਿਸਾਹੁ ਸਾਹਾ ਪਾਤਿਸਾਹਿਬੁ ਨਾਨਕ ਰਹਣੁ ਰਜਾਈ ॥੨੭॥

ਮੁੰਦਾ ਸੰਤੋਖੁ ਸਰਮੁ ਪਤੁ ਝੋਲੀ ਧਿਆਨ ਕੀ ਕਰਹਿ ਬਿਭੂਤਿ ॥
ਖਿੰਥਾ ਕਾਲੁ ਕੁਆਰੀ ਕਾਇਆ ਜੁਗਤਿ ਡੰਡਾ ਪਰਤੀਤਿ ॥
ਆਈ ਪੰਥੀ ਸਗਲ ਜਮਾਤੀ ਮਨਿ ਜੀਤੈ ਜਗੁ ਜੀਤੁ ॥
ਆਦੇਸੁ ਤਿਸੈ ਆਦੇਸੁ ॥
ਆਦਿ ਅਨੀਲੁ ਅਨਾਦਿ ਅਨਾਹਤਿ ਜੁਗੁ ਜੁਗੁ ਏਕੋ ਵੇਸੁ ॥੨੮॥

ਭੁਗਤਿ ਗਿਆਨੁ ਦਇਆ ਭੰਡਾਰਣਿ ਘਟਿ ਘਟਿ ਵਾਜਹਿ ਨਾਦ ॥
ਆਪਿ ਨਾਥੁ ਨਾਥੀ ਸਭ ਜਾ ਕੀ ਰਿਧਿ ਸਿਧਿ ਅਵਰਾ ਸਾਦ ॥
ਸੰਜੋਗੁ ਵਿਜੋਗੁ ਦੁਇ ਕਾਰ ਚਲਾਵਹਿ ਲੇਖੇ ਆਵਹਿ ਭਾਗ ॥
ਆਦੇਸੁ ਤਿਸੈ ਆਦੇਸੁ ॥
ਆਦਿ ਅਨੀਲੁ ਅਨਾਦਿ ਅਨਾਹਤਿ ਜੁਗੁ ਜੁਗੁ ਏਕੋ ਵੇਸੁ ॥੨੯॥

ਏਕਾ ਮਾਈ ਜੁਗਤਿ ਵਿਆਈ ਤਿਨਿ ਚੇਲੇ ਪਰਵਾਣੁ ॥
ਇਕੁ ਸੰਸਾਰੀ ਇਕੁ ਭੰਡਾਰੀ ਇਕੁ ਲਾਏ ਦੀਬਾਣੁ ॥
ਜਿਵ ਤਿਸੁ ਭਾਵੈ ਤਿਵੈ ਚਲਾਵੈ ਜਿਵ ਹੋਵੈ ਫੁਰਮਾਣੁ ॥
ਓਹੁ ਵੇਖੈ ਓਨਾ ਨਦਰਿ ਨ ਆਵੈ ਬਹੁਤਾ ਏਹੁ ਵਿਡਾਣੁ ॥
ਆਦੇਸੁ ਤਿਸੈ ਆਦੇਸੁ ॥
ਆਦਿ ਅਨੀਲੁ ਅਨਾਦਿ ਅਨਾਹਤਿ ਜੁਗੁ ਜੁਗੁ ਏਕੋ ਵੇਸੁ ॥੩੦॥

ਆਸਣੁ ਲੋਇ ਲੋਇ ਭੰਡਾਰ ॥
ਜੋ ਕਿਛੁ ਪਾਇਆ ਸੁ ਏਕਾ ਵਾਰ ॥
ਕਰਿ ਕਰਿ ਵੇਖੈ ਸਿਰਜਣਹਾਰੁ ॥
ਨਾਨਕ ਸਚੇ ਕੀ ਸਾਚੀ ਕਾਰ ॥
ਆਦੇਸੁ ਤਿਸੈ ਆਦੇਸੁ ॥
ਆਦਿ ਅਨੀਲੁ ਅਨਾਦਿ ਅਨਾਹਤਿ ਜੁਗੁ ਜੁਗੁ ਏਕੋ ਵੇਸੁ ॥੩੧॥

ਇਕ ਦੂ ਜੀਭੌ ਲਖ ਹੋਹਿ ਲਖ ਹੋਵਹਿ ਲਖ ਵੀਸ ॥
ਲਖੁ ਲਖੁ ਗੇੜਾ ਆਖੀਅਹਿ ਏਕੁ ਨਾਮੁ ਜਗਦੀਸ ॥
ਏਤੁ ਰਾਹਿ ਪਤਿ ਪਵੜੀਆ ਚੜੀਐ ਹੋਇ ਇਕੀਸ ॥
ਸੁਣਿ ਗਲਾ ਆਕਾਸ ਕੀ ਕੀਟਾ ਆਈ ਰੀਸ ॥
ਨਾਨਕ ਨਦਰੀ ਪਾਈਐ ਕੂੜੀ ਕੂੜੈ ਠੀਸ ॥੩੨॥

ਆਖਣਿ ਜੋਰੁ ਚੁਪੈ ਨਹ ਜੋਰੁ ॥
ਜੋਰੁ ਨ ਮੰਗਣਿ ਦੇਣਿ ਨ ਜੋਰੁ ॥
ਜੋਰੁ ਨ ਜੀਵਣਿ ਮਰਣਿ ਨਹ ਜੋਰੁ ॥
ਜੋਰੁ ਨ ਰਾਜਿ ਮਾਲਿ ਮਨਿ ਸੋਰੁ ॥
ਜੋਰੁ ਨ ਸੁਰਤੀ ਗਿਆਨਿ ਵੀਚਾਰਿ ॥
ਜੋਰੁ ਨ ਜੁਗਤੀ ਛੁਟੈ ਸੰਸਾਰੁ ॥
ਜਿਸੁ ਹਥਿ ਜੋਰੁ ਕਰਿ ਵੇਖੈ ਸੋਇ ॥
ਨਾਨਕ ਉਤਮੁ ਨੀਚੁ ਨ ਕੋਇ ॥੩੩॥

ਰਾਤੀ ਰੁਤੀ ਥਿਤੀ ਵਾਰ ॥
ਪਵਣ ਪਾਣੀ ਅਗਨੀ ਪਾਤਾਲ ॥
ਤਿਸੁ ਵਿਚਿ ਧਰਤੀ ਥਾਪਿ ਰਖੀ ਧਰਮ ਸਾਲ ॥
ਤਿਸੁ ਵਿਚਿ ਜੀਅ ਜੁਗਤਿ ਕੇ ਰੰਗ ॥
ਤਿਨ ਕੇ ਨਾਮ ਅਨੇਕ ਅਨੰਤ ॥
ਕਰਮੀ ਕਰਮੀ ਹੋਇ ਵੀਚਾਰੁ ॥
ਸਚਾ ਆਪਿ ਸਚਾ ਦਰਬਾਰੁ ॥
ਤਿਥੈ ਸੋਹਨਿ ਪੰਚ ਪਰਵਾਣੁ ॥
ਨਦਰੀ ਕਰਮਿ ਪਵੈ ਨੀਸਾਣੁ ॥
ਕਚ ਪਕਾਈ ਓਥੈ ਪਾਇ ॥
ਨਾਨਕ ਗਇਆ ਜਾਪੈ ਜਾਇ ॥੩੪॥

ਧਰਮ ਖੰਡ ਕਾ ਏਹੋ ਧਰਮੁ ॥
ਗਿਆਨ ਖੰਡ ਕਾ ਆਖਹੁ ਕਰਮੁ ॥
ਕੇਤੇ ਪਵਣ ਪਾਣੀ ਵੈਸੰਤਰ ਕੇਤੇ ਕਾਨ ਮਹੇਸ ॥
ਕੇਤੇ ਬਰਮੇ ਘਾੜਤਿ ਘੜੀਅਹਿ ਰੂਪ ਰੰਗ ਕੇ ਵੇਸ ॥
ਕੇਤੀਆ ਕਰਮ ਭੂਮੀ ਮੇਰ ਕੇਤੇ ਕੇਤੇ ਧੂ ਉਪਦੇਸ ॥
ਕੇਤੇ ਇੰਦ ਚੰਦ ਸੂਰ ਕੇਤੇ ਕੇਤੇ ਮੰਡਲ ਦੇਸ ॥
ਕੇਤੇ ਸਿਧ ਬੁਧ ਨਾਥ ਕੇਤੇ ਕੇਤੇ ਦੇਵੀ ਵੇਸ ॥
ਕੇਤੇ ਦੇਵ ਦਾਨਵ ਮੁਨਿ ਕੇਤੇ ਕੇਤੇ ਰਤਨ ਸਮੁੰਦ ॥
ਕੇਤੀਆ ਖਾਣੀ ਕੇਤੀਆ ਬਾਣੀ ਕੇਤੇ ਪਾਤ ਨਰਿੰਦ ॥
ਕੇਤੀਆ ਸੁਰਤੀ ਸੇਵਕ ਕੇਤੇ ਨਾਨਕ ਅੰਤੁ ਨ ਅੰਤੁ ॥੩੫॥

ਗਿਆਨ ਖੰਡ ਮਹਿ ਗਿਆਨੁ ਪਰਚੰਡੁ ॥
ਤਿਥੈ ਨਾਦ ਬਿਨੋਦ ਕੋਡ ਅਨੰਦੁ ॥
ਸਰਮ ਖੰਡ ਕੀ ਬਾਣੀ ਰੂਪੁ ॥
ਤਿਥੈ ਘਾੜਤਿ ਘੜੀਐ ਬਹੁਤੁ ਅਨੂਪੁ ॥
ਤਾ ਕੀਆ ਗਲਾ ਕਥੀਆ ਨਾ ਜਾਹਿ ॥
ਜੇ ਕੋ ਕਹੈ ਪਿਛੈ ਪਛੁਤਾਇ ॥
ਤਿਥੈ ਘੜੀਐ ਸੁਰਤਿ ਮਤਿ ਮਨਿ ਬੁਧਿ ॥
ਤਿਥੈ ਘੜੀਐ ਸੁਰਾ ਸਿਧਾ ਕੀ ਸੁਧਿ ॥੩੬॥

ਕਰਮ ਖੰਡ ਕੀ ਬਾਣੀ ਜੋਰੁ ॥
ਤਿਥੈ ਹੋਰੁ ਨ ਕੋਈ ਹੋਰੁ ॥
ਤਿਥੈ ਜੋਧ ਮਹਾਬਲ ਸੂਰ ॥
ਤਿਨ ਮਹਿ ਰਾਮੁ ਰਹਿਆ ਭਰਪੂਰ ॥
ਤਿਥੈ ਸੀਤੋ ਸੀਤਾ ਮਹਿਮਾ ਮਾਹਿ ॥
ਤਾ ਕੇ ਰੂਪ ਨ ਕਥਨੇ ਜਾਹਿ ॥
ਨਾ ਓਹਿ ਮਰਹਿ ਨ ਠਾਗੇ ਜਾਹਿ ॥
ਜਿਨ ਕੈ ਰਾਮੁ ਵਸੈ ਮਨ ਮਾਹਿ ॥
ਤਿਥੈ ਭਗਤ ਵਸਹਿ ਕੇ ਲੋਅ ॥
ਕਰਹਿ ਅਨੰਦੁ ਸਚਾ ਮਨਿ ਸੋਇ ॥
ਸਚ ਖੰਡਿ ਵਸੈ ਨਿਰੰਕਾਰੁ ॥
ਕਰਿ ਕਰਿ ਵੇਖੈ ਨਦਰਿ ਨਿਹਾਲ ॥
ਤਿਥੈ ਖੰਡ ਮੰਡਲ ਵਰਭੰਡ ॥
ਜੇ ਕੋ ਕਥੈ ਤ ਅੰਤ ਨ ਅੰਤ ॥
ਤਿਥੈ ਲੋਅ ਲੋਅ ਆਕਾਰ ॥
ਜਿਵ ਜਿਵ ਹੁਕਮੁ ਤਿਵੈ ਤਿਵ ਕਾਰ ॥
ਵੇਖੈ ਵਿਗਸੈ ਕਰਿ ਵੀਚਾਰੁ ॥
ਨਾਨਕ ਕਥਨਾ ਕਰੜਾ ਸਾਰੁ ॥੩੭॥

ਜਤੁ ਪਾਹਾਰਾ ਧੀਰਜੁ ਸੁਨਿਆਰੁ ॥
ਅਹਰਣਿ ਮਤਿ ਵੇਦੁ ਹਥੀਆਰੁ ॥
ਭਉ ਖਲਾ ਅਗਨਿ ਤਪ ਤਾਉ ॥
ਭਾਂਡਾ ਭਾਉ ਅੰਮ੍ਰਿਤੁ ਤਿਤੁ ਢਾਲਿ ॥
ਘੜੀਐ ਸਬਦੁ ਸਚੀ ਟਕਸਾਲ ॥
ਜਿਨ ਕਉ ਨਦਰਿ ਕਰਮੁ ਤਿਨ ਕਾਰ ॥
ਨਾਨਕ ਨਦਰੀ ਨਦਰਿ ਨਿਹਾਲ ॥੩੮॥

ਸਲੋਕੁ ॥
ਪਵਣੁ ਗੁਰੂ ਪਾਣੀ ਪਿਤਾ ਮਾਤਾ ਧਰਤਿ ਮਹਤੁ ॥
ਦਿਵਸੁ ਰਾਤਿ ਦੁਇ ਦਾਈ ਦਾਇਆ ਖੇਲੈ ਸਗਲ ਜਗਤੁ ॥
ਚੰਗਿਆਈਆ ਬੁਰਿਆਈਆ ਵਾਚੈ ਧਰਮੁ ਹਦੂਰਿ ॥
ਕਰਮੀ ਆਪੋ ਆਪਣੀ ਕੇ ਨੇੜੈ ਕੇ ਦੂਰਿ ॥
ਜਿਨੀ ਨਾਮੁ ਧਿਆਇਆ ਗਏ ਮਸਕਤਿ ਘਾਲਿ ॥
ਨਾਨਕ ਤੇ ਮੁਖ ਉਜਲੇ ਕੇਤੀ ਛੁਟੀ ਨਾਲਿ ॥੧॥''';

  static const String jaapSahib = '''ਜਾਪੁ ਸਾਹਿਬ
ੴ ਸਤਿਗੁਰ ਪ੍ਰਸਾਦਿ
॥ਜਾਪੁ ॥
ਸ੍ਰੀ ਮੁਖਵਾਕ ਪਾਤਸਾਹੀ ੧੦ ॥
ਛਪੈ ਛੰਦ ॥ ਤ੍ਵਪ੍ਰਸਾਦਿ ॥

ਚਕ੍ਰ ਚਿਹਨ ਅਰੁ ਬਰਨ ਜਾਤਿ ਅਰੁ ਪਾਤਿ ਨਹਿਨ ਜਿਹ ॥
ਰੂਪ ਰੰਗ ਅਰੁ ਰੇਖ ਭੇਖ ਕੋਊ ਕਹਿ ਨ ਸਕਤਿ ਕਿਹ ॥
ਅਚਲ ਮੂਰਤਿ ਅਨਭਵ ਪ੍ਰਕਾਸ ਅਮਿਤੋਜ ਕਹਿਜੈ ॥

ਕੋਟਿ ਇੰਦ੍ਰ ਇੰਦ੍ਰਾਣਿ ਸਾਹੁ ਸਾਹਾਣਿ ਗਣਿਜੈ ॥
ਤ੍ਰਿਭਵਣ ਮਹੀਪ ਸੁਰ ਨਰ ਅਸੁਰ ਨੇਤਿ ਨੇਤਿ ਬਨ ਤ੍ਰਿਣ ਕਹਤ ॥
ਤ੍ਵ ਸਰਬ ਨਾਮ ਕਥੈ ਕਵਨ ਕਰਮ ਨਾਮ ਬਰਣਤ ਸੁਮਤਿ ॥੧॥

ਭੁਜੰਗ ਪ੍ਰਯਾਤ ਛੰਦ ॥ ਨਮਸਤ੍ਵੰ ਅਕਾਲੇ ॥ ਨਮਸਤ੍ਵੰ ਕ੍ਰਿਪਾਲੇ ॥
ਨਮਸਤ੍ਵੰ ਅਰੂਪੇ ॥ ਨਮਸਤ੍ਵੰ ਅਨੂਪੇ ॥੧॥੨॥

ਨਮਸਤੰ ਅਭੇਖੇ ॥ ਨਮਸਤੰ ਅਲੇਖੇ ॥
ਨਮਸਤੰ ਅਕਾਏ ॥ ਨਮਸਤੰ ਅਜਾਏ ॥੨॥੩॥

ਨਮਸਤੰ ਅਗੰਜੇ ॥ ਨਮਸਤੰ ਅਭੰਜੇ ॥
ਨਮਸਤੰ ਅਨਾਮੇ ॥ ਨਮਸਤੰ ਅਠਾਮੇ ॥੩॥੪॥

ਨਮਸਤੰ ਅਕਰਮੰ ॥ ਨਮਸਤੰ ਅਧਰਮੰ ॥
ਨਮਸਤੰ ਅਨਾਮੰ ॥ ਨਮਸਤੰ ਅਧਾਮੰ ॥੪॥੫॥

ਨਮਸਤੰ ਅਜੀਤੇ ॥ ਨਮਸਤੰ ਅਭੀਤੇ ॥
ਨਮਸਤੰ ਅਬਾਹੇ ॥ ਨਮਸਤੰ ਅਢਾਹੇ ॥੫॥੬॥

ਨਮਸਤੰ ਅਨੀਲੇ ॥ ਨਮਸਤੰ ਅਨਾਦੇ ॥
ਨਮਸਤੰ ਅਛੇਦੇ ॥ ਨਮਸਤੰ ਅਗਾਧੇ ॥੬॥੭॥

ਨਮਸਤੰ ਅਗੰਜੇ ॥ ਨਮਸਤੰ ਅਭੰਜੇ ॥
ਨਮਸਤੰ ਉਦਾਰੇ ॥ ਨਮਸਤੰ ਅਪਾਰੇ ॥੭॥੮॥

ਨਮਸਤੰ ਸੁ ਏਕੈ ॥ ਨਮਸਤੰ ਅਨੇਕੈ ॥
ਨਮਸਤੰ ਅਭੂਤੇ ॥ ਨਮਸਤੰ ਅਜੂਪੇ ॥੮॥੯॥

ਨਮਸਤੰ ਨ੍ਰਿਕਰਮੇ ॥ ਨਮਸਤੰ ਨ੍ਰਿਭਰਮੇ ॥
ਨਮਸਤੰ ਨ੍ਰਿਦੇਸੇ ॥ ਨਮਸਤੰ ਨ੍ਰਿਭੇਸੇ ॥੯॥੧੦॥

ਨਮਸਤੰ ਨ੍ਰਿਨਾਮੇ ॥ ਨਮਸਤੰ ਨ੍ਰਿਕਾਮੇ ॥
ਨਮਸਤੰ ਨ੍ਰਿਧਾਤੇ ॥ ਨਮਸਤੰ ਨ੍ਰਿਘਾਤੇ ॥੧੦॥੧੧॥

ਨਮਸਤੰ ਨ੍ਰਿਧੂਤੇ ॥ ਨਮਸਤੰ ਅਭੂਤੇ ॥
ਨਮਸਤੰ ਅਲੋਕੇ ॥ ਨਮਸਤੰ ਅਸੋਕੇ ॥੧੧॥੧੨॥

ਨਮਸਤੰ ਨ੍ਰਿਤਾਪੇ ॥ ਨਮਸਤੰ ਅਥਾਪੇ ॥
ਨਮਸਤੰ ਤ੍ਰਿਮਾਨੇ ॥ ਨਮਸਤੰ ਨਿਧਾਨੇ ॥੧੨॥੧੩॥

ਨਮਸਤੰ ਅਗਾਹੇ ॥ ਨਮਸਤੰ ਅਬਾਹੇ ॥
ਨਮਸਤੰ ਤ੍ਰਿਬਰਗੇ ॥ ਨਮਸਤੰ ਅਸਰਗੇ ॥੧੩॥੧੪॥

ਨਮਸਤੰ ਪ੍ਰਭੋਗੇ ॥ ਨਮਸਤੰ ਸੁਜੋਗੇ ॥
ਨਮਸਤੰ ਅਰੰਗੇ ॥ ਨਮਸਤੰ ਅਭੰਗੇ ॥੧੪॥੧੫॥

ਨਮਸਤੰ ਅਗੰਮੇ ॥ ਨਮਸਤਸਤੁ ਰੰਮੇ ॥
ਨਮਸਤੰ ਜਲਾਸਰੇ ॥ ਨਮਸਤੰ ਨਿਰਾਸਰੇ ॥੧੫॥੧੬॥

ਨਮਸਤੰ ਅਜਾਤੇ ॥ ਨਮਸਤੰ ਅਪਾਤੇ ॥
ਨਮਸਤੰ ਅਮਜਬੇ ॥ ਨਮਸਤਸਤੁ ਅਜਬੇ ॥੧੬॥੧੭॥

ਅਦੇਸੰ ਅਦੇਸੇ ॥ ਨਮਸਤੰ ਅਭੇਸੇ ॥
ਨਮਸਤੰ ਨ੍ਰਿਧਾਮੇ ॥ ਨਮਸਤੰ ਨ੍ਰਿਬਾਮੇ ॥੧੭॥੧੮॥

ਨਮੋ ਸਰਬ ਕਾਲੇ ॥ ਨਮੋ ਸਰਬ ਦਿਆਲੇ ॥
ਨਮੋ ਸਰਬ ਰੂਪੇ ॥ ਨਮੋ ਸਰਬ ਭੂਪੇ ॥੧੮॥੧੯॥

ਨਮੋ ਸਰਬ ਖਾਪੇ ॥ ਨਮੋ ਸਰਬ ਥਾਪੇ ॥
ਨਮੋ ਸਰਬ ਕਾਲੇ ॥ ਨਮੋ ਸਰਬ ਪਾਲੇ ॥੧੯॥੨੦॥

ਨਮਸਤਸਤੁ ਦੇਵੈ ॥ ਨਮਸਤੰ ਅਭੇਵੈ ॥
ਨਮਸਤੰ ਅਜਨਮੇ ॥ਨਮਸਤੰ ਸੁਬਨਮੇ ॥੨੦॥੨੧॥

ਨਮੋ ਸਰਬ ਗਉਨੇ ॥ ਨਮੋ ਸਰਬ ਭਉਨੇ ॥
ਨਮੋ ਸਰਬ ਰੰਗੇ ॥ ਨਮੋ ਸਰਬ ਭੰਗੇ ॥੨੧॥੨੨॥

ਨਮੋ ਕਾਲ ਕਾਲੇ ॥ ਨਮਸਤਸਤੁ ਦਿਆਲੇ ॥
ਨਮਸਤੰ ਅਬਰਨੇ ॥ ਨਮਸਤੰ ਅਮਰਨੇ ॥੨੨॥੨੩॥

ਨਮਸਤੰ ਜਰਾਰੰ ॥ ਨਮਸਤੰ ਕ੍ਰਿਤਾਰੰ ॥
ਨਮੋ ਸਰਬ ਧੰਧੇ ॥ ਨਮੋ ਸਤ ਅਬੰਧੇ ॥੨੩॥੨੪॥

ਨਮਸਤੰ ਨ੍ਰਿਸਾਕੇ ॥ ਨਮਸਤੰ ਨ੍ਰਿਬਾਕੇ ॥
ਨਮਸਤੰ ਰਹੀਮੇ ॥ ਨਮਸਤੰ ਕਰੀਮੇ ॥੨੪॥੨੫॥

ਨਮਸਤੰ ਅਨੰਤੇ ॥ ਨਮਸਤੰ ਮਹੰਤੇ ॥
ਨਮਸਤਸਤੁ ਰਾਗੇ ॥ ਨਮਸਤੰ ਸੁਹਾਗੇ ॥੨੫॥੨੬॥

ਨਮੋ ਸਰਬ ਸੋਖੰ ॥ ਨਮੋ ਸਰਬ ਪੋਖੰ ॥
ਨਮੋ ਸਰਬ ਕਰਤਾ ॥ ਨਮੋ ਸਰਬ ਹਰਤਾ ॥੨੬॥੨੭॥

ਨਮੋ ਜੋਗ ਜੋਗੇ ॥ ਨਮੋ ਭੋਗ ਭੋਗੇ ॥
ਨਮੋ ਸਰਬ ਦਿਆਲੇ ॥ ਨਮੋ ਸਰਬ ਪਾਲੇ ॥੨੭॥੨੮॥

ਚਾਚਰੀ ਛੰਦ ॥ ਤ੍ਵਪ੍ਰਸਾਦਿ ॥

ਅਰੂਪ ਹੈਂ ॥ ਅਨੂਪ ਹੈਂ ॥
ਅਜੂ ਹੈਂ ॥ ਅਭੂ ਹੈਂ ॥੧॥੨੯॥

ਅਲੇਖ ਹੈਂ ॥ਅਭੇਖ ਹੈਂ ॥
ਅਨਾਮ ਹੈਂ ॥ ਅਕਾਮ ਹੈਂ ॥੨॥੩੦॥

ਅਧੇ ਹੈਂ ॥ ਅਭੇ ਹੈਂ ॥
ਅਜੀਤ ਹੈਂ ॥ ਅਭੀਤ ਹੈਂ ॥੩॥੩੧॥

ਤ੍ਰਿਮਾਨ ਹੈਂ ॥ ਨਿਧਾਨ ਹੈਂ ॥
ਤ੍ਰਿਬਰਗ ਹੈਂ ॥ ਅਸਰਗ ਹੈਂ ॥੪॥੩੨॥

ਅਨੀਲ ਹੈਂ ॥ ਅਨਾਦਿ ਹੈਂ ॥
ਅਜੇ ਹੈਂ ॥ ਅਜਾਦਿ ਹੈਂ ॥੫॥੩੩॥

ਅਜਨਮ ਹੈਂ ॥ ਅਬਰਨ ਹੈਂ ॥
ਅਭੂਤ ਹੈਂ ॥ ਅਭਰਨ ਹੈਂ ॥੬॥੩੪॥

ਅਗੰਜ ਹੈਂ ॥ ਅਭੰਜ ਹੈਂ ॥
ਅਝੂਝ ਹੈਂ ॥ ਅਝੰਝ ਹੈਂ ॥੭॥੩੫॥

ਅਮੀਕ ਹੈਂ ॥ ਰਫੀਕ ਹੈਂ ॥
ਅਧੰਧ ਹੈਂ ॥ ਅਬੰਧ ਹੈਂ ॥੮॥੩੬॥

ਨ੍ਰਿਬੂਝ ਹੈਂ ॥ ਅਸੂਝ ਹੈਂ ॥
ਅਕਾਲ ਹੈਂ ॥ ਅਜਾਲ ਹੈਂ ॥੯॥੩੭॥

ਅਲਾਹ ਹੈਂ ॥ ਅਜਾਹ ਹੈਂ ॥
ਅਨੰਤ ਹੈਂ ॥ ਮਹੰਤ ਹੈਂ ॥੧੦॥੩੮॥

ਅਲੀਕ ਹੈਂ ॥ ਨ੍ਰਿਸ੍ਰੀਕ ਹੈਂ ॥
ਨ੍ਰਿਲੰਭ ਹੈਂ ॥ ਅਸੰਭ ਹੈਂ ॥੧੧॥੩੯॥

ਅਗੰਮ ਹੈਂ ॥ ਅਜੰਮ ਹੈਂ ॥
ਅਭੂਤ ਹੈਂ ॥ਅਛੂਤ ਹੈਂ ॥੧੨॥੪੦॥

ਅਲੋਕ ਹੈਂ ॥ ਅਸੋਕ ਹੈਂ ॥
ਅਕਰਮ ਹੈਂ ॥ ਅਭਰਮ ਹੈਂ ॥੧੩॥੪੧॥

ਅਜੀਤ ਹੈਂ ॥ ਅਭੀਤ ਹੈਂ ॥
ਅਬਾਹ ਹੈਂ ॥ ਅਗਾਹ ਹੈਂ ॥੧੪॥੪੨॥

ਅਮਾਨ ਹੈਂ ॥ ਨਿਧਾਨ ਹੈਂ ॥
ਅਨੇਕ ਹੈਂ ॥ ਫਿਰਿ ਏਕ ਹੈਂ ॥੧੫॥੪੩॥

ਭੁਜੰਗ ਪ੍ਰਯਾਤ ਛੰਦ ॥ ਨਮੋ ਸਰਬ ਮਾਨੇ ॥
ਸਮਸਤੀ ਨਿਧਾਨੇ ॥ ਨਮੋ ਦੇਵ ਦੇਵੇ ॥
ਅਭੇਖੀ ਅਭੇਵੇ ॥੧॥੪੪॥

ਨਮੋ ਕਾਲ ਕਾਲੇ ॥ ਨਮੋ ਸਰਬ ਪਾਲੇ ॥
ਨਮੋ ਸਰਬ ਗਉਣੇ ॥ ਨਮੋ ਸਰਬ ਭਉਣੇ ॥੨॥੪੫॥

ਅਨੰਗੀ ਅਨਾਥੇ ॥ ਨ੍ਰਿਸੰਗੀ ਪ੍ਰਮਾਥੇ ॥
ਨਮੋ ਭਾਨ ਭਾਨੇ ॥ ਨਮੋ ਮਾਨ ਮਾਨੇ ॥੩॥੪੬॥

ਨਮੋ ਚੰਦ੍ਰ ਚੰਦ੍ਰੇ ॥ ਨਮੋ ਭਾਨ ਭਾਨੇ ॥   
ਨਮੋ ਗੀਤ ਗੀਤੇ ॥ ਨਮੋ ਤਾਨ ਤਾਨੇ ॥੪॥੪੭॥

ਨਮੋ ਨ੍ਰਿਤ ਨ੍ਰਿਤੇ ॥ ਨਮੋ ਨਾਦ ਨਾਦੇ ॥
ਨਮੋ ਪਾਨ ਪਾਨੇ ॥ ਨਮੋ ਬਾਦ ਬਾਦੇ ॥੫॥੪੮॥

ਅਨੰਗੀ ਅਨਾਮੇ ॥ ਸਮਸਤੀ ਸਰੂਪੇ ॥
ਪ੍ਰਭੰਗੀ ਪ੍ਰਮਾਥੇ ॥ ਸਮਸਤੀ ਬਿਭੂਤੇ ॥੬॥੪੯॥

ਕਲੰਕੰ ਬਿਨਾ ਨੇਹਕਲੰਕੀ ਸਰੂਪੇ ॥
ਨਮੋ ਰਾਜ ਰਾਜੇਸ੍ਵਰੰ ਪਰਮ ਰੂਪੇ ॥੭॥੫੦॥

ਨਮੋ ਜੋਗ ਜੋਗੇਸ੍ਵਰੰ ਪਰਮ ਸਿਧੇ ॥
ਨਮੋ ਰਾਜ ਰਾਜੇਸ੍ਵਰੰ ਪਰਮ ਬ੍ਰਿਧੇ ॥੮॥੫੧॥

ਨਮੋ ਸਸਤ੍ਰ ਪਾਣੇ ॥ ਨਮੋ ਅਸਤ੍ਰ ਮਾਣੇ ॥
ਨਮੋ ਪਰਮ ਗਿਆਤਾ ॥ ਨਮੋ ਲੋਕ ਮਾਤਾ ॥੯॥੫੨॥

ਅਭੇਖੀ ਅਭਰਮੀ ਅਭੋਗੀ ਅਭੁਗਤੇ ॥
ਨਮੋ ਜੋਗ ਜੋਗੇਸ੍ਵਰੰ ਪਰਮ ਜੁਗਤੇ ॥੧੦॥੫੩॥

ਨਮੋ ਨਿਤ ਨਾਰਾਇਣੇ ਕ੍ਰੂਰ ਕਰਮੇ ॥
ਨਮੋ ਪ੍ਰੇਤ ਅਪ੍ਰੇਤ ਦੇਵੇ ਸੁਧਰਮੇ ॥੧੧॥੫੪॥

ਨਮੋ ਰੋਗ ਹਰਤਾ ॥ ਨੋਮ ਰਾਗ ਰੂਪੇ ॥
ਨਮੋ ਸਾਹ ਸਾਹੰ ॥ ਨਮੋ ਭੂਪ ਭੂਪੇ ॥੧੨॥੫੫॥

ਨਮੋ ਦਾਨ ਦਾਨੇ ॥ ਨਮੋ ਮਾਨ ਮਾਨੇ ॥
ਨਮੋ ਰੋਗ ਰੋਗੇ ॥ ਨਮਸਤੰ ਸਨਾਨੇ ॥੧੩॥੫੬॥

ਨਮੋ ਮੰਤ੍ਰ ਮੰਤ੍ਰੰ ॥ ਨਮੋ ਜੰਤ੍ਰ ਜੰਤ੍ਰੰ ॥
ਨਮੋ ਇਸਟ ਇਸਟੇ ॥ ਨਮੋ ਤੰਤ੍ਰ ਤੰਤ੍ਰੰ ॥੧੪॥੫੭॥ 

ਸਦਾ ਸਚਿਦਾਨੰਦ ਸਰਬੰ ਪ੍ਰਣਾਸੀ ॥
ਅਨੂਪੇ ਅਰੂਪੇ ਸਮਸਤੁਲ ਨਿਵਾਸੀ ॥੧੫॥੫੮॥

ਸਦਾ ਸਿਧਿਦਾ ਬੁਧਿਦਾ ਬ੍ਰਿਧਿ ਕਰਤਾ ॥
ਅਧੋ ਉਰਧ ਅਰਧੰ ਅਘੰ ਓਘ ਹਰਤਾ ॥੧੬॥੫੯॥

ਪਰੰ ਪਰਮ ਪਰਮੇਸ੍ਵਰੰ ਪ੍ਰੋਛਪਾਲੰ ॥
ਸਦਾ ਸਰਬਦਾ ਸਿਧਿ ਦਾਤਾ ਦਿਆਲੰ ॥੧੭॥੬੦॥

ਅਛੇਦੀ ਅਭੇਦੀ ਅਨਾਮੰ ਅਕਾਮੰ ॥
ਸਮਸਤੋ ਪਰਾਜੀ ਸਮਸਤਸਤੁ ਧਾਮੰ ॥੧੮॥੬੧॥

ਤੇਰਾ ਜੋਰੁ ॥ ਚਾਚਰੀ ਛੰਦ ॥ ਜਲੇ ਹੈਂ ॥
ਥਲੇ ਹੈਂ ॥ ਅਭੀਤ ਹੈਂ ॥ ਅਭੇ ਹੈਂ ॥੧॥੬੨॥

ਪ੍ਰਭੂ ਹੈਂ ॥ ਅਜੂ ਹੈਂ ॥
ਅਦੇਸ ਹੈਂ ॥ ਅਭੇਸ ਹੈਂ ॥੨॥੬੩॥

ਭੁਜੰਗ ਪ੍ਰਯਾਤ ਛੰਦ ॥ ਤ੍ਵਪ੍ਰਸਾਦਿ ॥

ਅਗਾਧੇ ਅਬਾਧੇ ॥ ਅਨੰਦੀ ਸਰੂਪੇ ॥
ਨਮੋ ਸਰਬ ਮਾਨੇ ॥ ਸਮਸਤੀ ਨਿਧਾਨੇ ॥੧॥੬੪॥

ਨਮਸਤ੍ਵੰ ਨ੍ਰਿਨਾਥੇ ॥ ਨਮਸਤ੍ਵੰ ਪ੍ਰਮਾਥੇ ॥
ਨਮਸਤ੍ਵੰ ਅਗੰਜੇ ॥ ਨਮਸਤ੍ਵੰ ਅਭੰਜੇ ॥੨॥੬੫॥

ਨਮਸਤ੍ਵੰ ਅਕਾਲੇ ॥ ਨਮਸਤ੍ਵੰ ਅਪਾਲੇ ॥
ਨਮੋ ਸਰਬ ਦੇਸੇ ॥ ਨਮੋ ਸਰਬ ਭੇਸੇ ॥੩॥੬੬॥

ਨਮੋ ਰਾਜ ਰਾਜੇ ॥ ਨਮੋ ਸਾਜ ਸਾਜੇ ॥
ਨਮੋ ਸਾਹ ਸਾਹੇ ॥ ਨਮੋ ਮਾਹ ਮਾਹੇ ॥੪॥੬੭॥

ਨਮੋ ਗੀਤ ਗੀਤੇ ॥ ਨਮੋ ਪ੍ਰੀਤਿ ਪ੍ਰੀਤੇ ॥
ਨਮੋ ਰੋਖ ਰੋਖੇ ॥ ਨਮੋ ਸੋਖ ਸੋਖੇ ॥੫॥੬੮॥

ਨਮੋ ਸਰਬ ਰੋਗੇ ॥ ਨਮੋ ਸਰਬ ਭੋਗੇ ॥
ਨਮੋ ਸਰਬ ਜੀਤੰ ॥ ਨਮੋ ਸਰਬ ਭੀਤੰ ॥੬॥੬੯॥

ਨਮੋ ਸਰਬ ਗਿਆਨੰ ॥ ਨਮੋ ਪਰਮ ਤਾਨੰ ॥
ਨਮੋ ਸਰਬ ਮੰਤ੍ਰੰ ॥ ਨਮੋ ਸਰਬ ਜੰਤ੍ਰੰ ॥੭॥੭੦॥

ਨਮੋ ਸਰਬ ਦ੍ਰਿਸੰ ॥ ਨਮੋ ਸਰਬ ਕ੍ਰਿਸੰ ॥
ਨਮੋ ਸਰਬ ਰੰਗੇ ॥ ਤ੍ਰਿਭੰਗੀ ਅਨੰਗੇ ॥੮॥੭੧॥

ਨਮੋ ਜੀਵ ਜੀਵੰ ॥ ਨਮੋ ਬੀਜ ਬੀਜੇ ॥
ਅਖਿਜੇ ਅਭਿਜੇ ॥ ਸਮਸਤੰ ਪ੍ਰਸਿਜੇ ॥੯॥੭੨॥

ਕ੍ਰਿਪਾਲੰ ਸਰੂਪੇ ॥ ਕੁਕਰਮੰ ਪ੍ਰਣਾਸੀ ॥
ਸਦਾ ਸਰਬਦਾ ਰਿਧਿ ਸਿਧੰ ਨਿਵਾਸੀ ॥੧੦॥੭੩॥

ਚਰਪਟ ਛੰਦ ॥ ਤ੍ਵਪ੍ਰਸਾਦਿ ॥

ਅੰਮ੍ਰਿਤ ਕਰਮੇ ॥ ਅੰਬ੍ਰਿਤ ਧਰਮੇ ॥
ਅਖਿਲ ਜੋਗੇ ॥ ਅਚਲ ਭੋਗੇ ॥੧॥੭੪॥

ਅਚਲ ਰਾਜੇ ॥ ਅਟਲ ਸਾਜੇ ॥
ਅਖਲ ਧਰਮੰ ॥ ਅਲਖ ਕਰਮੰ ॥੨॥੭੫॥

ਸਰਬੰ ਦਾਤਾ ॥ ਸਰਬੰ ਗਿਆਤਾ ॥
ਸਰਬੰ ਭਾਨੇ ॥ ਸਰਬੰ ਮਾਨੇ ॥੩॥੭੬॥

ਸਰਬੰ ਪ੍ਰਾਣੰ ॥ ਸਰਬੰ ਤ੍ਰਾਣੰ ॥
ਸਰਬੰ ਭੁਗਤਾ ॥ ਸਰਬੰ ਜੁਗਤਾ ॥੪॥੭੭॥

ਸਰਬੰ ਦੇਵੰ ॥ ਸਰਬੰ ਭੇਵੰ ॥
ਸਰਬੰ ਕਾਲੇ ॥ ਸਰਬੰ ਪਾਲੇ ॥੫॥੭੮॥

ਰੂਆਲ ਛੰਦ ॥ ਤ੍ਵਪ੍ਰਸਾਦਿ ॥

ਆਦਿ ਰੂਪ ਅਨਾਦਿ ਮੂਰਤਿ ਅਜੋਨਿ ਪੁਰਖ ਅਪਾਰ ॥
ਸਰਬ ਮਾਨ ਤ੍ਰਿਮਾਨ ਦੇਵ ਅਭੇਵ ਆਦਿ ਉਦਾਰ ॥
ਸਰਬ ਪਾਲਕ ਸਰਬ ਘਾਲਕ ਸਰਬ ਕੋ ਪੁਨਿ ਕਾਲ ॥
ਜਤ੍ਰ ਤਤ੍ਰ ਬਿਰਾਜਹੀ ਅਵਧੂਤ ਰੂਪ ਰਿਸਾਲ ॥੧॥੭੯॥

ਨਾਮ ਠਾਮ ਨ ਜਾਤਿ ਜਾਕਰ ਰੂਪ ਰੰਗ ਨ ਰੇਖ ॥
ਆਦਿ ਪੁਰਖ ਉਦਾਰ ਮੂਰਤਿ ਅਜੋਨਿ ਆਦਿ ਅਸੇਖ ॥
ਦੇਸ ਅਉਰ ਨ ਭੇਸ ਜਾਕਰ ਰੂਪ ਰੇਖ ਨ ਰਾਗ ॥
ਜਤ੍ਰ ਤਤ੍ਰ ਦਿਸਾ ਵਿਸਾ ਹੁਇ ਫੈਲਿਓ ਅਨੁਰਾਗ ॥੨॥੮੦॥

ਨਾਮ ਕਾਮ ਬਿਹੀਨ ਪੇਖਤ ਧਾਮ ਹੂੰ ਨਹਿ ਜਾਹਿ ॥
ਸਰਬ ਮਾਨ ਸਰਬਤ੍ਰ ਮਾਨ ਸਦੈਵ ਮਾਨਤ ਤਾਹਿ ॥
ਏਕ ਮੂਰਤਿ ਅਨੇਕ ਦਰਸਨ ਕੀਨ ਰੂਪ ਅਨੇਕ ॥
ਖੇਲ ਖੇਲਿ ਅਖੇਲ ਖੇਲਨ ਅੰਤ ਕੋ ਫਿਰਿ ਏਕ ॥੩॥੮੧॥

ਦੇਵ ਭੇਵ ਨ ਜਾਨਹੀ ਜਿਹ ਬੇਦ ਅਉਰ ਕਤੇਬ ॥
ਰੂਪ ਰੰਗ ਨ ਜਾਤਿ ਪਾਤਿ ਸੁ ਜਾਨਈ ਕਿਹ ਜੇਬ ॥
ਤਾਤ ਮਾਤ ਨ ਜਾਤ ਜਾ ਕਰ ਜਨਮ ਮਰਨ ਬਿਹੀਨ ॥
ਚਕ੍ਰ ਬਕ੍ਰ ਫਿਰੈ ਚਤ੍ਰ ਚਕਿ ਮਾਨਹੀ ਪੁਰ ਤੀਨ ॥੪॥੮੨॥

ਲੋਕ ਚਉਦਹ ਕੇ ਬਿਖੈ ਜਗ ਜਾਪਹੀ ਜਿਹ ਜਾਪੁ ॥
ਆਦਿ ਦੇਵ ਅਨਾਦਿ ਮੂਰਤਿ ਥਾਪਿਓ ਸਬੈ ਜਿਹ ਥਾਪੁ ॥
ਪਰਮ ਰੂਪ ਪੁਨੀਤ ਮੂਰਤਿ ਪੂਰਨ ਪੁਰਖੁ ਅਪਾਰ ॥
ਸਰਬ ਬਿਸ੍ਵ ਰਚਿਓ ਸੁਯੰਭਵ ਗੜਨ ਭੰਜਨ ਹਾਰ ॥੫॥੮੩॥

ਕਾਲ ਹੀਨ ਕਲਾ ਸੰਜੁਗਤਿ ਅਕਾਲ ਪੁਰਖ ਅਦੇਸ ॥
ਧਰਮ ਧਾਮ ਸੁ ਭਰਮ ਰਹਤ ਅਭੂਤ ਅਲਖ ਅਭੇਸ ॥
ਅੰਗ ਰਾਗ ਨ ਰੰਗ ਜਾ ਕਹਿ ਜਾਤਿ ਪਾਤਿ ਨ ਨਾਮ ॥
ਗਰਬ ਗੰਜਨ ਦੁਸਟ ਭੰਜਨ ਮੁਕਤ ਦਾਇਕ ਕਾਮ ॥੬॥੮੪॥

ਆਪ ਰੂਪ ਅਮੀਕ ਅਨਉਸਤਤਿ ਏਕ ਪੁਰਖੁ ਅਵਧੂਤ ॥
ਗਰਬ ਗੰਜਨ ਸਰਬ ਭੰਜਨ ਆਦਿ ਰੂਪ ਅਸੂਤ ॥
ਅੰਗ ਹੀਨ ਅਭੰਗ ਅਨਾਤਮ ਏਕ ਪੁਰਖੁ ਅਪਾਰ ॥
ਸਰਬ ਲਾਇਕ ਸਰਬ ਘਾਇਕ ਸਰਬ ਕੋ ਪ੍ਰਤਿਪਾਰ ॥੭॥੮੫॥

ਸਰਬ ਗੰਤਾ ਸਰਬ ਹੰਤਾ ਸਰਬ ਤੇ ਅਨਭੇਖ ॥
ਸਰਬ ਸਾਸਤ੍ਰ ਨ ਜਾਨਹੀ ਜਿਹ ਰੂਪ ਰੰਗੁ ਅਰੁ ਰੇਖ ॥
ਪਰਮ ਬੇਦ ਪੁਰਾਣ ਜਾਕਹਿ ਨੇਤਿ ਭਾਖਤ ਨਿਤ ॥
ਕੋਟਿ ਸਿੰਮ੍ਰਿਤਿ ਪੁਰਾਨ ਸਾਸਤ੍ਰ ਨ ਆਵਈ ਵਹੁ ਚਿਤਿ ॥੮॥੮੬॥

ਮਧੁਭਾਰ ਛੰਦ ॥ ਤ੍ਵਪ੍ਰਸਾਦਿ ॥

ਗੁਨ ਗਨ ਉਦਾਰ ॥ ਮਹਿਮਾ ਅਪਾਰ ॥
ਆਸਨ ਅਭੰਗ ॥ ਉਪਮਾ ਅਨੰਗ ॥੧॥੮੭॥

ਅਨਭਉ ਪ੍ਰਕਾਸ ॥ ਨਿਸ ਦਿਨ ਅਨਾਸ ॥
ਆਜਾਨੁ ਬਾਹੁ ॥ ਸਾਹਾਨੁ ਸਾਹੁ ॥੨॥੮੮॥

ਰਾਜਾਨ ਰਾਜ ॥ ਭਾਨਾਨ ਭਾਨੁ ॥
ਦੇਵਾਨ ਦੇਵ ॥ ਉਪਮਾ ਮਹਾਨ ॥੩॥੮੯॥

ਇੰਦ੍ਰਾਨ ਇੰਦ੍ਰ ॥ ਬਾਲਾਨ ਬਾਲ ॥
ਰੰਕਾਨ ਰੰਕ ॥ ਕਾਲਾਨ ਕਾਲ ॥੪॥੯੦॥

ਅਨਭੂਤ ਅੰਗ ॥ ਆਭਾ ਅਭੰਗ ॥
ਗਤਿ ਮਿਤਿ ਅਪਾਰ ॥
ਗੁਨ ਗਨ ਉਦਾਰ ॥੫॥੯੧॥

ਮੁਨਿ ਗਨ ਪ੍ਰਨਾਮ ॥ ਨਿਰਭੈ ਨ੍ਰਿਕਾਮ ॥
ਅਤਿ ਦੁਤਿ ਪ੍ਰਚੰਡ ॥ ਮਿਤਿ ਗਤਿ ਅਖੰਡ ॥੬॥੯੨॥

ਆਲਿਸ੍ਯ ਕਰਮ ॥ ਆਦ੍ਰਿਸ੍ਯ ਧਰਮ ॥
ਸਰਬਾ ਭਰਣਾਢ੍ਯ ॥ ਅਨਡੰਡ ਬਾਢ੍ਯ ॥੭॥੯੩॥

ਚਾਚਰੀ ਛੰਦ ॥ ਤ੍ਵਪ੍ਰਸਾਦਿ ॥
ਗੁਬਿੰਦੇ ॥ ਮੁਕੰਦੇ ॥ ਉਦਾਰੇ ॥
ਅਪਾਰੇ ॥੧॥੯੪॥

ਹਰੀਅੰ ॥ ਕਰੀਅੰ ॥ ਨ੍ਰਿਨਾਮੇ ॥
ਅਕਾਮੇ ॥੨॥੯੫॥

ਭੁਜੰਗ ਪ੍ਰਯਾਤ ਛੰਦ ॥ ਚਤ੍ਰ ਚਕ੍ਰ ਕਰਤਾ ॥
ਚਤ੍ਰ ਚਕ੍ਰ ਹਰਤਾ ॥ ਚਤ੍ਰ ਚਕ੍ਰ ਦਾਨੇ ॥
ਚਤ੍ਰ ਚਕ੍ਰ ਜਾਨੇ ॥੧॥੯੬॥

ਚਤ੍ਰ ਚਕ੍ਰ ਵਰਤੀ ॥ ਚਤ੍ਰ ਚਕ੍ਰ ਭਰਤੀ ॥
ਚਤ੍ਰ ਚਕ੍ਰ ਪਾਲੇ ॥ ਚਤ੍ਰ ਚਕ੍ਰ ਕਾਲੇ ॥੨॥੯੭॥

ਚਤ੍ਰ ਚਕ੍ਰ ਪਾਸੇ ॥ ਚਤ੍ਰ ਚਕ੍ਰ ਵਾਸੇ ॥
ਚਤ੍ਰ ਚਕ੍ਰ ਮਾਨ੍ਯੈ ॥ ਚਤ੍ਰ ਚਕ੍ਰ ਦਾਨ੍ਯੈ ॥੩॥੯੮॥

ਚਾਚਰੀ ਛੰਦ ॥

ਨ ਸਤ੍ਰੈ ॥ ਨ ਮਿਤ੍ਰੈ ॥
ਨ ਭਰਮੰ ॥ ਨ ਭਿਤ੍ਰੈ ॥੧॥੯੯॥

ਨ ਕਰਮੰ ॥ ਨ ਕਾਏ ॥
ਅਜਨਮੰ ॥ ਅਜਾਏ ॥੨॥੧੦੦॥

ਨ ਚਿਤ੍ਰੈ ॥ ਨ ਮਿਤ੍ਰੈ ॥
ਪਰੇ ਹੈ ॥ ਪਵਿਤ੍ਰੈ ॥੩॥੧੦੧॥

ਪ੍ਰਿਥੀਸੈ ॥ ਅਦੀਸੈ ॥
ਅਦ੍ਰਿਸੈ ॥ ਅਕ੍ਰਿਸੈ ॥੪॥੧੦੨॥

ਭਗਵਤੀ ਛੰਦ ॥ ਤ੍ਵਪ੍ਰਸਾਦਿ ਕਥਤੇ ॥

ਕਿ ਆਛਿਜ ਦੇਸੈ ॥ ਕਿ ਆਭਿਜ ਭੇਸੈ ॥
ਕਿ ਆਗੰਜ ਕਰਮੈ ॥ ਕਿ ਆਭੰਜ ਭਰਮੈ ॥੧॥੧੦੩॥

ਕਿ ਆਭਿਜ ਲੋਕੈ ॥ ਕਿ ਆਦਿਤ ਸੋਕੈ ॥
ਕਿ ਅਵਧੂਤ ਬਰਨੈ ॥ ਕਿ ਬਿਭੂਤ ਕਰਨੈ ॥੨॥੧੦੪॥

ਕਿ ਰਾਜੰ ਪ੍ਰਭਾ ਹੈਂ ॥ ਕਿ ਧਰਮ ਧੁਜਾ ਹੈਂ ॥
ਕਿ ਆਸੋਕ ਬਰਨੈ ॥ ਕਿ ਸਰਬਾ ਅਭਰਨੈ ॥੩॥੧੦੫॥

ਕਿ ਜਗਤੰ ਕ੍ਰਿਤੀ ਹੈਂ ॥ ਕਿ ਛਤ੍ਰੰ ਛਤ੍ਰੀ ਹੈਂ ॥
ਕਿ ਬ੍ਰਹਮੰ ਸਰੂਪੈ ॥ ਕਿ ਅਨਭਉ ਅਨੂਪੈ ॥੪॥੧੦੬॥

ਕਿ ਆਦਿ ਅਦੇਵ ਹੈਂ ॥ ਕਿ ਆਪਿ ਅਭੇਵ ਹੈਂ ॥
ਕਿ ਚਿਤ੍ਰੰ ਬਿਹੀਨੈ ॥ ਕਿ ਏਕੈ ਅਧੀਨੈ ॥੫॥੧੦੭॥

ਕਿ ਰੋਜੀ ਰਜਾਕੈ ॥ ਰਹੀਮੈ ਰਿਹਾਕੈ ॥
ਕਿ ਪਾਕ ਬਿਐਬ ਹੈਂ ॥ ਕਿ ਗੈਬੁਲ ਗੈਬ ਹੈਂ ॥੬॥੧੦੮॥

ਕਿ ਅਫਵੁਲ ਗੁਨਾਹ ਹੈਂ ॥ ਕਿ ਸਾਹਾਨ ਸਾਹ ਹੈਂ ॥
ਕਿ ਕਾਰਨ ਕੁਨਿੰਦ ਹੈਂ ॥ ਕਿ ਰੋਜੀ ਦਿਹਿੰਦ ਹੈਂ ॥੭॥੧੦੯॥

ਕਿ ਰਾਜਕ ਰਹੀਮ ਹੈਂ ॥ ਕਿ ਕਰਮੰ ਕਰੀਮ ਹੈਂ ॥
ਕਿ ਸਰਬੰ ਕਲੀ ਹੈਂ ॥ ਕਿ ਸਰਬੰ ਦਲੀ ਹੈਂ ॥੮॥੧੧੦॥

ਕਿ ਸਰਬਤ੍ਰ ਮਾਨਿਯੈ ॥ ਕਿ ਸਰਬਤ੍ਰ ਦਾਨਿਯੈ ॥
ਕਿ ਸਰਬਤ੍ਰ ਗਉਨੈ ॥ ਕਿ ਸਰਬਤ੍ਰ ਭਉਨੈ ॥੯॥੧੧੧॥

ਕਿ ਸਰਬਤ੍ਰ ਦੇਸੈ ॥ ਕਿ ਸਰਬਤ੍ਰ ਭੇਸੈ ॥
ਕਿ ਸਰਬਤ੍ਰ ਰਾਜੈ ॥ਕਿ ਸਰਬਤ੍ਰ ਸਾਜੈ ॥੧੦॥੧੧੨॥

ਕਿ ਸਰਬਤ੍ਰ ਦੀਨੈ ॥ ਕਿ ਸਰਬਤ੍ਰ ਲੀਨੈ ॥
ਕਿ ਸਰਬਤ੍ਰ ਜਾਹੋ ॥ ਕਿ ਸਰਬਤ੍ਰ ਭਾਹੋ ॥੧੧॥੧੧੩॥

ਕਿ ਸਰਬਤ੍ਰ ਦੇਸੈ ॥ ਕਿ ਸਰਬਤ੍ਰ ਭੇਸੈ ॥
ਕਿ ਸਰਬਤ੍ਰ ਕਾਲੈ ॥ ਕਿ ਸਰਬਤ੍ਰ ਪਾਲੈ ॥੧੨॥੧੧੪॥

ਕਿ ਸਰਬਤ੍ਰ ਹੰਤਾ ॥ ਕਿ ਸਰਬਤ੍ਰ ਗੰਤਾ ॥
ਕਿ ਸਰਬਤ੍ਰ ਭੇਖੀ ॥ ਕਿ ਸਰਬਤ੍ਰ ਪੇਖੀ ॥੧੩॥੧੧੫॥

ਕਿ ਸਰਬਤ੍ਰ ਕਾਜੈ ॥ ਕਿ ਸਰਬਤ੍ਰ ਰਾਜੈ ॥
ਕਿ ਸਰਬਤ੍ਰ ਸੋਖੈ ॥ ਕਿ ਸਰਬਤ੍ਰ ਪੋਖੈ ॥੧੪॥੧੧੬॥

ਕਿ ਸਰਬਤ੍ਰ ਤ੍ਰਾਣੈ ॥ ਕਿ ਸਰਬਤ੍ਰ ਪ੍ਰਾਣੈ ॥
ਕਿ ਸਰਬਤ੍ਰ ਦੇਸੈ ॥ ਕਿ ਸਰਬਤ੍ਰ ਭੇਸੈ ॥੧੫॥੧੧੭॥

ਕਿ ਸਰਬਤ੍ਰ ਮਾਨਿਯੈ ॥ ਸਦੈਵੰ ਪ੍ਰਧਾਨਿਯੈ ॥
ਕਿ ਸਰਬਤ੍ਰ ਜਾਪਿਯੈ ॥ ਕਿ ਸਰਬਤ੍ਰ ਥਾਪਿਯੈ ॥੧੬॥੧੧੮॥

ਕਿ ਸਰਬਤ੍ਰ ਭਾਨੈ ॥ ਕਿ ਸਰਬਤ੍ਰ ਮਾਨੈ ॥
ਕਿ ਸਰਬਤ੍ਰ ਇੰਦ੍ਰੈ ॥ ਕਿ ਸਰਬਤ੍ਰ ਚੰਦ੍ਰੈ ॥੧੭॥੧੧੯॥

ਕਿ ਸਰਬੰ ਕਲੀਮੈ ॥ ਕਿ ਪਰਮੰ ਫਹੀਮੈ ॥
ਕਿ ਆਕਿਲ ਅਲਾਮੈ ॥ ਕਿ ਸਾਹਿਬ ਕਲਾਮੈ ॥੧੮॥੧੨੦॥

ਕਿ ਹੁਸਨਲ ਵਜੂ ਹੈਂ ॥ ਤਮਾਮੁਲ ਰੁਜੂ ਹੈਂ ॥
ਹਮੇਸੁਲ ਸਲਾਮੈ ॥ ਸਲੀਖਤ ਮੁਦਾਮੈ ॥੧੯॥੧੨੧॥

ਗਨੀਮੁਲ ਸਿਕਸਤੈ ॥ਗਰੀਬੁਲ ਪਰਸਤੈ ॥
ਬਿਲੰਦੁਲ ਮਕਾਨੈ ॥ ਜਮੀਨਲ ਜਮਾਨੈ ॥੨੦॥੧੨੨॥

ਤਮੀਜੁਲ ਤਮਾਮੈ ॥ ਰੁਜੂਅਲ ਨਿਧਾਨੈ ॥
ਹਰੀਫੁਲ ਅਜੀਮੈ ॥ਰਜਾਇਕ ਯਕੀਨੈ ॥੨੧॥੧੨੩॥

ਅਨੇਕੁਲ ਤਰੰਗ ਹੈਂ ॥ ਅਭੇਦ ਹੈਂ ਅਭੰਗ ਹੈਂ ॥
ਅਜੀਜਲ ਨਿਵਾਜ ਹੈਂ ॥ਗਨੀਮੁਲ ਖਿਰਾਜ ਹੈਂ ॥੨੨॥੧੨੪॥

ਨਿਰੁਕਤ ਸਰੂਪ ਹੈਂ ॥ ਤ੍ਰਿਮੁਕਤਿ ਬਿਭੂਤਿ ਹੈਂ ॥
ਪ੍ਰਭੁਗਤਿ ਪ੍ਰਭਾ ਹੈਂ ॥ ਸੁਜੁਗਤਿ ਸੁਧਾ ਹੈਂ ॥੨੩॥੧੨੫॥

ਸਦੈਵੰ ਸਰੂਪ ਹੈਂ ॥ ਅਭੇਦੀ ਅਨੂਪ ਹੈਂ ॥
ਸਮਸਤੋਪਰਾਜ ਹੈਂ ॥ ਸਦਾ ਸਰਬ ਸਾਜ ਹੈਂ ॥੨੪॥੧੨੬॥

ਸਮਸਤੁਲ ਸਲਾਮ ਹੈਂ ॥ ਸਦੈਵੁਲ ਅਕਾਮ ਹੈਂ ॥
ਨ੍ਰਿਬਾਧ ਸਰੂਪ ਹੈਂ ॥ਅਗਾਧ ਅਨੂਪ ਹੈਂ ॥੨੫॥੧੨੭॥

ਓਅੰ ਆਦਿ ਰੂਪੇ ॥ ਅਨਾਦਿ ਸਰੂਪੇ ॥
ਅਨੰਗੀ ਅਨਾਮੇ ॥ ਤ੍ਰਿਭੰਗੀ ਤ੍ਰਿਕਾਮੇ ॥੨੬॥੧੨੮॥

ਤ੍ਰਿਬਰਗੰ ਤ੍ਰਿਬਾਧੇ ॥ ਅਗੰਜੇ ਅਗਾਧੇ ॥
ਸੁਭੰ ਸਰਬ ਭਾਗੇ ॥ ਸੁ ਸਰਬਾਨੁਰਾਗੇ ॥੨੭॥੧੨੯॥

ਤ੍ਰਿਭੁਗਤ ਸਰੂਪ ਹੈਂ ॥ ਅਛਿਜ ਹੈਂ ਅਛੂਤ ਹੈਂ ॥
ਕਿ ਨਰਕੰ ਪ੍ਰਣਾਸ ਹੈਂ ॥ ਪ੍ਰਿਥੀਉਲ ਪ੍ਰਵਾਸ ਹੈਂ ॥੨੮॥੧੩੦॥

ਨਿਰੁਕਤਿ ਪ੍ਰਭਾ ਹੈਂ ॥ ਸਦੈਵੰ ਸਦਾ ਹੈਂ ॥
ਬਿਭੁਗਤਿ ਸਰੂਪ ਹੈਂ ॥ ਪ੍ਰਜੁਗਤਿ ਅਨੂਪ ਹੈਂ ॥੨੯॥੧੩੧॥

ਨਿਰੁਕਤਿ ਸਦਾ ਹੈਂ ॥ ਬਿਭੁਗਤਿ ਪ੍ਰਭਾ ਹੈਂ ॥
ਅਨਉਕਤਿ ਸਰੂਪ ਹੈਂ ॥ ਪ੍ਰਜੁਗਤਿ ਅਨੂਪ ਹੈਂ ॥੩੦॥੧੩੨॥

ਚਾਚਰੀ ਛੰਦ ॥ ਅਭੰਗ ਹੈਂ ॥
ਅਨੰਗ ਹੈਂ ॥ ਅਭੇਖ ਹੈਂ ॥ ਅਲੇਖ ਹੈਂ ॥੧॥੧੩੩॥

ਅਭਰਮ ਹੈਂ ॥ ਅਕਰਮ ਹੈਂ ॥
ਅਨਾਦਿ ਹੈਂ ॥ ਜੁਗਾਦਿ ਹੈਂ ॥੨॥੧੩੪॥

ਅਜੈ ਹੈਂ ॥ ਅਬੈ ਹੈਂ ॥
ਅਭੂਤ ਹੈਂ ॥ ਅਧੂਤ ਹੈਂ ॥੩॥੧੩੫॥

ਅਨਾਸ ਹੈਂ ॥ ਉਦਾਸ ਹੈਂ ॥
ਅਧੰਧ ਹੈਂ ॥ ਅਬੰਧ ਹੈਂ ॥੪॥੧੩੬॥

ਅਭਗਤ ਹੈਂ ॥ ਬਿਰਕਤ ਹੈਂ ॥
ਅਨਾਸ ਹੈਂ ॥ ਪ੍ਰਕਾਸ ਹੈਂ ॥੫॥੧੩੭॥

ਨਿਚਿੰਤ ਹੈਂ ॥ ਸੁਨਿੰਤ ਹੈਂ ॥
ਅਲਿਖ ਹੈਂ ॥ ਅਦਿਖ ਹੈਂ ॥੬॥੧੩੮॥

ਅਲੇਖ ਹੈਂ ॥ ਅਭੇਖ ਹੈਂ ॥
ਅਢਾਹ ਹੈਂ ॥ਅਗਾਹ ਹੈਂ ॥੭॥੧੩੯॥

ਅਸੰਭ ਹੈਂ ॥ ਅਗੰਭ ਹੈਂ ॥
ਅਨੀਲ ਹੈਂ ॥ ਅਨਾਦਿ ਹੈਂ ॥੮॥੧੪੦॥

ਅਨਿਤ ਹੈਂ ॥ਸੁਨਿਤ ਹੈਂ ॥
ਅਜਾਤ ਹੈਂ ॥ ਅਜਾਦਿ ਹੈਂ ॥੯॥੧੪੧॥

ਚਰਪਟ ਛੰਦ ॥ ਤ੍ਵਪ੍ਰਸਾਦਿ ॥
ਸਰਬੰ ਹੰਤਾ ॥ਸਰਬੰ ਗੰਤਾ ॥
ਸਰਬੰ ਖਿਆਤਾ ॥
ਸਰਬੰ ਗਿਆਤਾ ॥੧॥੧੪੨॥

ਸਰਬੰ ਹਰਤਾ ॥ ਸਰਬੰ ਕਰਤਾ ॥
ਸਰਬੰ ਪ੍ਰਾਣੰ ॥ ਸਰਬੰ ਤ੍ਰਾਣੰ ॥੨॥੧੪੩॥

ਸਰਬੰ ਕਰਮੰ ॥ ਸਰਬੰ ਧਰਮੰ ॥
ਸਰਬੰ ਜੁਗਤਾ ॥ ਸਰਬੰ ਮੁਕਤਾ ॥੩॥੧੪੪॥

ਰਸਾਵਲ ਛੰਦ ॥ ਤ੍ਵਪ੍ਰਸਾਦਿ ॥
ਨਮੋ ਨਰਕ ਨਾਸੇ ॥ ਸਦੈਵੰ ਪ੍ਰਕਾਸੇ ॥
ਅਨੰਗੰ ਸਰੂਪੇ ॥ ਅਭੰਗੰ ਬਿਭੂਤੇ ॥੧॥੧੪੫॥

ਪ੍ਰਮਾਥੰ ਪ੍ਰਮਾਥੇ ॥ ਸਦਾ ਸਰਬ ਸਾਥੇ ॥
ਅਗਾਧ ਸਰੂਪੇ ॥ ਨ੍ਰਿਬਾਧ ਬਿਭੂਤੇ ॥੨॥੧੪੬॥

ਅਨੰਗੀ ਅਨਾਮੇ ॥ ਤ੍ਰਿਭੰਗੀ ਤ੍ਰਿਕਾਮੇ ॥
ਨ੍ਰਿਭੰਗੀ ਸਰੂਪੇ ॥ਸਰਬੰਗੀ ਅਨੂਪੇ ॥੩॥੧੪੭॥

ਨ ਪੋਤ੍ਰੈ ਨ ਪੁਤ੍ਰੈ ॥ ਨ ਸਤ੍ਰੈ ਨ ਮਿਤ੍ਰੈ ॥
ਨ ਤਾਤੈ ਨ ਮਾਤੈ ॥ ਨ ਜਾਤੈ ਨ ਪਾਤੈ ॥੪॥੧੪੮॥

ਨ੍ਰਿਸਾਕੰ ਸਰੀਕ ਹੈਂ ॥ ਅਮਿਤੋ ਅਮੀਕ ਹੈਂ ॥
ਸਦੈਵੰ ਪ੍ਰਭਾ ਹੈਂ ॥ ਅਜੈ ਹੈਂ ਅਜਾ ਹੈਂ ॥੫॥੧੪੯॥

ਭਗਵਤੀ ਛੰਦ ॥ ਤ੍ਵਪ੍ਰਸਾਦਿ ॥
ਕਿ ਜਾਹਿਰ ਜਹੂਰ ਹੈਂ ॥ ਕਿ ਹਾਜਿਰ ਹਜੂਰ ਹੈਂ ॥
ਹਮੇਸੁਲ ਸਲਾਮ ਹੈਂ ॥ ਸਮਸਤੁਲ ਕਲਾਮ ਹੈਂ ॥੧॥੧੫੦॥

ਕਿ ਸਾਹਿਬ ਦਿਮਾਗ ਹੈਂ ॥ ਕਿ ਹੁਸਨੁਲ ਚਰਾਗ ਹੈਂ ॥
ਕਿ ਕਾਮਲ ਕਰੀਮ ਹੈਂ ॥ ਕਿ ਰਾਜਕ ਰਹੀਮ ਹੈਂ ॥੨॥੧੫੧॥

ਕਿ ਰੋਜੀ ਦਿਹਿੰਦ ਹੈਂ ॥ ਕਿ ਰਾਜਕ ਰਹਿੰਦ ਹੈਂ ॥
ਕਰੀਮੁਲ ਕਮਾਲ ਹੈਂ ॥ ਕਿ ਹੁਸਨੁਲ ਜਮਾਲ ਹੈਂ ॥੩॥੧੫੨॥

ਗਨੀਮੁਲ ਖਿਰਾਜ ਹੈਂ ॥ ਗਰੀਬੁਲ ਨਿਵਾਜ ਹੈਂ ॥
ਹਰੀਫੁਲ ਸਿਕੰਨ ਹੈਂ ॥ ਹਿਰਾਸੁਲ ਫਿਕੰਨ ਹੈਂ ॥੪॥੧੫੩॥

ਕਲੰਕੰ ਪ੍ਰਣਾਸ ਹੈਂ ॥ ਸਮਸਤੁਲ ਨਿਵਾਸ ਹੈਂ ॥
ਅਗੰਜੁਲ ਗਨੀਮ ਹੈਂ ॥ ਰਜਾਇਕ ਰਹੀਮ ਹੈ ॥੫॥੧੫੪॥

ਸਮਸਤੁਲ ਜੁਬਾਂ ਹੈਂ ॥ ਕਿ ਸਾਹਿਬ ਕਿਰਾ ਹੈਂ ॥
ਕਿ ਨਰਕੰ ਪ੍ਰਣਾਸ ਹੈਂ ॥ ਬਹਿਸਤੁਲ ਨਿਵਾਸ ਹੈਂ ॥੬॥੧੫੫॥

ਕਿ ਸਰਬੁਲ ਗਵੰਨ ਹੈਂ ॥ ਹਮੇਸੁਲ ਰਵੰਨ ਹੈ ॥
ਤਮਾਮੁਲ ਤਮੀਜ ਹੈਂ ॥ ਸਮਸਤੁਲ ਅਜੀਜ ਹੈਂ ॥੭॥੧੫੬॥

ਪਰੰ ਪਰਮ ਈਸ ਹੈਂ ॥ ਸਮਸਤੁਲ ਅਦੀਸ ਹੈਂ ॥
ਅਦੇਸੁਲ ਅਲੇਖ ਹੈਂ ॥ ਹਮੇਸੁਲ ਅਭੇਖ ਹੈਂ ॥੮॥੧੫੭॥

ਜਮੀਨੁਲ ਜਮਾਂ ਹੈਂ ॥ ਅਮੀਕੁਲ ਇਮਾਂ ਹੈਂ ॥
ਕਰੀਮੁਲ ਕਮਾਲ ਹੈਂ ॥ ਕਿ ਜੁਰਅਤ ਜਮਾਲ ਹੈਂ ॥੯॥੧੫੮॥

ਕਿ ਅਚਲੰ ਪ੍ਰਕਾਸ ਹੈਂ ॥ ਕਿ ਅਮਿਤੋ ਸੁਬਾਸ ਹੈਂ ॥
ਕਿ ਅਜਬ ਸਰੂਪ ਹੈਂ ॥ ਕਿ ਅਮਿਤੋ ਬਿਭੂਤਿ ਹੈਂ ॥੧੦॥੧੫੯॥

ਕਿ ਅਮਿਤੋ ਪਸਾ ਹੈਂ ॥ ਕਿ ਆਤਮ ਪ੍ਰਭਾ ਹੈਂ ॥
ਕਿ ਅਚਲੰ ਅਨੰਗ ਹੈਂ ॥ ਕਿ ਅਮਿਤੋ ਅਭੰਗ ਹੈਂ ॥੧੧॥੧੬੦॥

ਮਧੁਭਾਰ ਛੰਦ ॥ ਤ੍ਵਪ੍ਰਸਾਦਿ ॥

ਮੁਨਿ ਮਨਿ ਪ੍ਰਨਾਮ ॥ਗੁਨਿ ਗਨ ਮੁਦਾਮ ॥
ਅਰਿ ਬਰ ਅਗੰਜ ॥ ਹਰਿ ਨਰ ਪ੍ਰਭੰਜ ॥੧॥੧੬੧॥

ਅਨ ਗਨ ਪ੍ਰਨਾਮ ॥ ਮੁਨਿ ਮਨਿ ਸਲਾਮ ॥
ਹਰਿ ਨਰ ਅਖੰਡ ॥ਬਰ ਨਰ ਅਮੰਡ ॥੨॥੧੬੨॥

ਅਨਭਵ ਅਨਾਸ ॥ ਮੁਨਿ ਮਨਿ ਪ੍ਰਕਾਸ ॥
ਗੁਨਿ ਗਨ ਪ੍ਰਨਾਮ ॥ ਜਲ ਥਲ ਮੁਦਾਮ ॥੩॥੧੬੩॥

ਅਨਛਿਜ ਅੰਗ ॥ ਆਸਨ ਅਭੰਗ ॥
ਉਪਮਾ ਅਪਾਰ ॥ ਗਤਿ ਮਿਤਿ ਉਦਾਰ ॥੪॥੧੬੪॥

ਜਲ ਥਲ ਅਮੰਡ ॥ਦਿਸ ਵਿਸ ਅਭੰਡ ॥
ਜਲ ਥਲ ਮਹੰਤ ॥ਦਿਸ ਵਿਸ ਬਿਅੰਤ ॥੫॥੧੬੫॥

ਅਨਭਵ ਅਨਾਸ ॥ ਧ੍ਰਿਤ ਧਰ ਧੁਰਾਸ ॥
ਆਜਾਨ ਬਾਹੁ ॥ ਏਕੈ ਸਦਾਹੁ ॥੬॥੧੬੬॥

ਓਅੰਕਾਰ ਆਦਿ ॥ ਕਥਨੀ ਅਨਾਦਿ ॥
ਖਲ ਖੰਡ ਖਿਆਲ ॥ ਗੁਰ ਬਰ ਅਕਾਲ ॥੭॥੧੬੭॥

ਘਰਿ ਘਰਿ ਪ੍ਰਨਾਮ ॥ ਚਿਤ ਚਰਨ ਨਾਮ ॥
ਅਨਛਿਜ ਗਾਤ ॥ ਆਜਿਜ ਨ ਬਾਤ ॥੮॥੧੬੮॥

ਅਨਝੰਝ ਗਾਤ ॥ ਅਨਰੰਜ ਬਾਤ ॥
ਅਨਟੁਟ ਭੰਡਾਰ ॥ ਅਨਠਟ ਅਪਾਰ ॥੯॥੧੬੯॥

ਆਡੀਠ ਧਰਮ ॥ ਅਤਿ ਢੀਠ ਕਰਮ ॥
ਅਨਬ੍ਰਣ ਅਨੰਤ ॥ ਦਾਤਾ ਮਹੰਤ ॥੧੦॥੧੭੦॥

ਹਰਿਬੋਲਮਨਾ ਛੰਦ ॥ ਤ੍ਵਪ੍ਰਸਾਦਿ ॥

ਕਰੁਣਾਲਯ ਹੈਂ ॥ ਅਰਿ ਘਾਲਯ ਹੈਂ ॥
ਖਲ ਖੰਡਨ ਹੈਂ ॥ਮਹਿ ਮੰਡਨ ਹੈਂ ॥੧॥੧੭੧॥

ਜਗਤੇਸ੍ਵਰ ਹੈਂ ॥ ਪਰਮੇਸ੍ਵਰ ਹੈਂ ॥
ਕਲਿ ਕਾਰਣ ਹੈਂ ॥ ਸਰਬ ਉਬਾਰਣ ਹੈਂ ॥੨॥੧੭੨॥

ਧ੍ਰਿਤ ਕੇ ਧਰਣ ਹੈਂ ॥ ਜਗ ਕੇ ਕਰਣ ਹੈਂ ॥
ਮਨ ਮਾਨਿਯ ਹੈਂ ॥ਜਗ ਜਾਨਿਯ ਹੈਂ ॥੩॥੧੭੩॥

ਸਰਬੰ ਭਰ ਹੈਂ ॥ ਸਰਬੰ ਕਰ ਹੈਂ ॥
ਸਰਬ ਪਾਸਿਯ ਹੈਂ ॥ ਸਰਬ ਨਾਸਿਯ ਹੈਂ ॥੪॥੧੭੪॥

ਕਰੁਣਾਕਰ ਹੈਂ ॥ ਬਿਸ੍ਵੰਭਰ ਹੈਂ ॥
ਸਰਬੇਸ੍ਵਰ ਹੈਂ ॥ ਜਗਤੇਸ੍ਵਰ ਹੈਂ ॥੫॥੧੭੫॥

ਬ੍ਰਹਮੰਡਸ ਹੈਂ ॥ ਖਲ ਖੰਡਸ ਹੈਂ ॥
ਪਰ ਤੇ ਪਰ ਹੈਂ ॥ ਕਰੁਣਾਕਰ ਹੈਂ ॥੬॥੧੭੬॥

ਅਜਪਾ ਜਪ ਹੈਂ ॥ ਅਥਪਾ ਥਪ ਹੈਂ ॥
ਅਕ੍ਰਿਤਾ ਕ੍ਰਿਤ ਹੈਂ ॥ ਅਮ੍ਰਿਤਾ ਮ੍ਰਿਤ ਹੈਂ ॥੭॥੧੭੭॥

ਅਮ੍ਰਿਤਾ ਮ੍ਰਿਤ ਹੈਂ ॥ ਕਰੁਣਾ ਕ੍ਰਿਤ ਹੈਂ ॥
ਅਕ੍ਰਿਤਾ ਕ੍ਰਿਤ ਹੈਂ ॥ ਧਰਣੀ ਧ੍ਰਿਤ ਹੈਂ ॥੮॥੧੭੮॥

ਅਮਿਤੇਸ੍ਵਰ ਹੈਂ ॥ ਪਰਮੇਸ੍ਵਰ ਹੈਂ ॥
ਅਕ੍ਰਿਤਾ ਕ੍ਰਿਤ ਹੈਂ ॥ ਅਮ੍ਰਿਤਾ ਮ੍ਰਿਤ ਹੈਂ ॥੯॥੧੭੯॥

ਅਜਬਾ ਕ੍ਰਿਤ ਹੈਂ ॥ ਅਮ੍ਰਿਤਾ ਮ੍ਰਿਤ ਹੈਂ ॥
ਨਰ ਨਾਇਕ ਹੈਂ ॥ ਖਲ ਘਾਇਕ ਹੈਂ ॥੧੦॥੧੮੦॥

ਬਿਸ੍ਵੰਭਰ ਹੈਂ ॥ ਕਰੁਣਾਲਯ ਹੈਂ ॥
ਨ੍ਰਿਪ ਨਾਇਕ ਹੈਂ ॥ ਸਰਬ ਪਾਇਕ ਹੈਂ ॥੧੧॥੧੮੧॥

ਭਵ ਭੰਜਨ ਹੈਂ ॥ ਅਰਿ ਗੰਜਨ ਹੈਂ ॥
ਰਿਪੁ ਤਾਪਨ ਹੈਂ ॥ ਜਪੁ ਜਾਪਨ ਹੈਂ ॥੧੨॥੧੮੨॥

ਅਕਲੰਕ੍ਰਿਤ ਹੈਂ ॥ ਸਰਬਾ ਕ੍ਰਿਤ ਹੈਂ ॥
ਕਰਤਾ ਕਰ ਹੈਂ ॥ ਹਰਤਾ ਹਰਿ ਹੈਂ ॥੧੩॥੧੮੩॥

ਪਰਮਾਤਮ ਹੈਂ ॥ ਸਰਬਾਤਮ ਹੈਂ ॥
ਆਤਮ ਬਸ ਹੈਂ ॥ਜਸ ਕੇ ਜਸ ਹੈਂ ॥੧੪॥੧੮੪॥

ਭੁਜੰਗ ਪ੍ਰਯਾਤ ਛੰਦ ॥
ਨਮੋ ਸੂਰਜ ਸੂਰਜੇ ਨਮੋ ਚੰਦ੍ਰ ਚੰਦ੍ਰੇ ॥
ਨਮੋ ਰਾਜ ਰਾਜੇ ਨਮੋ ਇੰਦ੍ਰ ਇੰਦ੍ਰੇ ॥
ਨਮੋ ਅੰਧਕਾਰੇ ਨਮੋ ਤੇਜ ਤੇਜੇ ॥
ਨਮੋ ਬ੍ਰਿੰਦ ਬ੍ਰਿੰਦੇ ਨਮੋ ਬੀਜ ਬੀਜੇ ॥੧॥੧੮੫॥

ਨਮੋ ਰਾਜਸੰ ਤਾਮਸੰ ਸਾਂਤਿ ਰੂਪੇ ॥
ਨਮੋ ਪਰਮ ਤਤੰ ਅਤਤੰ ਸਰੂਪੇ ॥
ਨਮੋ ਜੋਗ ਜੋਗੇ ਨਮੋ ਗਿਆਨ ਗਿਆਨੇ ॥
ਨਮੋ ਮੰਤ੍ਰ ਮੰਤ੍ਰੇ ਨਮੋ ਧਿਆਨ ਧਿਆਨੇ ॥੨॥੧੮੬॥

ਨਮੋ ਜੁਧ ਜੁਧੇ ਨਮੋ ਗਿਆਨ ਗਿਆਨੇ ॥
ਨਮੋ ਭੋਜ ਭੋਜੇ ਨਮੋ ਪਾਨ ਪਾਨੇ ॥
ਨਮੋ ਕਲਹ ਕਰਤਾ ਨਮੋ ਸਾਂਤਿ ਰੂਪੇ ॥
ਨਮੋ ਇੰਦ੍ਰ ਇੰਦ੍ਰੇ ਅਨਾਦੰ ਬਿਭੂਤੇ ॥੩॥੧੮੭॥

ਕਲੰਕਾਰ ਰੂਪੇ ਅਲੰਕਾਰ ਅਲੰਕੇ ॥
ਨਮੋ ਆਸ ਆਸੇ ਨਮੋ ਬਾਕ ਬੰਕੇ ॥
ਅਭੰਗੀ ਸਰੂਪੇ ਅਨੰਗੀ ਅਨਾਮੇ ॥
ਤ੍ਰਿਭੰਗੀ ਤ੍ਰਿਕਾਲੇ ਅਨੰਗੀ ਅਕਾਮੇ ॥੪॥੧੮੮॥

ਏਕ ਅਛਰੀ ਛੰਦ ॥

ਅਜੈ ॥ ਅਲੈ ॥
ਅਭੈ ॥ ਅਬੈ ॥੧॥੧੮੯॥

ਅਭੂ ॥ ਅਜੂ ॥
ਅਨਾਸ ॥ ਅਕਾਸ ॥੨॥੧੯੦॥

ਅਗੰਜ ॥ ਅਭੰਜ ॥
ਅਲਖ ॥ ਅਭਖ ॥੩॥੧੯੧॥

ਅਕਾਲ ॥ ਦਿਆਲ ॥
ਅਲੇਖ ॥ ਅਭੇਖ ॥੪॥੧੯੨॥

ਅਨਾਮ ॥ ਅਕਾਮ ॥
ਅਗਾਹ ॥ ਅਢਾਹ ॥੫॥੧੯੩॥

ਅਨਾਥੇ ॥ ਪ੍ਰਮਾਥੇ ॥
ਅਜੋਨੀ ॥ ਅਮੋਨੀ ॥੬॥੧੯੪॥

ਨ ਰਾਗੇ ॥ ਨ ਰੰਗੇ ॥
ਨ ਰੂਪੇ ॥ ਨ ਰੇਖੇ ॥੭॥੧੯੫॥

ਅਕਰਮੰ ॥ ਅਭਰਮੰ ॥
ਅਗੰਜੇ ॥ਅਲੇਖੇ ॥੮॥੧੯੬॥

ਭੁਜੰਗ ਪ੍ਰਯਾਤ ਛੰਦ ॥

ਨਮਸਤੁਲ ਪ੍ਰਨਾਮੇ ਸਮਸਤੁਲ ਪ੍ਰਣਾਸੇ ॥
ਅਗੰਜੁਲ ਅਨਾਮੇ ਸਮਸਤੁਲ ਨਿਵਾਸੇ ॥
ਨਿਰਕਾਮੰ ਬਿਭੂਤੇ ਸਮਸਤੁਲ ਸਰੂਪੇ ॥
ਕੁਕਰਮੰ ਪ੍ਰਣਾਸੀ ਸੁਧਰਮੰ ਬਿਭੂਤੇ ॥੧॥੧੯੭॥

ਸਦਾ ਸਚਿਦਾਨੰਦ ਸਤ੍ਰੰ ਪ੍ਰਣਾਸੀ ॥
ਕਰੀਮੁਲ ਕੁਨਿੰਦਾ ਸਮਸਤੁਲ ਨਿਵਾਸੀ ॥
ਅਜਾਇਬ ਬਿਭੂਤੇ ਗਜਾਇਬ ਗਨੀਮੇ ॥
ਹਰੀਅੰ ਕਰੀਅੰ ਕਰੀਮਲੁ ਰਹੀਮੇ ॥੨॥੧੯੮॥

ਚਤ੍ਰ ਚਕ੍ਰ ਵਰਤੀ ਚਤ੍ਰ ਚਕ੍ਰ ਭੁਗਤੇ ॥
ਸੁਯੰਭਵ ਸੁਭੰ ਸਰਬਦਾ ਸਰਬ ਜੁਗਤੇ ॥
ਦੁਕਾਲੰ ਪ੍ਰਣਾਸੀ ਦਿਆਲੰ ਸਰੂਪੇ ॥
ਸਦਾ ਅੰਗ ਸੰਗੇ ਅਭੰਗੰ ਬਿਭੂਤੇ ॥੩॥੧੯੯॥''';
}
